SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460keua_template/common/hc32f460keua.h
typedef struct
{
    __IO uint8_t XTALSTP                    : 1;
    uint8_t RESERVED1                       : 7;
} stc_sysreg_cmu_xtalcr_field_t;

typedef struct
{
    __IO uint8_t HRCSTP                     : 1;
    uint8_t RESERVED1                       : 7;
} stc_sysreg_cmu_hrccr_field_t;

typedef struct
{
    __IO uint8_t MRCSTP                     : 1;
    uint8_t RESERVED1                       : 7;
} stc_sysreg_cmu_mrccr_field_t;

typedef struct
{
    __IO uint8_t HRCSTBF                    : 1;
    uint8_t RESERVED1                       : 2;
    __IO uint8_t XTALSTBF                   : 1;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t MPLLSTBF                   : 1;
    __IO uint8_t UPLLSTBF                   : 1;
    uint8_t RESERVED7                       : 1;
} stc_sysreg_cmu_oscstbsr_field_t;

typedef struct
{
    __IO uint8_t MCO1SEL                    : 4;
    __IO uint8_t MCO1DIV                    : 3;
    __IO uint8_t MCO1EN                     : 1;
} stc_sysreg_cmu_mco1cfgr_field_t;

typedef struct
{
    __IO uint8_t MCO2SEL                    : 4;
    __IO uint8_t MCO2DIV                    : 3;
    __IO uint8_t MCO2EN                     : 1;
} stc_sysreg_cmu_mco2cfgr_field_t;

typedef struct
{
    __IO uint8_t TPIUCKS                    : 2;
    uint8_t RESERVED2                       : 5;
    __IO uint8_t TPIUCKOE                   : 1;
} stc_sysreg_cmu_tpiuckcfgr_field_t;

typedef struct
{
    __IO uint8_t XTALSTDIE                  : 1;
    __IO uint8_t XTALSTDRE                  : 1;
    __IO uint8_t XTALSTDRIS                 : 1;
    uint8_t RESERVED3                       : 4;
    __IO uint8_t XTALSTDE                   : 1;
} stc_sysreg_cmu_xtalstdcr_field_t;

typedef struct
{
    __IO uint8_t XTALSTDF                   : 1;
    uint8_t RESERVED1                       : 7;
} stc_sysreg_cmu_xtalstdsr_field_t;

typedef struct
{
    __IO uint8_t XTALSTB                    : 4;
    uint8_t RESERVED4                       : 4;
} stc_sysreg_cmu_xtalstbcr_field_t;

typedef struct
{
    __IO uint16_t PORF                      : 1;
    __IO uint16_t PINRF                     : 1;
    __IO uint16_t BORF                      : 1;
    __IO uint16_t PVD1RF                    : 1;
    __IO uint16_t PVD2RF                    : 1;
    __IO uint16_t WDRF                      : 1;
    __IO uint16_t SWDRF                     : 1;
    __IO uint16_t PDRF                      : 1;
    __IO uint16_t SWRF                      : 1;
    __IO uint16_t MPUERF                    : 1;
    __IO uint16_t RAPERF                    : 1;
    __IO uint16_t RAECRF                    : 1;
    __IO uint16_t CKFERF                    : 1;
    __IO uint16_t XTALERF                   : 1;
    __IO uint16_t MULTIRF                   : 1;
    __IO uint16_t CLRF                      : 1;
} stc_sysreg_rmu_rstf0_field_t;

typedef struct
{
    __IO uint8_t PVD1NMIS                   : 1;
    uint8_t RESERVED1                       : 3;
    __IO uint8_t PVD2NMIS                   : 1;
    uint8_t RESERVED5                       : 3;
} stc_sysreg_pwr_pvdicr_field_t;

typedef struct
{
    __IO uint8_t PVD1MON                    : 1;
    __IO uint8_t PVD1DETFLG                 : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t PVD2MON                    : 1;
    __IO uint8_t PVD2DETFLG                 : 1;
    uint8_t RESERVED6                       : 2;
} stc_sysreg_pwr_pvddsr_field_t;

typedef struct
{
    __IO uint32_t MPLLM                     : 5;
    uint32_t RESERVED5                      : 2;
    __IO uint32_t PLLSRC                    : 1;
    __IO uint32_t MPLLN                     : 9;
    uint32_t RESERVED17                     : 3;
    __IO uint32_t MPLLR                     : 4;
    __IO uint32_t MPLLQ                     : 4;
    __IO uint32_t MPLLP                     : 4;
} stc_sysreg_cmu_pllcfgr_field_t;

typedef struct
{
    __IO uint32_t UPLLM                     : 5;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t UPLLN                     : 9;
    uint32_t RESERVED17                     : 3;
    __IO uint32_t UPLLR                     : 4;
    __IO uint32_t UPLLQ                     : 4;
    __IO uint32_t UPLLP                     : 4;
} stc_sysreg_cmu_upllcfgr_field_t;

typedef struct
{
    __IO uint16_t FPRCB0                    : 1;
    __IO uint16_t FPRCB1                    : 1;
    __IO uint16_t FPRCB2                    : 1;
    __IO uint16_t FPRCB3                    : 1;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t FPRCWE                    : 8;
} stc_sysreg_pwr_fprc_field_t;

typedef struct
{
    __IO uint8_t PDMDS                      : 2;
    __IO uint8_t VVDRSD                     : 1;
    __IO uint8_t RETRAMSD                   : 1;
    __IO uint8_t IORTN                      : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t PWDN                       : 1;
} stc_sysreg_pwr_pwrc0_field_t;

typedef struct
{
    __IO uint8_t VPLLSD                     : 1;
    __IO uint8_t VHRCSD                     : 1;
    uint8_t RESERVED2                       : 4;
    __IO uint8_t STPDAS                     : 2;
} stc_sysreg_pwr_pwrc1_field_t;

typedef struct
{
    __IO uint8_t DDAS                       : 4;
    __IO uint8_t DVS                        : 2;
    uint8_t RESERVED6                       : 2;
} stc_sysreg_pwr_pwrc2_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 2;
    __IO uint8_t PDTS                       : 1;
    uint8_t RESERVED3                       : 5;
} stc_sysreg_pwr_pwrc3_field_t;

typedef struct
{
    __IO uint8_t WKE00                      : 1;
    __IO uint8_t WKE01                      : 1;
    __IO uint8_t WKE02                      : 1;
    __IO uint8_t WKE03                      : 1;
    __IO uint8_t WKE10                      : 1;
    __IO uint8_t WKE11                      : 1;
    __IO uint8_t WKE12                      : 1;
    __IO uint8_t WKE13                      : 1;
} stc_sysreg_pwr_pdwke0_field_t;

typedef struct
{
    __IO uint8_t WKE20                      : 1;
    __IO uint8_t WKE21                      : 1;
    __IO uint8_t WKE22                      : 1;
    __IO uint8_t WKE23                      : 1;
    __IO uint8_t WKE30                      : 1;
    __IO uint8_t WKE31                      : 1;
    __IO uint8_t WKE32                      : 1;
    __IO uint8_t WKE33                      : 1;
} stc_sysreg_pwr_pdwke1_field_t;

typedef struct
{
    __IO uint8_t VD1WKE                     : 1;
    __IO uint8_t VD2WKE                     : 1;
    __IO uint8_t NMIWKE                     : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t RTCPRDWKE                  : 1;
    __IO uint8_t RTCALMWKE                  : 1;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t WKTMWKE                    : 1;
} stc_sysreg_pwr_pdwke2_field_t;

typedef struct
{
    __IO uint8_t WK0EGS                     : 1;
    __IO uint8_t WK1EGS                     : 1;
    __IO uint8_t WK2EGS                     : 1;
    __IO uint8_t WK3EGS                     : 1;
    __IO uint8_t VD1EGS                     : 1;
    __IO uint8_t VD2EGS                     : 1;
    __IO uint8_t NMIEGS                     : 1;
    uint8_t RESERVED7                       : 1;
} stc_sysreg_pwr_pdwkes_field_t;

typedef struct
{
    __IO uint8_t PTWK0F                     : 1;
    __IO uint8_t PTWK1F                     : 1;
    __IO uint8_t PTWK2F                     : 1;
    __IO uint8_t PTWK3F                     : 1;
    __IO uint8_t VD1WKF                     : 1;
    __IO uint8_t VD2WKF                     : 1;
    __IO uint8_t NMIWKF                     : 1;
    uint8_t RESERVED7                       : 1;
} stc_sysreg_pwr_pdwkf0_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 4;
    __IO uint8_t RTCPRDWKF                  : 1;
    __IO uint8_t RTCALMWKF                  : 1;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t WKTMWKF                    : 1;
} stc_sysreg_pwr_pdwkf1_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 7;
    __IO uint8_t ADBUFE                     : 1;
} stc_sysreg_pwr_pwcmr_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 4;
    __IO uint8_t XTALDRV                    : 2;
    __IO uint8_t XTALMS                     : 1;
    __IO uint8_t SUPDRV                     : 1;
} stc_sysreg_cmu_xtalcfgr_field_t;

typedef struct
{
    __IO uint8_t EXVCCINEN                  : 1;
    uint8_t RESERVED1                       : 4;
    __IO uint8_t PVD1EN                     : 1;
    __IO uint8_t PVD2EN                     : 1;
    uint8_t RESERVED7                       : 1;
} stc_sysreg_pwr_pvdcr0_field_t;

typedef struct
{
    __IO uint8_t PVD1IRE                    : 1;
    __IO uint8_t PVD1IRS                    : 1;
    __IO uint8_t PVD1CMPOE                  : 1;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t PVD2IRE                    : 1;
    __IO uint8_t PVD2IRS                    : 1;
    __IO uint8_t PVD2CMPOE                  : 1;
    uint8_t RESERVED7                       : 1;
} stc_sysreg_pwr_pvdcr1_field_t;

typedef struct
{
    __IO uint8_t PVD1NFDIS                  : 1;
    __IO uint8_t PVD1NFCKS                  : 2;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t PVD2NFDIS                  : 1;
    __IO uint8_t PVD2NFCKS                  : 2;
    uint8_t RESERVED7                       : 1;
} stc_sysreg_pwr_pvdfcr_field_t;

typedef struct
{
    __IO uint8_t PVD1LVL                    : 3;
    uint8_t RESERVED3                       : 1;
    __IO uint8_t PVD2LVL                    : 3;
    uint8_t RESERVED7                       : 1;
} stc_sysreg_pwr_pvdlcr_field_t;

typedef struct
{
    __IO uint8_t XTAL32STP                  : 1;
    uint8_t RESERVED1                       : 7;
} stc_sysreg_cmu_xtal32cr_field_t;

typedef struct
{
    __IO uint8_t XTAL32DRV                  : 3;
    uint8_t RESERVED3                       : 5;
} stc_sysreg_cmu_xtal32cfgr_field_t;

typedef struct
{
    __IO uint8_t XTAL32NF                   : 2;
    uint8_t RESERVED2                       : 6;
} stc_sysreg_cmu_xtal32nfr_field_t;

typedef struct
{
    __IO uint8_t LRCSTP                     : 1;
    uint8_t RESERVED1                       : 7;
} stc_sysreg_cmu_lrccr_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 7;
    __IO uint8_t CSDIS                      : 1;
} stc_sysreg_pwr_xtal32cs_field_t;

typedef struct
{
    __IO uint32_t CNTA                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr0_cntar_field_t;

typedef struct
{
    __IO uint32_t CNTB                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr0_cntbr_field_t;

typedef struct
{
    __IO uint32_t CMPA                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr0_cmpar_field_t;

typedef struct
{
    __IO uint32_t CMPB                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr0_cmpbr_field_t;

typedef struct
{
    __IO uint32_t CSTA                      : 1;
    __IO uint32_t CAPMDA                    : 1;
    __IO uint32_t INTENA                    : 1;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t CKDIVA                    : 4;
    __IO uint32_t SYNSA                     : 1;
    __IO uint32_t SYNCLKA                   : 1;
    __IO uint32_t ASYNCLKA                  : 1;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t HSTAA                     : 1;
    __IO uint32_t HSTPA                     : 1;
    __IO uint32_t HCLEA                     : 1;
    __IO uint32_t HICPA                     : 1;
    __IO uint32_t CSTB                      : 1;
    __IO uint32_t CAPMDB                    : 1;
    __IO uint32_t INTENB                    : 1;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t CKDIVB                    : 4;
    __IO uint32_t SYNSB                     : 1;
    __IO uint32_t SYNCLKB                   : 1;
    __IO uint32_t ASYNCLKB                  : 1;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t HSTAB                     : 1;
    __IO uint32_t HSTPB                     : 1;
    __IO uint32_t HCLEB                     : 1;
    __IO uint32_t HICPB                     : 1;
} stc_tmr0_bconr_field_t;

typedef struct
{
    __IO uint32_t CMAF                      : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t CMBF                      : 1;
    uint32_t RESERVED17                     :15;
} stc_tmr0_stflr_field_t;

typedef struct
{
    __IO uint16_t OCEH                      : 1;
    __IO uint16_t OCEL                      : 1;
    __IO uint16_t OCPH                      : 1;
    __IO uint16_t OCPL                      : 1;
    __IO uint16_t OCIEH                     : 1;
    __IO uint16_t OCIEL                     : 1;
    __IO uint16_t OCFH                      : 1;
    __IO uint16_t OCFL                      : 1;
    uint16_t RESERVED8                      : 8;
} stc_tmr4_ocsr_field_t;

typedef struct
{
    __IO uint16_t CHBUFEN                   : 2;
    __IO uint16_t CLBUFEN                   : 2;
    __IO uint16_t MHBUFEN                   : 2;
    __IO uint16_t MLBUFEN                   : 2;
    __IO uint16_t LMCH                      : 1;
    __IO uint16_t LMCL                      : 1;
    __IO uint16_t LMMH                      : 1;
    __IO uint16_t LMML                      : 1;
    __IO uint16_t MCECH                     : 1;
    __IO uint16_t MCECL                     : 1;
    uint16_t RESERVED14                     : 2;
} stc_tmr4_ocer_field_t;

typedef struct
{
    __IO uint16_t OCFDCH                    : 1;
    __IO uint16_t OCFPKH                    : 1;
    __IO uint16_t OCFUCH                    : 1;
    __IO uint16_t OCFZRH                    : 1;
    __IO uint16_t OPDCH                     : 2;
    __IO uint16_t OPPKH                     : 2;
    __IO uint16_t OPUCH                     : 2;
    __IO uint16_t OPZRH                     : 2;
    __IO uint16_t OPNPKH                    : 2;
    __IO uint16_t OPNZRH                    : 2;
} stc_tmr4_ocmrh_field_t;

typedef struct
{
    __IO uint32_t OCFDCL                    : 1;
    __IO uint32_t OCFPKL                    : 1;
    __IO uint32_t OCFUCL                    : 1;
    __IO uint32_t OCFZRL                    : 1;
    __IO uint32_t OPDCL                     : 2;
    __IO uint32_t OPPKL                     : 2;
    __IO uint32_t OPUCL                     : 2;
    __IO uint32_t OPZRL                     : 2;
    __IO uint32_t OPNPKL                    : 2;
    __IO uint32_t OPNZRL                    : 2;
    __IO uint32_t EOPNDCL                   : 2;
    __IO uint32_t EOPNUCL                   : 2;
    __IO uint32_t EOPDCL                    : 2;
    __IO uint32_t EOPPKL                    : 2;
    __IO uint32_t EOPUCL                    : 2;
    __IO uint32_t EOPZRL                    : 2;
    __IO uint32_t EOPNPKL                   : 2;
    __IO uint32_t EOPNZRL                   : 2;
} stc_tmr4_ocmrl_field_t;

typedef struct
{
    __IO uint16_t CKDIV                     : 4;
    __IO uint16_t CLEAR                     : 1;
    __IO uint16_t MODE                      : 1;
    __IO uint16_t STOP                      : 1;
    __IO uint16_t BUFEN                     : 1;
    __IO uint16_t IRQPEN                    : 1;
    __IO uint16_t IRQPF                     : 1;
    uint16_t RESERVED10                     : 3;
    __IO uint16_t IRQZEN                    : 1;
    __IO uint16_t IRQZF                     : 1;
    __IO uint16_t ECKEN                     : 1;
} stc_tmr4_ccsr_field_t;

typedef struct
{
    __IO uint16_t ZIM                       : 4;
    __IO uint16_t PIM                       : 4;
    __IO uint16_t ZIC                       : 4;
    __IO uint16_t PIC                       : 4;
} stc_tmr4_cvpr_field_t;

typedef struct
{
    __IO uint16_t DIVCK                     : 4;
    __IO uint16_t PWMMD                     : 2;
    __IO uint16_t LVLS                      : 2;
    uint16_t RESERVED8                      : 8;
} stc_tmr4_pocr_field_t;

typedef struct
{
    __IO uint16_t RTIDU                     : 1;
    __IO uint16_t RTIDV                     : 1;
    __IO uint16_t RTIDW                     : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t RTIFU                     : 1;
    __IO uint16_t RTICU                     : 1;
    __IO uint16_t RTEU                      : 1;
    __IO uint16_t RTSU                      : 1;
    __IO uint16_t RTIFV                     : 1;
    __IO uint16_t RTICV                     : 1;
    __IO uint16_t RTEV                      : 1;
    __IO uint16_t RTSV                      : 1;
    __IO uint16_t RTIFW                     : 1;
    __IO uint16_t RTICW                     : 1;
    __IO uint16_t RTEW                      : 1;
    __IO uint16_t RTSW                      : 1;
} stc_tmr4_rcsr_field_t;

typedef struct
{
    __IO uint16_t BUFEN                     : 2;
    __IO uint16_t EVTOS                     : 3;
    __IO uint16_t LMC                       : 1;
    uint16_t RESERVED6                      : 2;
    __IO uint16_t EVTMS                     : 1;
    __IO uint16_t EVTDS                     : 1;
    uint16_t RESERVED10                     : 2;
    __IO uint16_t DEN                       : 1;
    __IO uint16_t PEN                       : 1;
    __IO uint16_t UEN                       : 1;
    __IO uint16_t ZEN                       : 1;
} stc_tmr4_scsr_field_t;

typedef struct
{
    __IO uint16_t AMC                       : 4;
    uint16_t RESERVED4                      : 2;
    __IO uint16_t MZCE                      : 1;
    __IO uint16_t MPCE                      : 1;
    uint16_t RESERVED8                      : 8;
} stc_tmr4_scmr_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 7;
    __IO uint16_t HOLD                      : 1;
    uint16_t RESERVED8                      : 8;
} stc_tmr4_ecsr_field_t;

typedef struct
{
    __IO uint16_t EMBVAL                    : 2;
    uint16_t RESERVED2                      :14;
} stc_tmr4_cr_ecer1_field_t;

typedef struct
{
    __IO uint16_t EMBVAL                    : 2;
    uint16_t RESERVED2                      :14;
} stc_tmr4_cr_ecer2_field_t;

typedef struct
{
    __IO uint16_t EMBVAL                    : 2;
    uint16_t RESERVED2                      :14;
} stc_tmr4_cr_ecer3_field_t;

typedef struct
{
    __IO uint32_t CNT                       :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_cnter_field_t;

typedef struct
{
    __IO uint32_t PERA                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_perar_field_t;

typedef struct
{
    __IO uint32_t PERB                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_perbr_field_t;

typedef struct
{
    __IO uint32_t PERC                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_percr_field_t;

typedef struct
{
    __IO uint32_t GCMA                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_gcmar_field_t;

typedef struct
{
    __IO uint32_t GCMB                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_gcmbr_field_t;

typedef struct
{
    __IO uint32_t GCMC                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_gcmcr_field_t;

typedef struct
{
    __IO uint32_t GCMD                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_gcmdr_field_t;

typedef struct
{
    __IO uint32_t GCME                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_gcmer_field_t;

typedef struct
{
    __IO uint32_t GCMF                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_gcmfr_field_t;

typedef struct
{
    __IO uint32_t SCMA                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_scmar_field_t;

typedef struct
{
    __IO uint32_t SCMB                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_scmbr_field_t;

typedef struct
{
    __IO uint32_t SCMC                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_scmcr_field_t;

typedef struct
{
    __IO uint32_t SCMD                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_scmdr_field_t;

typedef struct
{
    __IO uint32_t SCME                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_scmer_field_t;

typedef struct
{
    __IO uint32_t SCMF                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_scmfr_field_t;

typedef struct
{
    __IO uint32_t DTUA                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_dtuar_field_t;

typedef struct
{
    __IO uint32_t DTDA                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_dtdar_field_t;

typedef struct
{
    __IO uint32_t DTUB                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_dtubr_field_t;

typedef struct
{
    __IO uint32_t DTDB                      :16;
    uint32_t RESERVED16                     :16;
} stc_tmr6_dtdbr_field_t;

typedef struct
{
    __IO uint32_t START                     : 1;
    __IO uint32_t MODE                      : 3;
    __IO uint32_t CKDIV                     : 3;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t DIR                       : 1;
    uint32_t RESERVED9                      : 7;
    __IO uint32_t ZMSKREV                   : 1;
    __IO uint32_t ZMSKPOS                   : 1;
    __IO uint32_t ZMSKVAL                   : 2;
    uint32_t RESERVED20                     :12;
} stc_tmr6_gconr_field_t;

typedef struct
{
    __IO uint32_t INTENA                    : 1;
    __IO uint32_t INTENB                    : 1;
    __IO uint32_t INTENC                    : 1;
    __IO uint32_t INTEND                    : 1;
    __IO uint32_t INTENE                    : 1;
    __IO uint32_t INTENF                    : 1;
    __IO uint32_t INTENOVF                  : 1;
    __IO uint32_t INTENUDF                  : 1;
    __IO uint32_t INTENDTE                  : 1;
    uint32_t RESERVED9                      : 7;
    __IO uint32_t INTENSAU                  : 1;
    __IO uint32_t INTENSAD                  : 1;
    __IO uint32_t INTENSBU                  : 1;
    __IO uint32_t INTENSBD                  : 1;
    uint32_t RESERVED20                     :12;
} stc_tmr6_iconr_field_t;

typedef struct
{
    __IO uint32_t CAPMDA                    : 1;
    __IO uint32_t STACA                     : 1;
    __IO uint32_t STPCA                     : 1;
    __IO uint32_t STASTPSA                  : 1;
    __IO uint32_t CMPCA                     : 2;
    __IO uint32_t PERCA                     : 2;
    __IO uint32_t OUTENA                    : 1;
    uint32_t RESERVED9                      : 2;
    __IO uint32_t EMBVALA                   : 2;
    uint32_t RESERVED13                     : 3;
    __IO uint32_t CAPMDB                    : 1;
    __IO uint32_t STACB                     : 1;
    __IO uint32_t STPCB                     : 1;
    __IO uint32_t STASTPSB                  : 1;
    __IO uint32_t CMPCB                     : 2;
    __IO uint32_t PERCB                     : 2;
    __IO uint32_t OUTENB                    : 1;
    uint32_t RESERVED25                     : 2;
    __IO uint32_t EMBVALB                   : 2;
    uint32_t RESERVED29                     : 3;
} stc_tmr6_pconr_field_t;

