SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460keua_template/common/hc32f460keua.h
typedef struct
{
    uint32_t RESERVED0                      : 1;
    __IO uint32_t MMISM                     : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t SOFM                      : 1;
    __IO uint32_t RXFNEM                    : 1;
    __IO uint32_t NPTXFEM                   : 1;
    __IO uint32_t GINAKEFFM                 : 1;
    __IO uint32_t GONAKEFFM                 : 1;
    uint32_t RESERVED8                      : 2;
    __IO uint32_t ESUSPM                    : 1;
    __IO uint32_t USBSUSPM                  : 1;
    __IO uint32_t USBRSTM                   : 1;
    __IO uint32_t ENUMDNEM                  : 1;
    __IO uint32_t ISOODRPM                  : 1;
    __IO uint32_t EOPFM                     : 1;
    uint32_t RESERVED16                     : 2;
    __IO uint32_t IEPIM                     : 1;
    __IO uint32_t OEPIM                     : 1;
    __IO uint32_t IISOIXFRM                 : 1;
    __IO uint32_t IPXFRM_INCOMPISOOUTM      : 1;
    __IO uint32_t DATAFSUSPM                : 1;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t HPRTIM                    : 1;
    __IO uint32_t HCIM                      : 1;
    __IO uint32_t PTXFEM                    : 1;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t CIDSCHGM                  : 1;
    __IO uint32_t DISCIM                    : 1;
    __IO uint32_t VBUSVIM                   : 1;
    __IO uint32_t WKUIM                     : 1;
} stc_usbfs_gintmsk_field_t;

typedef struct
{
    __IO uint32_t CHNUM_EPNUM               : 4;
    __IO uint32_t BCNT                      :11;
    __IO uint32_t DPID                      : 2;
    __IO uint32_t PKTSTS                    : 4;
    uint32_t RESERVED21                     :11;
} stc_usbfs_grxstsr_field_t;

typedef struct
{
    __IO uint32_t CHNUM_EPNUM               : 4;
    __IO uint32_t BCNT                      :11;
    __IO uint32_t DPID                      : 2;
    __IO uint32_t PKTSTS                    : 4;
    uint32_t RESERVED21                     :11;
} stc_usbfs_grxstsp_field_t;

typedef struct
{
    __IO uint32_t RXFD                      :11;
    uint32_t RESERVED11                     :21;
} stc_usbfs_grxfsiz_field_t;

typedef struct
{
    __IO uint32_t NPTXFSA                   :16;
    __IO uint32_t NPTXFD                    :16;
} stc_usbfs_hnptxfsiz_field_t;

typedef struct
{
    __IO uint32_t NPTXFSAV                  :16;
    __IO uint32_t NPTQXSAV                  : 8;
    __IO uint32_t NPTXQTOP                  : 7;
    uint32_t RESERVED31                     : 1;
} stc_usbfs_hnptxsts_field_t;

typedef struct
{
    __IO uint32_t PTXSA                     :12;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t PTXFD                     :11;
    uint32_t RESERVED27                     : 5;
} stc_usbfs_hptxfsiz_field_t;

typedef struct
{
    __IO uint32_t INEPTXSA                  :12;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t INEPTXFD                  :10;
    uint32_t RESERVED26                     : 6;
} stc_usbfs_dieptxf_field_t;

typedef struct
{
    __IO uint32_t FSLSPCS                   : 2;
    __IO uint32_t FSLSS                     : 1;
    uint32_t RESERVED3                      :29;
} stc_usbfs_hcfg_field_t;

typedef struct
{
    __IO uint32_t FRIVL                     :16;
    uint32_t RESERVED16                     :16;
} stc_usbfs_hfir_field_t;

typedef struct
{
    __IO uint32_t FRNUM                     :16;
    __IO uint32_t FTREM                     :16;
} stc_usbfs_hfnum_field_t;

typedef struct
{
    __IO uint32_t PTXFSAVL                  :16;
    __IO uint32_t PTXQSAV                   : 8;
    __IO uint32_t PTXQTOP                   : 8;
} stc_usbfs_hptxsts_field_t;

typedef struct
{
    __IO uint32_t HAINT                     :12;
    uint32_t RESERVED12                     :20;
} stc_usbfs_haint_field_t;

typedef struct
{
    __IO uint32_t HAINTM                    :12;
    uint32_t RESERVED12                     :20;
} stc_usbfs_haintmsk_field_t;

typedef struct
{
    __IO uint32_t PCSTS                     : 1;
    __IO uint32_t PCDET                     : 1;
    __IO uint32_t PENA                      : 1;
    __IO uint32_t PENCHNG                   : 1;
    uint32_t RESERVED4                      : 2;
    __IO uint32_t PRES                      : 1;
    __IO uint32_t PSUSP                     : 1;
    __IO uint32_t PRST                      : 1;
    uint32_t RESERVED9                      : 1;
    __IO uint32_t PLSTS                     : 2;
    __IO uint32_t PWPR                      : 1;
    uint32_t RESERVED13                     : 4;
    __IO uint32_t PSPD                      : 2;
    uint32_t RESERVED19                     :13;
} stc_usbfs_hprt_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     :11;
    __IO uint32_t EPNUM                     : 4;
    __IO uint32_t EPDIR                     : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t LSDEV                     : 1;
    __IO uint32_t EPTYP                     : 2;
    uint32_t RESERVED20                     : 2;
    __IO uint32_t DAD                       : 7;
    __IO uint32_t ODDFRM                    : 1;
    __IO uint32_t CHDIS                     : 1;
    __IO uint32_t CHENA                     : 1;
} stc_usbfs_hcchar_field_t;

typedef struct
{
    __IO uint32_t XFRC                      : 1;
    __IO uint32_t CHH                       : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t NAK                       : 1;
    __IO uint32_t ACK                       : 1;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t TXERR                     : 1;
    __IO uint32_t BBERR                     : 1;
    __IO uint32_t FRMOR                     : 1;
    __IO uint32_t DTERR                     : 1;
    uint32_t RESERVED11                     :21;
} stc_usbfs_hcint_field_t;

typedef struct
{
    __IO uint32_t XFRCM                     : 1;
    __IO uint32_t CHHM                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t STALLM                    : 1;
    __IO uint32_t NAKM                      : 1;
    __IO uint32_t ACKM                      : 1;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t TXERRM                    : 1;
    __IO uint32_t BBERRM                    : 1;
    __IO uint32_t FRMORM                    : 1;
    __IO uint32_t DTERRM                    : 1;
    uint32_t RESERVED11                     :21;
} stc_usbfs_hcintmsk_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    :19;
    __IO uint32_t PKTCNT                    :10;
    __IO uint32_t DPID                      : 2;
    uint32_t RESERVED31                     : 1;
} stc_usbfs_hctsiz_field_t;

typedef struct
{
    __IO uint32_t DSPD                      : 2;
    __IO uint32_t NZLSOHSK                  : 1;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t DAD                       : 7;
    __IO uint32_t PFIVL                     : 2;
    uint32_t RESERVED13                     :19;
} stc_usbfs_dcfg_field_t;

typedef struct
{
    __IO uint32_t RWUSIG                    : 1;
    __IO uint32_t SDIS                      : 1;
    __IO uint32_t GINSTS                    : 1;
    __IO uint32_t GONSTS                    : 1;
    uint32_t RESERVED4                      : 3;
    __IO uint32_t SGINAK                    : 1;
    __IO uint32_t CGINAK                    : 1;
    __IO uint32_t SGONAK                    : 1;
    __IO uint32_t CGONAK                    : 1;
    __IO uint32_t POPRGDNE                  : 1;
    uint32_t RESERVED12                     :20;
} stc_usbfs_dctl_field_t;

typedef struct
{
    __IO uint32_t SUSPSTS                   : 1;
    __IO uint32_t ENUMSPD                   : 2;
    __IO uint32_t EERR                      : 1;
    uint32_t RESERVED4                      : 4;
    __IO uint32_t FNSOF                     :14;
    uint32_t RESERVED22                     :10;
} stc_usbfs_dsts_field_t;

typedef struct
{
    __IO uint32_t XFRCM                     : 1;
    __IO uint32_t EPDM                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t TOM                       : 1;
    __IO uint32_t ITTXFEMSK                 : 1;
    __IO uint32_t INEPNMM                   : 1;
    __IO uint32_t INEPNEM                   : 1;
    uint32_t RESERVED7                      :25;
} stc_usbfs_diepmsk_field_t;

typedef struct
{
    __IO uint32_t XFRCM                     : 1;
    __IO uint32_t EPDM                      : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t STUPM                     : 1;
    __IO uint32_t OTEPDM                    : 1;
    uint32_t RESERVED5                      :27;
} stc_usbfs_doepmsk_field_t;

typedef struct
{
    __IO uint32_t IEPINT                    : 6;
    uint32_t RESERVED6                      :10;
    __IO uint32_t OEPINT                    : 6;
    uint32_t RESERVED22                     :10;
} stc_usbfs_daint_field_t;

typedef struct
{
    __IO uint32_t IEPINTM                   : 6;
    uint32_t RESERVED6                      :10;
    __IO uint32_t OEPINTM                   : 6;
    uint32_t RESERVED22                     :10;
} stc_usbfs_daintmsk_field_t;

typedef struct
{
    __IO uint32_t INEPTXFEM                 : 6;
    uint32_t RESERVED6                      :26;
} stc_usbfs_diepempmsk_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     : 2;
    uint32_t RESERVED2                      :13;
    __IO uint32_t USBAEP                    : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    uint32_t RESERVED28                     : 2;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_diepctl0_field_t;

typedef struct
{
    __IO uint32_t XFRC                      : 1;
    __IO uint32_t EPDISD                    : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t TOC                       : 1;
    __IO uint32_t TTXFE                     : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t INEPNE                    : 1;
    __IO uint32_t TXFE                      : 1;
    uint32_t RESERVED8                      :24;
} stc_usbfs_diepint0_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    : 7;
    uint32_t RESERVED7                      :12;
    __IO uint32_t PKTCNT                    : 2;
    uint32_t RESERVED21                     :11;
} stc_usbfs_dieptsiz0_field_t;

typedef struct
{
    __IO uint32_t INEPTFSAV                 :16;
    uint32_t RESERVED16                     :16;
} stc_usbfs_dtxfsts0_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBAEP                    : 1;
    __IO uint32_t EONUM_DPID                : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    uint32_t RESERVED20                     : 1;
    __IO uint32_t STALL                     : 1;
    __IO uint32_t TXFNUM                    : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SD0PID_SEVNFRM            : 1;
    __IO uint32_t SODDFRM                   : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_diepctl_field_t;

typedef struct
{
    __IO uint32_t XFRC                      : 1;
    __IO uint32_t EPDISD                    : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t TOC                       : 1;
    __IO uint32_t TTXFE                     : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t INEPNE                    : 1;
    __IO uint32_t TXFE                      : 1;
    uint32_t RESERVED8                      :24;
} stc_usbfs_diepint_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    :19;
    __IO uint32_t PKTCNT                    :10;
    uint32_t RESERVED29                     : 3;
} stc_usbfs_dieptsiz_field_t;

typedef struct
{
    __IO uint32_t INEPTFSAV                 :16;
    uint32_t RESERVED16                     :16;
} stc_usbfs_dtxfsts_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     : 2;
    uint32_t RESERVED2                      :13;
    __IO uint32_t USBAEP                    : 1;
    uint32_t RESERVED16                     : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    __IO uint32_t SNPM                      : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    uint32_t RESERVED28                     : 2;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_doepctl0_field_t;

typedef struct
{
    __IO uint32_t XFRC                      : 1;
    __IO uint32_t EPDISD                    : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t STUP                      : 1;
    __IO uint32_t OTEPDIS                   : 1;
    uint32_t RESERVED5                      : 1;
    __IO uint32_t B2BSTUP                   : 1;
    uint32_t RESERVED7                      :25;
} stc_usbfs_doepint_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    : 7;
    uint32_t RESERVED7                      :12;
    __IO uint32_t PKTCNT                    : 1;
    uint32_t RESERVED20                     : 9;
    __IO uint32_t STUPCNT                   : 2;
    uint32_t RESERVED31                     : 1;
} stc_usbfs_doeptsiz0_field_t;

typedef struct
{
    __IO uint32_t MPSIZ                     :11;
    uint32_t RESERVED11                     : 4;
    __IO uint32_t USBAEP                    : 1;
    __IO uint32_t DPID                      : 1;
    __IO uint32_t NAKSTS                    : 1;
    __IO uint32_t EPTYP                     : 2;
    __IO uint32_t SNPM                      : 1;
    __IO uint32_t STALL                     : 1;
    uint32_t RESERVED22                     : 4;
    __IO uint32_t CNAK                      : 1;
    __IO uint32_t SNAK                      : 1;
    __IO uint32_t SD0PID                    : 1;
    __IO uint32_t SD1PID                    : 1;
    __IO uint32_t EPDIS                     : 1;
    __IO uint32_t EPENA                     : 1;
} stc_usbfs_doepctl_field_t;

typedef struct
{
    __IO uint32_t XFRSIZ                    :19;
    __IO uint32_t PKTCNT                    :10;
    uint32_t RESERVED29                     : 3;
} stc_usbfs_doeptsiz_field_t;

typedef struct
{
    __IO uint32_t STPPCLK                   : 1;
    __IO uint32_t GATEHCLK                  : 1;
    uint32_t RESERVED2                      :30;
} stc_usbfs_pcgcctl_field_t;

typedef struct
{
    __IO uint32_t PERI                      : 2;
    uint32_t RESERVED2                      : 2;
    __IO uint32_t CKS                       : 4;
    __IO uint32_t WDPT                      : 4;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t SLPOFF                    : 1;
    uint32_t RESERVED17                     :14;
    __IO uint32_t ITS                       : 1;
} stc_wdt_cr_field_t;

typedef struct
{
    __IO uint32_t CNT                       :16;
    __IO uint32_t UDF                       : 1;
    __IO uint32_t REF                       : 1;
    uint32_t RESERVED18                     :14;
} stc_wdt_sr_field_t;

typedef struct
{
    __IO uint32_t RF                        :16;
    uint32_t RESERVED16                     :16;
} stc_wdt_rr_field_t;

typedef struct
{
    __IO uint16_t WKTMCMP                   :12;
    __IO uint16_t WKOVF                     : 1;
    __IO uint16_t WKCKS                     : 2;
    __IO uint16_t WKTCE                     : 1;
} stc_wktm_cr_field_t;


typedef struct
{
    union
    {
        __IO uint8_t STR;
        stc_adc_str_field_t STR_f;
    };
    uint8_t RESERVED1[1];
    union
    {
        __IO uint16_t CR0;
        stc_adc_cr0_field_t CR0_f;
    };
    union
    {
        __IO uint16_t CR1;
        stc_adc_cr1_field_t CR1_f;
    };
    uint8_t RESERVED3[4];
    union
    {
        __IO uint16_t TRGSR;
        stc_adc_trgsr_field_t TRGSR_f;
    };
    __IO uint16_t CHSELRA0;
    union
    {
        __IO uint16_t CHSELRA1;
        stc_adc_chselra1_field_t CHSELRA1_f;
    };
    __IO uint16_t CHSELRB0;
    union
    {
        __IO uint16_t CHSELRB1;
        stc_adc_chselrb1_field_t CHSELRB1_f;
    };
    __IO uint16_t AVCHSELR0;
    union
    {
        __IO uint16_t AVCHSELR1;
        stc_adc_avchselr1_field_t AVCHSELR1_f;
    };
    uint8_t RESERVED10[8];
    __IO uint8_t SSTR0;
    __IO uint8_t SSTR1;
    __IO uint8_t SSTR2;
    __IO uint8_t SSTR3;
    __IO uint8_t SSTR4;
    __IO uint8_t SSTR5;
    __IO uint8_t SSTR6;
    __IO uint8_t SSTR7;
    __IO uint8_t SSTR8;
    __IO uint8_t SSTR9;
    __IO uint8_t SSTR10;
    __IO uint8_t SSTR11;
    __IO uint8_t SSTR12;
    __IO uint8_t SSTR13;
    __IO uint8_t SSTR14;
    __IO uint8_t SSTR15;
    __IO uint8_t SSTRL;
    uint8_t RESERVED27[7];
    union
    {
        __IO uint16_t CHMUXR0;
        stc_adc_chmuxr0_field_t CHMUXR0_f;
    };
    union
    {
        __IO uint16_t CHMUXR1;
        stc_adc_chmuxr1_field_t CHMUXR1_f;
    };
    union
    {
        __IO uint16_t CHMUXR2;
        stc_adc_chmuxr2_field_t CHMUXR2_f;
    };
    union
    {
        __IO uint16_t CHMUXR3;
        stc_adc_chmuxr3_field_t CHMUXR3_f;
    };
    uint8_t RESERVED31[6];
    union
    {
        __IO uint8_t ISR;
        stc_adc_isr_field_t ISR_f;
    };
    union
    {
        __IO uint8_t ICR;
        stc_adc_icr_field_t ICR_f;
    };
    uint8_t RESERVED33[4];
    union
    {
        __IO uint16_t SYNCCR;
        stc_adc_synccr_field_t SYNCCR_f;
    };
    uint8_t RESERVED34[2];
    __IO uint16_t DR0;
    __IO uint16_t DR1;
    __IO uint16_t DR2;
    __IO uint16_t DR3;
    __IO uint16_t DR4;
    __IO uint16_t DR5;
    __IO uint16_t DR6;
    __IO uint16_t DR7;
    __IO uint16_t DR8;
    __IO uint16_t DR9;
    __IO uint16_t DR10;
    __IO uint16_t DR11;
    __IO uint16_t DR12;
    __IO uint16_t DR13;
    __IO uint16_t DR14;
    __IO uint16_t DR15;
    __IO uint16_t DR16;
    uint8_t RESERVED51[46];
    union
    {
        __IO uint16_t AWDCR;
        stc_adc_awdcr_field_t AWDCR_f;
    };
    uint8_t RESERVED52[2];
    __IO uint16_t AWDDR0;
    __IO uint16_t AWDDR1;
    uint8_t RESERVED54[4];
    __IO uint16_t AWDCHSR0;
    union
    {
        __IO uint16_t AWDCHSR1;
        stc_adc_awdchsr1_field_t AWDCHSR1_f;
    };
    __IO uint16_t AWDSR0;
    union
    {
        __IO uint16_t AWDSR1;
        stc_adc_awdsr1_field_t AWDSR1_f;
    };
    uint8_t RESERVED58[12];
    union
    {
        __IO uint16_t PGACR;
        stc_adc_pgacr_field_t PGACR_f;
    };
    union
    {
        __IO uint16_t PGAGSR;
        stc_adc_pgagsr_field_t PGAGSR_f;
    };
    uint8_t RESERVED60[8];
    union
    {
        __IO uint16_t PGAINSR0;
        stc_adc_pgainsr0_field_t PGAINSR0_f;
    };
    union
    {
        __IO uint16_t PGAINSR1;
        stc_adc_pgainsr1_field_t PGAINSR1_f;
    };
}M4_ADC_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CR;
        stc_aes_cr_field_t CR_f;
    };
    uint8_t RESERVED1[12];
    __IO uint32_t DR0;
    __IO uint32_t DR1;
    __IO uint32_t DR2;
    __IO uint32_t DR3;
    __IO uint32_t KR0;
    __IO uint32_t KR1;
    __IO uint32_t KR2;
    __IO uint32_t KR3;
}M4_AES_TypeDef;

