SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460keua_template/common/hc32f460keua.h
#define bM4_EMB1_INTEN_CMPINTEN                   (*((volatile unsigned int*)(0x422F8288UL)))
#define bM4_EMB1_INTEN_OSINTEN                    (*((volatile unsigned int*)(0x422F828CUL)))
#define bM4_EMB2_CTL_PORTINEN                     (*((volatile unsigned int*)(0x422F8400UL)))
#define bM4_EMB2_CTL_CMPEN0                       (*((volatile unsigned int*)(0x422F8404UL)))
#define bM4_EMB2_CTL_CMPEN1                       (*((volatile unsigned int*)(0x422F8408UL)))
#define bM4_EMB2_CTL_CMPEN2                       (*((volatile unsigned int*)(0x422F840CUL)))
#define bM4_EMB2_CTL_OSCSTPEN                     (*((volatile unsigned int*)(0x422F8414UL)))
#define bM4_EMB2_CTL_PWMSEN0                      (*((volatile unsigned int*)(0x422F8418UL)))
#define bM4_EMB2_CTL_PWMSEN1                      (*((volatile unsigned int*)(0x422F841CUL)))
#define bM4_EMB2_CTL_PWMSEN2                      (*((volatile unsigned int*)(0x422F8420UL)))
#define bM4_EMB2_CTL_NFSEL0                       (*((volatile unsigned int*)(0x422F8470UL)))
#define bM4_EMB2_CTL_NFSEL1                       (*((volatile unsigned int*)(0x422F8474UL)))
#define bM4_EMB2_CTL_NFEN                         (*((volatile unsigned int*)(0x422F8478UL)))
#define bM4_EMB2_CTL_INVSEL                       (*((volatile unsigned int*)(0x422F847CUL)))
#define bM4_EMB2_PWMLV_PWMLV0                     (*((volatile unsigned int*)(0x422F8480UL)))
#define bM4_EMB2_PWMLV_PWMLV1                     (*((volatile unsigned int*)(0x422F8484UL)))
#define bM4_EMB2_PWMLV_PWMLV2                     (*((volatile unsigned int*)(0x422F8488UL)))
#define bM4_EMB2_SOE_SOE                          (*((volatile unsigned int*)(0x422F8500UL)))
#define bM4_EMB2_STAT_PORTINF                     (*((volatile unsigned int*)(0x422F8580UL)))
#define bM4_EMB2_STAT_PWMSF                       (*((volatile unsigned int*)(0x422F8584UL)))
#define bM4_EMB2_STAT_CMPF                        (*((volatile unsigned int*)(0x422F8588UL)))
#define bM4_EMB2_STAT_OSF                         (*((volatile unsigned int*)(0x422F858CUL)))
#define bM4_EMB2_STAT_PORTINST                    (*((volatile unsigned int*)(0x422F8590UL)))
#define bM4_EMB2_STAT_PWMST                       (*((volatile unsigned int*)(0x422F8594UL)))
#define bM4_EMB2_STATCLR_PORTINFCLR               (*((volatile unsigned int*)(0x422F8600UL)))
#define bM4_EMB2_STATCLR_PWMSFCLR                 (*((volatile unsigned int*)(0x422F8604UL)))
#define bM4_EMB2_STATCLR_CMPFCLR                  (*((volatile unsigned int*)(0x422F8608UL)))
#define bM4_EMB2_STATCLR_OSFCLR                   (*((volatile unsigned int*)(0x422F860CUL)))
#define bM4_EMB2_INTEN_PORTINTEN                  (*((volatile unsigned int*)(0x422F8680UL)))
#define bM4_EMB2_INTEN_PWMINTEN                   (*((volatile unsigned int*)(0x422F8684UL)))
#define bM4_EMB2_INTEN_CMPINTEN                   (*((volatile unsigned int*)(0x422F8688UL)))
#define bM4_EMB2_INTEN_OSINTEN                    (*((volatile unsigned int*)(0x422F868CUL)))
#define bM4_EMB3_CTL_PORTINEN                     (*((volatile unsigned int*)(0x422F8800UL)))
#define bM4_EMB3_CTL_CMPEN0                       (*((volatile unsigned int*)(0x422F8804UL)))
#define bM4_EMB3_CTL_CMPEN1                       (*((volatile unsigned int*)(0x422F8808UL)))
#define bM4_EMB3_CTL_CMPEN2                       (*((volatile unsigned int*)(0x422F880CUL)))
#define bM4_EMB3_CTL_OSCSTPEN                     (*((volatile unsigned int*)(0x422F8814UL)))
#define bM4_EMB3_CTL_PWMSEN0                      (*((volatile unsigned int*)(0x422F8818UL)))
#define bM4_EMB3_CTL_PWMSEN1                      (*((volatile unsigned int*)(0x422F881CUL)))
#define bM4_EMB3_CTL_PWMSEN2                      (*((volatile unsigned int*)(0x422F8820UL)))
#define bM4_EMB3_CTL_NFSEL0                       (*((volatile unsigned int*)(0x422F8870UL)))
#define bM4_EMB3_CTL_NFSEL1                       (*((volatile unsigned int*)(0x422F8874UL)))
#define bM4_EMB3_CTL_NFEN                         (*((volatile unsigned int*)(0x422F8878UL)))
#define bM4_EMB3_CTL_INVSEL                       (*((volatile unsigned int*)(0x422F887CUL)))
#define bM4_EMB3_PWMLV_PWMLV0                     (*((volatile unsigned int*)(0x422F8880UL)))
#define bM4_EMB3_PWMLV_PWMLV1                     (*((volatile unsigned int*)(0x422F8884UL)))
#define bM4_EMB3_PWMLV_PWMLV2                     (*((volatile unsigned int*)(0x422F8888UL)))
#define bM4_EMB3_SOE_SOE                          (*((volatile unsigned int*)(0x422F8900UL)))
#define bM4_EMB3_STAT_PORTINF                     (*((volatile unsigned int*)(0x422F8980UL)))
#define bM4_EMB3_STAT_PWMSF                       (*((volatile unsigned int*)(0x422F8984UL)))
#define bM4_EMB3_STAT_CMPF                        (*((volatile unsigned int*)(0x422F8988UL)))
#define bM4_EMB3_STAT_OSF                         (*((volatile unsigned int*)(0x422F898CUL)))
#define bM4_EMB3_STAT_PORTINST                    (*((volatile unsigned int*)(0x422F8990UL)))
#define bM4_EMB3_STAT_PWMST                       (*((volatile unsigned int*)(0x422F8994UL)))
#define bM4_EMB3_STATCLR_PORTINFCLR               (*((volatile unsigned int*)(0x422F8A00UL)))
#define bM4_EMB3_STATCLR_PWMSFCLR                 (*((volatile unsigned int*)(0x422F8A04UL)))
#define bM4_EMB3_STATCLR_CMPFCLR                  (*((volatile unsigned int*)(0x422F8A08UL)))
#define bM4_EMB3_STATCLR_OSFCLR                   (*((volatile unsigned int*)(0x422F8A0CUL)))
#define bM4_EMB3_INTEN_PORTINTEN                  (*((volatile unsigned int*)(0x422F8A80UL)))
#define bM4_EMB3_INTEN_PWMINTEN                   (*((volatile unsigned int*)(0x422F8A84UL)))
#define bM4_EMB3_INTEN_CMPINTEN                   (*((volatile unsigned int*)(0x422F8A88UL)))
#define bM4_EMB3_INTEN_OSINTEN                    (*((volatile unsigned int*)(0x422F8A8CUL)))
#define bM4_EMB4_CTL_PORTINEN                     (*((volatile unsigned int*)(0x422F8C00UL)))
#define bM4_EMB4_CTL_CMPEN0                       (*((volatile unsigned int*)(0x422F8C04UL)))
#define bM4_EMB4_CTL_CMPEN1                       (*((volatile unsigned int*)(0x422F8C08UL)))
#define bM4_EMB4_CTL_CMPEN2                       (*((volatile unsigned int*)(0x422F8C0CUL)))
#define bM4_EMB4_CTL_OSCSTPEN                     (*((volatile unsigned int*)(0x422F8C14UL)))
#define bM4_EMB4_CTL_PWMSEN0                      (*((volatile unsigned int*)(0x422F8C18UL)))
#define bM4_EMB4_CTL_PWMSEN1                      (*((volatile unsigned int*)(0x422F8C1CUL)))
#define bM4_EMB4_CTL_PWMSEN2                      (*((volatile unsigned int*)(0x422F8C20UL)))
#define bM4_EMB4_CTL_NFSEL0                       (*((volatile unsigned int*)(0x422F8C70UL)))
#define bM4_EMB4_CTL_NFSEL1                       (*((volatile unsigned int*)(0x422F8C74UL)))
#define bM4_EMB4_CTL_NFEN                         (*((volatile unsigned int*)(0x422F8C78UL)))
#define bM4_EMB4_CTL_INVSEL                       (*((volatile unsigned int*)(0x422F8C7CUL)))
#define bM4_EMB4_PWMLV_PWMLV0                     (*((volatile unsigned int*)(0x422F8C80UL)))
#define bM4_EMB4_PWMLV_PWMLV1                     (*((volatile unsigned int*)(0x422F8C84UL)))
#define bM4_EMB4_PWMLV_PWMLV2                     (*((volatile unsigned int*)(0x422F8C88UL)))
#define bM4_EMB4_SOE_SOE                          (*((volatile unsigned int*)(0x422F8D00UL)))
#define bM4_EMB4_STAT_PORTINF                     (*((volatile unsigned int*)(0x422F8D80UL)))
#define bM4_EMB4_STAT_PWMSF                       (*((volatile unsigned int*)(0x422F8D84UL)))
#define bM4_EMB4_STAT_CMPF                        (*((volatile unsigned int*)(0x422F8D88UL)))
#define bM4_EMB4_STAT_OSF                         (*((volatile unsigned int*)(0x422F8D8CUL)))
#define bM4_EMB4_STAT_PORTINST                    (*((volatile unsigned int*)(0x422F8D90UL)))
#define bM4_EMB4_STAT_PWMST                       (*((volatile unsigned int*)(0x422F8D94UL)))
#define bM4_EMB4_STATCLR_PORTINFCLR               (*((volatile unsigned int*)(0x422F8E00UL)))
#define bM4_EMB4_STATCLR_PWMSFCLR                 (*((volatile unsigned int*)(0x422F8E04UL)))
#define bM4_EMB4_STATCLR_CMPFCLR                  (*((volatile unsigned int*)(0x422F8E08UL)))
#define bM4_EMB4_STATCLR_OSFCLR                   (*((volatile unsigned int*)(0x422F8E0CUL)))
#define bM4_EMB4_INTEN_PORTINTEN                  (*((volatile unsigned int*)(0x422F8E80UL)))
#define bM4_EMB4_INTEN_PWMINTEN                   (*((volatile unsigned int*)(0x422F8E84UL)))
#define bM4_EMB4_INTEN_CMPINTEN                   (*((volatile unsigned int*)(0x422F8E88UL)))
#define bM4_EMB4_INTEN_OSINTEN                    (*((volatile unsigned int*)(0x422F8E8CUL)))
#define bM4_FCM_LVR_LVR0                          (*((volatile unsigned int*)(0x42908000UL)))
#define bM4_FCM_LVR_LVR1                          (*((volatile unsigned int*)(0x42908004UL)))
#define bM4_FCM_LVR_LVR2                          (*((volatile unsigned int*)(0x42908008UL)))
#define bM4_FCM_LVR_LVR3                          (*((volatile unsigned int*)(0x4290800CUL)))
#define bM4_FCM_LVR_LVR4                          (*((volatile unsigned int*)(0x42908010UL)))
#define bM4_FCM_LVR_LVR5                          (*((volatile unsigned int*)(0x42908014UL)))
#define bM4_FCM_LVR_LVR6                          (*((volatile unsigned int*)(0x42908018UL)))
#define bM4_FCM_LVR_LVR7                          (*((volatile unsigned int*)(0x4290801CUL)))
#define bM4_FCM_LVR_LVR8                          (*((volatile unsigned int*)(0x42908020UL)))
#define bM4_FCM_LVR_LVR9                          (*((volatile unsigned int*)(0x42908024UL)))
#define bM4_FCM_LVR_LVR10                         (*((volatile unsigned int*)(0x42908028UL)))
#define bM4_FCM_LVR_LVR11                         (*((volatile unsigned int*)(0x4290802CUL)))
#define bM4_FCM_LVR_LVR12                         (*((volatile unsigned int*)(0x42908030UL)))
#define bM4_FCM_LVR_LVR13                         (*((volatile unsigned int*)(0x42908034UL)))
#define bM4_FCM_LVR_LVR14                         (*((volatile unsigned int*)(0x42908038UL)))
#define bM4_FCM_LVR_LVR15                         (*((volatile unsigned int*)(0x4290803CUL)))
#define bM4_FCM_UVR_UVR0                          (*((volatile unsigned int*)(0x42908080UL)))
#define bM4_FCM_UVR_UVR1                          (*((volatile unsigned int*)(0x42908084UL)))
#define bM4_FCM_UVR_UVR2                          (*((volatile unsigned int*)(0x42908088UL)))
#define bM4_FCM_UVR_UVR3                          (*((volatile unsigned int*)(0x4290808CUL)))
#define bM4_FCM_UVR_UVR4                          (*((volatile unsigned int*)(0x42908090UL)))
#define bM4_FCM_UVR_UVR5                          (*((volatile unsigned int*)(0x42908094UL)))
#define bM4_FCM_UVR_UVR6                          (*((volatile unsigned int*)(0x42908098UL)))
#define bM4_FCM_UVR_UVR7                          (*((volatile unsigned int*)(0x4290809CUL)))
#define bM4_FCM_UVR_UVR8                          (*((volatile unsigned int*)(0x429080A0UL)))
#define bM4_FCM_UVR_UVR9                          (*((volatile unsigned int*)(0x429080A4UL)))
#define bM4_FCM_UVR_UVR10                         (*((volatile unsigned int*)(0x429080A8UL)))
#define bM4_FCM_UVR_UVR11                         (*((volatile unsigned int*)(0x429080ACUL)))
#define bM4_FCM_UVR_UVR12                         (*((volatile unsigned int*)(0x429080B0UL)))
#define bM4_FCM_UVR_UVR13                         (*((volatile unsigned int*)(0x429080B4UL)))
#define bM4_FCM_UVR_UVR14                         (*((volatile unsigned int*)(0x429080B8UL)))
#define bM4_FCM_UVR_UVR15                         (*((volatile unsigned int*)(0x429080BCUL)))
#define bM4_FCM_CNTR_CNTR0                        (*((volatile unsigned int*)(0x42908100UL)))
#define bM4_FCM_CNTR_CNTR1                        (*((volatile unsigned int*)(0x42908104UL)))
#define bM4_FCM_CNTR_CNTR2                        (*((volatile unsigned int*)(0x42908108UL)))
#define bM4_FCM_CNTR_CNTR3                        (*((volatile unsigned int*)(0x4290810CUL)))
#define bM4_FCM_CNTR_CNTR4                        (*((volatile unsigned int*)(0x42908110UL)))
#define bM4_FCM_CNTR_CNTR5                        (*((volatile unsigned int*)(0x42908114UL)))
#define bM4_FCM_CNTR_CNTR6                        (*((volatile unsigned int*)(0x42908118UL)))
#define bM4_FCM_CNTR_CNTR7                        (*((volatile unsigned int*)(0x4290811CUL)))
#define bM4_FCM_CNTR_CNTR8                        (*((volatile unsigned int*)(0x42908120UL)))
#define bM4_FCM_CNTR_CNTR9                        (*((volatile unsigned int*)(0x42908124UL)))
#define bM4_FCM_CNTR_CNTR10                       (*((volatile unsigned int*)(0x42908128UL)))
#define bM4_FCM_CNTR_CNTR11                       (*((volatile unsigned int*)(0x4290812CUL)))
#define bM4_FCM_CNTR_CNTR12                       (*((volatile unsigned int*)(0x42908130UL)))
#define bM4_FCM_CNTR_CNTR13                       (*((volatile unsigned int*)(0x42908134UL)))
#define bM4_FCM_CNTR_CNTR14                       (*((volatile unsigned int*)(0x42908138UL)))
#define bM4_FCM_CNTR_CNTR15                       (*((volatile unsigned int*)(0x4290813CUL)))
#define bM4_FCM_STR_START                         (*((volatile unsigned int*)(0x42908180UL)))
#define bM4_FCM_MCCR_MDIVS0                       (*((volatile unsigned int*)(0x42908200UL)))
#define bM4_FCM_MCCR_MDIVS1                       (*((volatile unsigned int*)(0x42908204UL)))
#define bM4_FCM_MCCR_MCKS0                        (*((volatile unsigned int*)(0x42908210UL)))
#define bM4_FCM_MCCR_MCKS1                        (*((volatile unsigned int*)(0x42908214UL)))
#define bM4_FCM_MCCR_MCKS2                        (*((volatile unsigned int*)(0x42908218UL)))
#define bM4_FCM_MCCR_MCKS3                        (*((volatile unsigned int*)(0x4290821CUL)))
#define bM4_FCM_RCCR_RDIVS0                       (*((volatile unsigned int*)(0x42908280UL)))
#define bM4_FCM_RCCR_RDIVS1                       (*((volatile unsigned int*)(0x42908284UL)))
#define bM4_FCM_RCCR_RCKS0                        (*((volatile unsigned int*)(0x4290828CUL)))
#define bM4_FCM_RCCR_RCKS1                        (*((volatile unsigned int*)(0x42908290UL)))
#define bM4_FCM_RCCR_RCKS2                        (*((volatile unsigned int*)(0x42908294UL)))
#define bM4_FCM_RCCR_RCKS3                        (*((volatile unsigned int*)(0x42908298UL)))
#define bM4_FCM_RCCR_INEXS                        (*((volatile unsigned int*)(0x4290829CUL)))
#define bM4_FCM_RCCR_DNFS0                        (*((volatile unsigned int*)(0x429082A0UL)))
#define bM4_FCM_RCCR_DNFS1                        (*((volatile unsigned int*)(0x429082A4UL)))
#define bM4_FCM_RCCR_EDGES0                       (*((volatile unsigned int*)(0x429082B0UL)))
#define bM4_FCM_RCCR_EDGES1                       (*((volatile unsigned int*)(0x429082B4UL)))
#define bM4_FCM_RCCR_EXREFE                       (*((volatile unsigned int*)(0x429082BCUL)))
#define bM4_FCM_RIER_ERRIE                        (*((volatile unsigned int*)(0x42908300UL)))
#define bM4_FCM_RIER_MENDIE                       (*((volatile unsigned int*)(0x42908304UL)))
#define bM4_FCM_RIER_OVFIE                        (*((volatile unsigned int*)(0x42908308UL)))
#define bM4_FCM_RIER_ERRINTRS                     (*((volatile unsigned int*)(0x42908310UL)))
#define bM4_FCM_RIER_ERRE                         (*((volatile unsigned int*)(0x4290831CUL)))
#define bM4_FCM_SR_ERRF                           (*((volatile unsigned int*)(0x42908380UL)))
#define bM4_FCM_SR_MENDF                          (*((volatile unsigned int*)(0x42908384UL)))
#define bM4_FCM_SR_OVF                            (*((volatile unsigned int*)(0x42908388UL)))
#define bM4_FCM_CLR_ERRFCLR                       (*((volatile unsigned int*)(0x42908400UL)))
#define bM4_FCM_CLR_MENDFCLR                      (*((volatile unsigned int*)(0x42908404UL)))
#define bM4_FCM_CLR_OVFCLR                        (*((volatile unsigned int*)(0x42908408UL)))
#define bM4_HASH_CR_START                         (*((volatile unsigned int*)(0x42108000UL)))
#define bM4_HASH_CR_FST_GRP                       (*((volatile unsigned int*)(0x42108004UL)))
#define bM4_I2C1_CR1_PE                           (*((volatile unsigned int*)(0x429C0000UL)))
#define bM4_I2C1_CR1_SMBUS                        (*((volatile unsigned int*)(0x429C0004UL)))
#define bM4_I2C1_CR1_SMBALRTEN                    (*((volatile unsigned int*)(0x429C0008UL)))
#define bM4_I2C1_CR1_SMBDEFAULTEN                 (*((volatile unsigned int*)(0x429C000CUL)))
#define bM4_I2C1_CR1_SMBHOSTEN                    (*((volatile unsigned int*)(0x429C0010UL)))
#define bM4_I2C1_CR1_ENGC                         (*((volatile unsigned int*)(0x429C0018UL)))
#define bM4_I2C1_CR1_RESTART                      (*((volatile unsigned int*)(0x429C001CUL)))
#define bM4_I2C1_CR1_START                        (*((volatile unsigned int*)(0x429C0020UL)))
#define bM4_I2C1_CR1_STOP                         (*((volatile unsigned int*)(0x429C0024UL)))
#define bM4_I2C1_CR1_ACK                          (*((volatile unsigned int*)(0x429C0028UL)))
#define bM4_I2C1_CR1_SWRST                        (*((volatile unsigned int*)(0x429C003CUL)))
#define bM4_I2C1_CR2_STARTIE                      (*((volatile unsigned int*)(0x429C0080UL)))
#define bM4_I2C1_CR2_SLADDR0IE                    (*((volatile unsigned int*)(0x429C0084UL)))
#define bM4_I2C1_CR2_SLADDR1IE                    (*((volatile unsigned int*)(0x429C0088UL)))
#define bM4_I2C1_CR2_TENDIE                       (*((volatile unsigned int*)(0x429C008CUL)))
#define bM4_I2C1_CR2_STOPIE                       (*((volatile unsigned int*)(0x429C0090UL)))
#define bM4_I2C1_CR2_RFULLIE                      (*((volatile unsigned int*)(0x429C0098UL)))
#define bM4_I2C1_CR2_TEMPTYIE                     (*((volatile unsigned int*)(0x429C009CUL)))
#define bM4_I2C1_CR2_ARLOIE                       (*((volatile unsigned int*)(0x429C00A4UL)))
#define bM4_I2C1_CR2_NACKIE                       (*((volatile unsigned int*)(0x429C00B0UL)))
#define bM4_I2C1_CR2_TMOUTIE                      (*((volatile unsigned int*)(0x429C00B8UL)))
#define bM4_I2C1_CR2_GENCALLIE                    (*((volatile unsigned int*)(0x429C00D0UL)))
#define bM4_I2C1_CR2_SMBDEFAULTIE                 (*((volatile unsigned int*)(0x429C00D4UL)))
#define bM4_I2C1_CR2_SMBHOSTIE                    (*((volatile unsigned int*)(0x429C00D8UL)))
#define bM4_I2C1_CR2_SMBALRTIE                    (*((volatile unsigned int*)(0x429C00DCUL)))
#define bM4_I2C1_CR3_TMOUTEN                      (*((volatile unsigned int*)(0x429C0100UL)))
#define bM4_I2C1_CR3_LTMOUT                       (*((volatile unsigned int*)(0x429C0104UL)))
#define bM4_I2C1_CR3_HTMOUT                       (*((volatile unsigned int*)(0x429C0108UL)))
#define bM4_I2C1_CR3_FACKEN                       (*((volatile unsigned int*)(0x429C011CUL)))
#define bM4_I2C1_SLR0_SLADDR00                    (*((volatile unsigned int*)(0x429C0200UL)))
#define bM4_I2C1_SLR0_SLADDR01                    (*((volatile unsigned int*)(0x429C0204UL)))
#define bM4_I2C1_SLR0_SLADDR02                    (*((volatile unsigned int*)(0x429C0208UL)))
#define bM4_I2C1_SLR0_SLADDR03                    (*((volatile unsigned int*)(0x429C020CUL)))
#define bM4_I2C1_SLR0_SLADDR04                    (*((volatile unsigned int*)(0x429C0210UL)))
#define bM4_I2C1_SLR0_SLADDR05                    (*((volatile unsigned int*)(0x429C0214UL)))
#define bM4_I2C1_SLR0_SLADDR06                    (*((volatile unsigned int*)(0x429C0218UL)))
#define bM4_I2C1_SLR0_SLADDR07                    (*((volatile unsigned int*)(0x429C021CUL)))
#define bM4_I2C1_SLR0_SLADDR08                    (*((volatile unsigned int*)(0x429C0220UL)))
#define bM4_I2C1_SLR0_SLADDR09                    (*((volatile unsigned int*)(0x429C0224UL)))
#define bM4_I2C1_SLR0_SLADDR0EN                   (*((volatile unsigned int*)(0x429C0230UL)))
#define bM4_I2C1_SLR0_ADDRMOD0                    (*((volatile unsigned int*)(0x429C023CUL)))
#define bM4_I2C1_SLR1_SLADDR10                    (*((volatile unsigned int*)(0x429C0280UL)))
#define bM4_I2C1_SLR1_SLADDR11                    (*((volatile unsigned int*)(0x429C0284UL)))
#define bM4_I2C1_SLR1_SLADDR12                    (*((volatile unsigned int*)(0x429C0288UL)))
#define bM4_I2C1_SLR1_SLADDR13                    (*((volatile unsigned int*)(0x429C028CUL)))
#define bM4_I2C1_SLR1_SLADDR14                    (*((volatile unsigned int*)(0x429C0290UL)))
#define bM4_I2C1_SLR1_SLADDR15                    (*((volatile unsigned int*)(0x429C0294UL)))
#define bM4_I2C1_SLR1_SLADDR16                    (*((volatile unsigned int*)(0x429C0298UL)))
#define bM4_I2C1_SLR1_SLADDR17                    (*((volatile unsigned int*)(0x429C029CUL)))
#define bM4_I2C1_SLR1_SLADDR18                    (*((volatile unsigned int*)(0x429C02A0UL)))
#define bM4_I2C1_SLR1_SLADDR19                    (*((volatile unsigned int*)(0x429C02A4UL)))
#define bM4_I2C1_SLR1_SLADDR1EN                   (*((volatile unsigned int*)(0x429C02B0UL)))
#define bM4_I2C1_SLR1_ADDRMOD1                    (*((volatile unsigned int*)(0x429C02BCUL)))
#define bM4_I2C1_SLTR_TOUTLOW0                    (*((volatile unsigned int*)(0x429C0300UL)))
#define bM4_I2C1_SLTR_TOUTLOW1                    (*((volatile unsigned int*)(0x429C0304UL)))
#define bM4_I2C1_SLTR_TOUTLOW2                    (*((volatile unsigned int*)(0x429C0308UL)))
#define bM4_I2C1_SLTR_TOUTLOW3                    (*((volatile unsigned int*)(0x429C030CUL)))
#define bM4_I2C1_SLTR_TOUTLOW4                    (*((volatile unsigned int*)(0x429C0310UL)))
#define bM4_I2C1_SLTR_TOUTLOW5                    (*((volatile unsigned int*)(0x429C0314UL)))
#define bM4_I2C1_SLTR_TOUTLOW6                    (*((volatile unsigned int*)(0x429C0318UL)))
#define bM4_I2C1_SLTR_TOUTLOW7                    (*((volatile unsigned int*)(0x429C031CUL)))
#define bM4_I2C1_SLTR_TOUTLOW8                    (*((volatile unsigned int*)(0x429C0320UL)))
#define bM4_I2C1_SLTR_TOUTLOW9                    (*((volatile unsigned int*)(0x429C0324UL)))
#define bM4_I2C1_SLTR_TOUTLOW10                   (*((volatile unsigned int*)(0x429C0328UL)))
#define bM4_I2C1_SLTR_TOUTLOW11                   (*((volatile unsigned int*)(0x429C032CUL)))
#define bM4_I2C1_SLTR_TOUTLOW12                   (*((volatile unsigned int*)(0x429C0330UL)))
#define bM4_I2C1_SLTR_TOUTLOW13                   (*((volatile unsigned int*)(0x429C0334UL)))
#define bM4_I2C1_SLTR_TOUTLOW14                   (*((volatile unsigned int*)(0x429C0338UL)))
#define bM4_I2C1_SLTR_TOUTLOW15                   (*((volatile unsigned int*)(0x429C033CUL)))
#define bM4_I2C1_SLTR_TOUTHIGH0                   (*((volatile unsigned int*)(0x429C0340UL)))
#define bM4_I2C1_SLTR_TOUTHIGH1                   (*((volatile unsigned int*)(0x429C0344UL)))
#define bM4_I2C1_SLTR_TOUTHIGH2                   (*((volatile unsigned int*)(0x429C0348UL)))
#define bM4_I2C1_SLTR_TOUTHIGH3                   (*((volatile unsigned int*)(0x429C034CUL)))
#define bM4_I2C1_SLTR_TOUTHIGH4                   (*((volatile unsigned int*)(0x429C0350UL)))
#define bM4_I2C1_SLTR_TOUTHIGH5                   (*((volatile unsigned int*)(0x429C0354UL)))
#define bM4_I2C1_SLTR_TOUTHIGH6                   (*((volatile unsigned int*)(0x429C0358UL)))
#define bM4_I2C1_SLTR_TOUTHIGH7                   (*((volatile unsigned int*)(0x429C035CUL)))
#define bM4_I2C1_SLTR_TOUTHIGH8                   (*((volatile unsigned int*)(0x429C0360UL)))
#define bM4_I2C1_SLTR_TOUTHIGH9                   (*((volatile unsigned int*)(0x429C0364UL)))
#define bM4_I2C1_SLTR_TOUTHIGH10                  (*((volatile unsigned int*)(0x429C0368UL)))
#define bM4_I2C1_SLTR_TOUTHIGH11                  (*((volatile unsigned int*)(0x429C036CUL)))
#define bM4_I2C1_SLTR_TOUTHIGH12                  (*((volatile unsigned int*)(0x429C0370UL)))
#define bM4_I2C1_SLTR_TOUTHIGH13                  (*((volatile unsigned int*)(0x429C0374UL)))
