SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460keua_template/common/hc32f460keua.h
#define bM4_PORT_PIDRE_PIN06                      (*((volatile unsigned int*)(0x42A70818UL)))
#define bM4_PORT_PIDRE_PIN07                      (*((volatile unsigned int*)(0x42A7081CUL)))
#define bM4_PORT_PIDRE_PIN08                      (*((volatile unsigned int*)(0x42A70820UL)))
#define bM4_PORT_PIDRE_PIN09                      (*((volatile unsigned int*)(0x42A70824UL)))
#define bM4_PORT_PIDRE_PIN10                      (*((volatile unsigned int*)(0x42A70828UL)))
#define bM4_PORT_PIDRE_PIN11                      (*((volatile unsigned int*)(0x42A7082CUL)))
#define bM4_PORT_PIDRE_PIN12                      (*((volatile unsigned int*)(0x42A70830UL)))
#define bM4_PORT_PIDRE_PIN13                      (*((volatile unsigned int*)(0x42A70834UL)))
#define bM4_PORT_PIDRE_PIN14                      (*((volatile unsigned int*)(0x42A70838UL)))
#define bM4_PORT_PIDRE_PIN15                      (*((volatile unsigned int*)(0x42A7083CUL)))
#define bM4_PORT_PODRE_POUT15                     (*((volatile unsigned int*)(0x42A708BCUL)))
#define bM4_PORT_POERE_POUTE15                    (*((volatile unsigned int*)(0x42A708FCUL)))
#define bM4_PORT_POSRE_POS15                      (*((volatile unsigned int*)(0x42A7093CUL)))
#define bM4_PORT_PORRE_POR15                      (*((volatile unsigned int*)(0x42A7097CUL)))
#define bM4_PORT_POTRE_POT15                      (*((volatile unsigned int*)(0x42A709BCUL)))
#define bM4_PORT_PIDRH_PIN00                      (*((volatile unsigned int*)(0x42A70A00UL)))
#define bM4_PORT_PIDRH_PIN01                      (*((volatile unsigned int*)(0x42A70A04UL)))
#define bM4_PORT_PIDRH_PIN02                      (*((volatile unsigned int*)(0x42A70A08UL)))
#define bM4_PORT_PODRH_POUT00                     (*((volatile unsigned int*)(0x42A70A80UL)))
#define bM4_PORT_PODRH_POUT01                     (*((volatile unsigned int*)(0x42A70A84UL)))
#define bM4_PORT_PODRH_POUT02                     (*((volatile unsigned int*)(0x42A70A88UL)))
#define bM4_PORT_POERH_POUTE00                    (*((volatile unsigned int*)(0x42A70AC0UL)))
#define bM4_PORT_POERH_POUTE01                    (*((volatile unsigned int*)(0x42A70AC4UL)))
#define bM4_PORT_POERH_POUTE02                    (*((volatile unsigned int*)(0x42A70AC8UL)))
#define bM4_PORT_POSRH_POS00                      (*((volatile unsigned int*)(0x42A70B00UL)))
#define bM4_PORT_POSRH_POS01                      (*((volatile unsigned int*)(0x42A70B04UL)))
#define bM4_PORT_POSRH_POS02                      (*((volatile unsigned int*)(0x42A70B08UL)))
#define bM4_PORT_PORRH_POR00                      (*((volatile unsigned int*)(0x42A70B40UL)))
#define bM4_PORT_PORRH_POR01                      (*((volatile unsigned int*)(0x42A70B44UL)))
#define bM4_PORT_PORRH_POR02                      (*((volatile unsigned int*)(0x42A70B48UL)))
#define bM4_PORT_POTRH_POT00                      (*((volatile unsigned int*)(0x42A70B80UL)))
#define bM4_PORT_POTRH_POT01                      (*((volatile unsigned int*)(0x42A70B84UL)))
#define bM4_PORT_POTRH_POT02                      (*((volatile unsigned int*)(0x42A70B88UL)))
#define bM4_PORT_PSPCR_SPFE0                      (*((volatile unsigned int*)(0x42A77E80UL)))
#define bM4_PORT_PSPCR_SPFE1                      (*((volatile unsigned int*)(0x42A77E84UL)))
#define bM4_PORT_PSPCR_SPFE2                      (*((volatile unsigned int*)(0x42A77E88UL)))
#define bM4_PORT_PSPCR_SPFE3                      (*((volatile unsigned int*)(0x42A77E8CUL)))
#define bM4_PORT_PSPCR_SPFE4                      (*((volatile unsigned int*)(0x42A77E90UL)))
#define bM4_PORT_PCCR_BFSEL0                      (*((volatile unsigned int*)(0x42A77F00UL)))
#define bM4_PORT_PCCR_BFSEL1                      (*((volatile unsigned int*)(0x42A77F04UL)))
#define bM4_PORT_PCCR_BFSEL2                      (*((volatile unsigned int*)(0x42A77F08UL)))
#define bM4_PORT_PCCR_BFSEL3                      (*((volatile unsigned int*)(0x42A77F0CUL)))
#define bM4_PORT_PCCR_RDWT0                       (*((volatile unsigned int*)(0x42A77F38UL)))
#define bM4_PORT_PCCR_RDWT1                       (*((volatile unsigned int*)(0x42A77F3CUL)))
#define bM4_PORT_PINAER_PINAE0                    (*((volatile unsigned int*)(0x42A77F40UL)))
#define bM4_PORT_PINAER_PINAE1                    (*((volatile unsigned int*)(0x42A77F44UL)))
#define bM4_PORT_PINAER_PINAE2                    (*((volatile unsigned int*)(0x42A77F48UL)))
#define bM4_PORT_PINAER_PINAE3                    (*((volatile unsigned int*)(0x42A77F4CUL)))
#define bM4_PORT_PINAER_PINAE4                    (*((volatile unsigned int*)(0x42A77F50UL)))
#define bM4_PORT_PINAER_PINAE5                    (*((volatile unsigned int*)(0x42A77F54UL)))
#define bM4_PORT_PWPR_WE                          (*((volatile unsigned int*)(0x42A77F80UL)))
#define bM4_PORT_PWPR_WP0                         (*((volatile unsigned int*)(0x42A77FA0UL)))
#define bM4_PORT_PWPR_WP1                         (*((volatile unsigned int*)(0x42A77FA4UL)))
#define bM4_PORT_PWPR_WP2                         (*((volatile unsigned int*)(0x42A77FA8UL)))
#define bM4_PORT_PWPR_WP3                         (*((volatile unsigned int*)(0x42A77FACUL)))
#define bM4_PORT_PWPR_WP4                         (*((volatile unsigned int*)(0x42A77FB0UL)))
#define bM4_PORT_PWPR_WP5                         (*((volatile unsigned int*)(0x42A77FB4UL)))
#define bM4_PORT_PWPR_WP6                         (*((volatile unsigned int*)(0x42A77FB8UL)))
#define bM4_PORT_PWPR_WP7                         (*((volatile unsigned int*)(0x42A77FBCUL)))
#define bM4_PORT_PCRA0_POUT                       (*((volatile unsigned int*)(0x42A78000UL)))
#define bM4_PORT_PCRA0_POUTE                      (*((volatile unsigned int*)(0x42A78004UL)))
#define bM4_PORT_PCRA0_NOD                        (*((volatile unsigned int*)(0x42A78008UL)))
#define bM4_PORT_PCRA0_DRV0                       (*((volatile unsigned int*)(0x42A78010UL)))
#define bM4_PORT_PCRA0_DRV1                       (*((volatile unsigned int*)(0x42A78014UL)))
#define bM4_PORT_PCRA0_PUU                        (*((volatile unsigned int*)(0x42A78018UL)))
#define bM4_PORT_PCRA0_PIN                        (*((volatile unsigned int*)(0x42A78020UL)))
#define bM4_PORT_PCRA0_INVE                       (*((volatile unsigned int*)(0x42A78024UL)))
#define bM4_PORT_PCRA0_INTE                       (*((volatile unsigned int*)(0x42A78030UL)))
#define bM4_PORT_PCRA0_LTE                        (*((volatile unsigned int*)(0x42A78038UL)))
#define bM4_PORT_PCRA0_DDIS                       (*((volatile unsigned int*)(0x42A7803CUL)))
#define bM4_PORT_PFSRA0_FSEL0                     (*((volatile unsigned int*)(0x42A78040UL)))
#define bM4_PORT_PFSRA0_FSEL1                     (*((volatile unsigned int*)(0x42A78044UL)))
#define bM4_PORT_PFSRA0_FSEL2                     (*((volatile unsigned int*)(0x42A78048UL)))
#define bM4_PORT_PFSRA0_FSEL3                     (*((volatile unsigned int*)(0x42A7804CUL)))
#define bM4_PORT_PFSRA0_FSEL4                     (*((volatile unsigned int*)(0x42A78050UL)))
#define bM4_PORT_PFSRA0_FSEL5                     (*((volatile unsigned int*)(0x42A78054UL)))
#define bM4_PORT_PFSRA0_BFE                       (*((volatile unsigned int*)(0x42A78060UL)))
#define bM4_PORT_PCRA1_POUT                       (*((volatile unsigned int*)(0x42A78080UL)))
#define bM4_PORT_PCRA1_POUTE                      (*((volatile unsigned int*)(0x42A78084UL)))
#define bM4_PORT_PCRA1_NOD                        (*((volatile unsigned int*)(0x42A78088UL)))
#define bM4_PORT_PCRA1_DRV0                       (*((volatile unsigned int*)(0x42A78090UL)))
#define bM4_PORT_PCRA1_DRV1                       (*((volatile unsigned int*)(0x42A78094UL)))
#define bM4_PORT_PCRA1_PUU                        (*((volatile unsigned int*)(0x42A78098UL)))
#define bM4_PORT_PCRA1_PIN                        (*((volatile unsigned int*)(0x42A780A0UL)))
#define bM4_PORT_PCRA1_INVE                       (*((volatile unsigned int*)(0x42A780A4UL)))
#define bM4_PORT_PCRA1_INTE                       (*((volatile unsigned int*)(0x42A780B0UL)))
#define bM4_PORT_PCRA1_LTE                        (*((volatile unsigned int*)(0x42A780B8UL)))
#define bM4_PORT_PCRA1_DDIS                       (*((volatile unsigned int*)(0x42A780BCUL)))
#define bM4_PORT_PFSRA1_FSEL0                     (*((volatile unsigned int*)(0x42A780C0UL)))
#define bM4_PORT_PFSRA1_FSEL1                     (*((volatile unsigned int*)(0x42A780C4UL)))
#define bM4_PORT_PFSRA1_FSEL2                     (*((volatile unsigned int*)(0x42A780C8UL)))
#define bM4_PORT_PFSRA1_FSEL3                     (*((volatile unsigned int*)(0x42A780CCUL)))
#define bM4_PORT_PFSRA1_FSEL4                     (*((volatile unsigned int*)(0x42A780D0UL)))
#define bM4_PORT_PFSRA1_FSEL5                     (*((volatile unsigned int*)(0x42A780D4UL)))
#define bM4_PORT_PFSRA1_BFE                       (*((volatile unsigned int*)(0x42A780E0UL)))
#define bM4_PORT_PCRA2_POUT                       (*((volatile unsigned int*)(0x42A78100UL)))
#define bM4_PORT_PCRA2_POUTE                      (*((volatile unsigned int*)(0x42A78104UL)))
#define bM4_PORT_PCRA2_NOD                        (*((volatile unsigned int*)(0x42A78108UL)))
#define bM4_PORT_PCRA2_DRV0                       (*((volatile unsigned int*)(0x42A78110UL)))
#define bM4_PORT_PCRA2_DRV1                       (*((volatile unsigned int*)(0x42A78114UL)))
#define bM4_PORT_PCRA2_PUU                        (*((volatile unsigned int*)(0x42A78118UL)))
#define bM4_PORT_PCRA2_PIN                        (*((volatile unsigned int*)(0x42A78120UL)))
#define bM4_PORT_PCRA2_INVE                       (*((volatile unsigned int*)(0x42A78124UL)))
#define bM4_PORT_PCRA2_INTE                       (*((volatile unsigned int*)(0x42A78130UL)))
#define bM4_PORT_PCRA2_LTE                        (*((volatile unsigned int*)(0x42A78138UL)))
#define bM4_PORT_PCRA2_DDIS                       (*((volatile unsigned int*)(0x42A7813CUL)))
#define bM4_PORT_PFSRA2_FSEL0                     (*((volatile unsigned int*)(0x42A78140UL)))
#define bM4_PORT_PFSRA2_FSEL1                     (*((volatile unsigned int*)(0x42A78144UL)))
#define bM4_PORT_PFSRA2_FSEL2                     (*((volatile unsigned int*)(0x42A78148UL)))
#define bM4_PORT_PFSRA2_FSEL3                     (*((volatile unsigned int*)(0x42A7814CUL)))
#define bM4_PORT_PFSRA2_FSEL4                     (*((volatile unsigned int*)(0x42A78150UL)))
#define bM4_PORT_PFSRA2_FSEL5                     (*((volatile unsigned int*)(0x42A78154UL)))
#define bM4_PORT_PFSRA2_BFE                       (*((volatile unsigned int*)(0x42A78160UL)))
#define bM4_PORT_PCRA3_POUT                       (*((volatile unsigned int*)(0x42A78180UL)))
#define bM4_PORT_PCRA3_POUTE                      (*((volatile unsigned int*)(0x42A78184UL)))
#define bM4_PORT_PCRA3_NOD                        (*((volatile unsigned int*)(0x42A78188UL)))
#define bM4_PORT_PCRA3_DRV0                       (*((volatile unsigned int*)(0x42A78190UL)))
#define bM4_PORT_PCRA3_DRV1                       (*((volatile unsigned int*)(0x42A78194UL)))
#define bM4_PORT_PCRA3_PUU                        (*((volatile unsigned int*)(0x42A78198UL)))
#define bM4_PORT_PCRA3_PIN                        (*((volatile unsigned int*)(0x42A781A0UL)))
#define bM4_PORT_PCRA3_INVE                       (*((volatile unsigned int*)(0x42A781A4UL)))
#define bM4_PORT_PCRA3_INTE                       (*((volatile unsigned int*)(0x42A781B0UL)))
#define bM4_PORT_PCRA3_LTE                        (*((volatile unsigned int*)(0x42A781B8UL)))
#define bM4_PORT_PCRA3_DDIS                       (*((volatile unsigned int*)(0x42A781BCUL)))
#define bM4_PORT_PFSRA3_FSEL0                     (*((volatile unsigned int*)(0x42A781C0UL)))
#define bM4_PORT_PFSRA3_FSEL1                     (*((volatile unsigned int*)(0x42A781C4UL)))
#define bM4_PORT_PFSRA3_FSEL2                     (*((volatile unsigned int*)(0x42A781C8UL)))
#define bM4_PORT_PFSRA3_FSEL3                     (*((volatile unsigned int*)(0x42A781CCUL)))
#define bM4_PORT_PFSRA3_FSEL4                     (*((volatile unsigned int*)(0x42A781D0UL)))
#define bM4_PORT_PFSRA3_FSEL5                     (*((volatile unsigned int*)(0x42A781D4UL)))
#define bM4_PORT_PFSRA3_BFE                       (*((volatile unsigned int*)(0x42A781E0UL)))
#define bM4_PORT_PCRA4_POUT                       (*((volatile unsigned int*)(0x42A78200UL)))
#define bM4_PORT_PCRA4_POUTE                      (*((volatile unsigned int*)(0x42A78204UL)))
#define bM4_PORT_PCRA4_NOD                        (*((volatile unsigned int*)(0x42A78208UL)))
#define bM4_PORT_PCRA4_DRV0                       (*((volatile unsigned int*)(0x42A78210UL)))
#define bM4_PORT_PCRA4_DRV1                       (*((volatile unsigned int*)(0x42A78214UL)))
#define bM4_PORT_PCRA4_PUU                        (*((volatile unsigned int*)(0x42A78218UL)))
#define bM4_PORT_PCRA4_PIN                        (*((volatile unsigned int*)(0x42A78220UL)))
#define bM4_PORT_PCRA4_INVE                       (*((volatile unsigned int*)(0x42A78224UL)))
#define bM4_PORT_PCRA4_INTE                       (*((volatile unsigned int*)(0x42A78230UL)))
#define bM4_PORT_PCRA4_LTE                        (*((volatile unsigned int*)(0x42A78238UL)))
#define bM4_PORT_PCRA4_DDIS                       (*((volatile unsigned int*)(0x42A7823CUL)))
#define bM4_PORT_PFSRA4_FSEL0                     (*((volatile unsigned int*)(0x42A78240UL)))
#define bM4_PORT_PFSRA4_FSEL1                     (*((volatile unsigned int*)(0x42A78244UL)))
#define bM4_PORT_PFSRA4_FSEL2                     (*((volatile unsigned int*)(0x42A78248UL)))
#define bM4_PORT_PFSRA4_FSEL3                     (*((volatile unsigned int*)(0x42A7824CUL)))
#define bM4_PORT_PFSRA4_FSEL4                     (*((volatile unsigned int*)(0x42A78250UL)))
#define bM4_PORT_PFSRA4_FSEL5                     (*((volatile unsigned int*)(0x42A78254UL)))
#define bM4_PORT_PFSRA4_BFE                       (*((volatile unsigned int*)(0x42A78260UL)))
#define bM4_PORT_PCRA5_POUT                       (*((volatile unsigned int*)(0x42A78280UL)))
#define bM4_PORT_PCRA5_POUTE                      (*((volatile unsigned int*)(0x42A78284UL)))
#define bM4_PORT_PCRA5_NOD                        (*((volatile unsigned int*)(0x42A78288UL)))
#define bM4_PORT_PCRA5_DRV0                       (*((volatile unsigned int*)(0x42A78290UL)))
#define bM4_PORT_PCRA5_DRV1                       (*((volatile unsigned int*)(0x42A78294UL)))
#define bM4_PORT_PCRA5_PUU                        (*((volatile unsigned int*)(0x42A78298UL)))
#define bM4_PORT_PCRA5_PIN                        (*((volatile unsigned int*)(0x42A782A0UL)))
#define bM4_PORT_PCRA5_INVE                       (*((volatile unsigned int*)(0x42A782A4UL)))
#define bM4_PORT_PCRA5_INTE                       (*((volatile unsigned int*)(0x42A782B0UL)))
#define bM4_PORT_PCRA5_LTE                        (*((volatile unsigned int*)(0x42A782B8UL)))
#define bM4_PORT_PCRA5_DDIS                       (*((volatile unsigned int*)(0x42A782BCUL)))
#define bM4_PORT_PFSRA5_FSEL0                     (*((volatile unsigned int*)(0x42A782C0UL)))
#define bM4_PORT_PFSRA5_FSEL1                     (*((volatile unsigned int*)(0x42A782C4UL)))
#define bM4_PORT_PFSRA5_FSEL2                     (*((volatile unsigned int*)(0x42A782C8UL)))
#define bM4_PORT_PFSRA5_FSEL3                     (*((volatile unsigned int*)(0x42A782CCUL)))
#define bM4_PORT_PFSRA5_FSEL4                     (*((volatile unsigned int*)(0x42A782D0UL)))
#define bM4_PORT_PFSRA5_FSEL5                     (*((volatile unsigned int*)(0x42A782D4UL)))
#define bM4_PORT_PFSRA5_BFE                       (*((volatile unsigned int*)(0x42A782E0UL)))
#define bM4_PORT_PCRA6_POUT                       (*((volatile unsigned int*)(0x42A78300UL)))
#define bM4_PORT_PCRA6_POUTE                      (*((volatile unsigned int*)(0x42A78304UL)))
#define bM4_PORT_PCRA6_NOD                        (*((volatile unsigned int*)(0x42A78308UL)))
#define bM4_PORT_PCRA6_DRV0                       (*((volatile unsigned int*)(0x42A78310UL)))
#define bM4_PORT_PCRA6_DRV1                       (*((volatile unsigned int*)(0x42A78314UL)))
#define bM4_PORT_PCRA6_PUU                        (*((volatile unsigned int*)(0x42A78318UL)))
#define bM4_PORT_PCRA6_PIN                        (*((volatile unsigned int*)(0x42A78320UL)))
#define bM4_PORT_PCRA6_INVE                       (*((volatile unsigned int*)(0x42A78324UL)))
#define bM4_PORT_PCRA6_INTE                       (*((volatile unsigned int*)(0x42A78330UL)))
#define bM4_PORT_PCRA6_LTE                        (*((volatile unsigned int*)(0x42A78338UL)))
#define bM4_PORT_PCRA6_DDIS                       (*((volatile unsigned int*)(0x42A7833CUL)))
#define bM4_PORT_PFSRA6_FSEL0                     (*((volatile unsigned int*)(0x42A78340UL)))
#define bM4_PORT_PFSRA6_FSEL1                     (*((volatile unsigned int*)(0x42A78344UL)))
#define bM4_PORT_PFSRA6_FSEL2                     (*((volatile unsigned int*)(0x42A78348UL)))
#define bM4_PORT_PFSRA6_FSEL3                     (*((volatile unsigned int*)(0x42A7834CUL)))
#define bM4_PORT_PFSRA6_FSEL4                     (*((volatile unsigned int*)(0x42A78350UL)))
#define bM4_PORT_PFSRA6_FSEL5                     (*((volatile unsigned int*)(0x42A78354UL)))
#define bM4_PORT_PFSRA6_BFE                       (*((volatile unsigned int*)(0x42A78360UL)))
#define bM4_PORT_PCRA7_POUT                       (*((volatile unsigned int*)(0x42A78380UL)))
#define bM4_PORT_PCRA7_POUTE                      (*((volatile unsigned int*)(0x42A78384UL)))
#define bM4_PORT_PCRA7_NOD                        (*((volatile unsigned int*)(0x42A78388UL)))
#define bM4_PORT_PCRA7_DRV0                       (*((volatile unsigned int*)(0x42A78390UL)))
#define bM4_PORT_PCRA7_DRV1                       (*((volatile unsigned int*)(0x42A78394UL)))
#define bM4_PORT_PCRA7_PUU                        (*((volatile unsigned int*)(0x42A78398UL)))
#define bM4_PORT_PCRA7_PIN                        (*((volatile unsigned int*)(0x42A783A0UL)))
#define bM4_PORT_PCRA7_INVE                       (*((volatile unsigned int*)(0x42A783A4UL)))
#define bM4_PORT_PCRA7_INTE                       (*((volatile unsigned int*)(0x42A783B0UL)))
#define bM4_PORT_PCRA7_LTE                        (*((volatile unsigned int*)(0x42A783B8UL)))
#define bM4_PORT_PCRA7_DDIS                       (*((volatile unsigned int*)(0x42A783BCUL)))
#define bM4_PORT_PFSRA7_FSEL0                     (*((volatile unsigned int*)(0x42A783C0UL)))
#define bM4_PORT_PFSRA7_FSEL1                     (*((volatile unsigned int*)(0x42A783C4UL)))
#define bM4_PORT_PFSRA7_FSEL2                     (*((volatile unsigned int*)(0x42A783C8UL)))
#define bM4_PORT_PFSRA7_FSEL3                     (*((volatile unsigned int*)(0x42A783CCUL)))
#define bM4_PORT_PFSRA7_FSEL4                     (*((volatile unsigned int*)(0x42A783D0UL)))
#define bM4_PORT_PFSRA7_FSEL5                     (*((volatile unsigned int*)(0x42A783D4UL)))
#define bM4_PORT_PFSRA7_BFE                       (*((volatile unsigned int*)(0x42A783E0UL)))
#define bM4_PORT_PCRA8_POUT                       (*((volatile unsigned int*)(0x42A78400UL)))
#define bM4_PORT_PCRA8_POUTE                      (*((volatile unsigned int*)(0x42A78404UL)))
#define bM4_PORT_PCRA8_NOD                        (*((volatile unsigned int*)(0x42A78408UL)))
#define bM4_PORT_PCRA8_DRV0                       (*((volatile unsigned int*)(0x42A78410UL)))
#define bM4_PORT_PCRA8_DRV1                       (*((volatile unsigned int*)(0x42A78414UL)))
#define bM4_PORT_PCRA8_PUU                        (*((volatile unsigned int*)(0x42A78418UL)))
#define bM4_PORT_PCRA8_PIN                        (*((volatile unsigned int*)(0x42A78420UL)))
#define bM4_PORT_PCRA8_INVE                       (*((volatile unsigned int*)(0x42A78424UL)))
#define bM4_PORT_PCRA8_INTE                       (*((volatile unsigned int*)(0x42A78430UL)))
#define bM4_PORT_PCRA8_LTE                        (*((volatile unsigned int*)(0x42A78438UL)))
#define bM4_PORT_PCRA8_DDIS                       (*((volatile unsigned int*)(0x42A7843CUL)))
#define bM4_PORT_PFSRA8_FSEL0                     (*((volatile unsigned int*)(0x42A78440UL)))
#define bM4_PORT_PFSRA8_FSEL1                     (*((volatile unsigned int*)(0x42A78444UL)))
#define bM4_PORT_PFSRA8_FSEL2                     (*((volatile unsigned int*)(0x42A78448UL)))
#define bM4_PORT_PFSRA8_FSEL3                     (*((volatile unsigned int*)(0x42A7844CUL)))
#define bM4_PORT_PFSRA8_FSEL4                     (*((volatile unsigned int*)(0x42A78450UL)))
#define bM4_PORT_PFSRA8_FSEL5                     (*((volatile unsigned int*)(0x42A78454UL)))
#define bM4_PORT_PFSRA8_BFE                       (*((volatile unsigned int*)(0x42A78460UL)))
#define bM4_PORT_PCRA9_POUT                       (*((volatile unsigned int*)(0x42A78480UL)))
#define bM4_PORT_PCRA9_POUTE                      (*((volatile unsigned int*)(0x42A78484UL)))
#define bM4_PORT_PCRA9_NOD                        (*((volatile unsigned int*)(0x42A78488UL)))
#define bM4_PORT_PCRA9_DRV0                       (*((volatile unsigned int*)(0x42A78490UL)))
#define bM4_PORT_PCRA9_DRV1                       (*((volatile unsigned int*)(0x42A78494UL)))
#define bM4_PORT_PCRA9_PUU                        (*((volatile unsigned int*)(0x42A78498UL)))
#define bM4_PORT_PCRA9_PIN                        (*((volatile unsigned int*)(0x42A784A0UL)))
#define bM4_PORT_PCRA9_INVE                       (*((volatile unsigned int*)(0x42A784A4UL)))
#define bM4_PORT_PCRA9_INTE                       (*((volatile unsigned int*)(0x42A784B0UL)))
#define bM4_PORT_PCRA9_LTE                        (*((volatile unsigned int*)(0x42A784B8UL)))
#define bM4_PORT_PCRA9_DDIS                       (*((volatile unsigned int*)(0x42A784BCUL)))
#define bM4_PORT_PFSRA9_FSEL0                     (*((volatile unsigned int*)(0x42A784C0UL)))
#define bM4_PORT_PFSRA9_FSEL1                     (*((volatile unsigned int*)(0x42A784C4UL)))
#define bM4_PORT_PFSRA9_FSEL2                     (*((volatile unsigned int*)(0x42A784C8UL)))
#define bM4_PORT_PFSRA9_FSEL3                     (*((volatile unsigned int*)(0x42A784CCUL)))
#define bM4_PORT_PFSRA9_FSEL4                     (*((volatile unsigned int*)(0x42A784D0UL)))
#define bM4_PORT_PFSRA9_FSEL5                     (*((volatile unsigned int*)(0x42A784D4UL)))
#define bM4_PORT_PFSRA9_BFE                       (*((volatile unsigned int*)(0x42A784E0UL)))
#define bM4_PORT_PCRA10_POUT                      (*((volatile unsigned int*)(0x42A78500UL)))
#define bM4_PORT_PCRA10_POUTE                     (*((volatile unsigned int*)(0x42A78504UL)))
#define bM4_PORT_PCRA10_NOD                       (*((volatile unsigned int*)(0x42A78508UL)))
#define bM4_PORT_PCRA10_DRV0                      (*((volatile unsigned int*)(0x42A78510UL)))
#define bM4_PORT_PCRA10_DRV1                      (*((volatile unsigned int*)(0x42A78514UL)))
#define bM4_PORT_PCRA10_PUU                       (*((volatile unsigned int*)(0x42A78518UL)))
#define bM4_PORT_PCRA10_PIN                       (*((volatile unsigned int*)(0x42A78520UL)))
#define bM4_PORT_PCRA10_INVE                      (*((volatile unsigned int*)(0x42A78524UL)))
#define bM4_PORT_PCRA10_INTE                      (*((volatile unsigned int*)(0x42A78530UL)))
#define bM4_PORT_PCRA10_LTE                       (*((volatile unsigned int*)(0x42A78538UL)))
#define bM4_PORT_PCRA10_DDIS                      (*((volatile unsigned int*)(0x42A7853CUL)))
#define bM4_PORT_PFSRA10_FSEL0                    (*((volatile unsigned int*)(0x42A78540UL)))
#define bM4_PORT_PFSRA10_FSEL1                    (*((volatile unsigned int*)(0x42A78544UL)))
#define bM4_PORT_PFSRA10_FSEL2                    (*((volatile unsigned int*)(0x42A78548UL)))
#define bM4_PORT_PFSRA10_FSEL3                    (*((volatile unsigned int*)(0x42A7854CUL)))
#define bM4_PORT_PFSRA10_FSEL4                    (*((volatile unsigned int*)(0x42A78550UL)))
