SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460keua_template/common/hc32f460keua.h
#define bM4_PORT_PCRC9_DRV1                       (*((volatile unsigned int*)(0x42A79494UL)))
#define bM4_PORT_PCRC9_PUU                        (*((volatile unsigned int*)(0x42A79498UL)))
#define bM4_PORT_PCRC9_PIN                        (*((volatile unsigned int*)(0x42A794A0UL)))
#define bM4_PORT_PCRC9_INVE                       (*((volatile unsigned int*)(0x42A794A4UL)))
#define bM4_PORT_PCRC9_INTE                       (*((volatile unsigned int*)(0x42A794B0UL)))
#define bM4_PORT_PCRC9_LTE                        (*((volatile unsigned int*)(0x42A794B8UL)))
#define bM4_PORT_PCRC9_DDIS                       (*((volatile unsigned int*)(0x42A794BCUL)))
#define bM4_PORT_PFSRC9_FSEL0                     (*((volatile unsigned int*)(0x42A794C0UL)))
#define bM4_PORT_PFSRC9_FSEL1                     (*((volatile unsigned int*)(0x42A794C4UL)))
#define bM4_PORT_PFSRC9_FSEL2                     (*((volatile unsigned int*)(0x42A794C8UL)))
#define bM4_PORT_PFSRC9_FSEL3                     (*((volatile unsigned int*)(0x42A794CCUL)))
#define bM4_PORT_PFSRC9_FSEL4                     (*((volatile unsigned int*)(0x42A794D0UL)))
#define bM4_PORT_PFSRC9_FSEL5                     (*((volatile unsigned int*)(0x42A794D4UL)))
#define bM4_PORT_PFSRC9_BFE                       (*((volatile unsigned int*)(0x42A794E0UL)))
#define bM4_PORT_PCRC10_POUT                      (*((volatile unsigned int*)(0x42A79500UL)))
#define bM4_PORT_PCRC10_POUTE                     (*((volatile unsigned int*)(0x42A79504UL)))
#define bM4_PORT_PCRC10_NOD                       (*((volatile unsigned int*)(0x42A79508UL)))
#define bM4_PORT_PCRC10_DRV0                      (*((volatile unsigned int*)(0x42A79510UL)))
#define bM4_PORT_PCRC10_DRV1                      (*((volatile unsigned int*)(0x42A79514UL)))
#define bM4_PORT_PCRC10_PUU                       (*((volatile unsigned int*)(0x42A79518UL)))
#define bM4_PORT_PCRC10_PIN                       (*((volatile unsigned int*)(0x42A79520UL)))
#define bM4_PORT_PCRC10_INVE                      (*((volatile unsigned int*)(0x42A79524UL)))
#define bM4_PORT_PCRC10_INTE                      (*((volatile unsigned int*)(0x42A79530UL)))
#define bM4_PORT_PCRC10_LTE                       (*((volatile unsigned int*)(0x42A79538UL)))
#define bM4_PORT_PCRC10_DDIS                      (*((volatile unsigned int*)(0x42A7953CUL)))
#define bM4_PORT_PFSRC10_FSEL0                    (*((volatile unsigned int*)(0x42A79540UL)))
#define bM4_PORT_PFSRC10_FSEL1                    (*((volatile unsigned int*)(0x42A79544UL)))
#define bM4_PORT_PFSRC10_FSEL2                    (*((volatile unsigned int*)(0x42A79548UL)))
#define bM4_PORT_PFSRC10_FSEL3                    (*((volatile unsigned int*)(0x42A7954CUL)))
#define bM4_PORT_PFSRC10_FSEL4                    (*((volatile unsigned int*)(0x42A79550UL)))
#define bM4_PORT_PFSRC10_FSEL5                    (*((volatile unsigned int*)(0x42A79554UL)))
#define bM4_PORT_PFSRC10_BFE                      (*((volatile unsigned int*)(0x42A79560UL)))
#define bM4_PORT_PCRC11_POUT                      (*((volatile unsigned int*)(0x42A79580UL)))
#define bM4_PORT_PCRC11_POUTE                     (*((volatile unsigned int*)(0x42A79584UL)))
#define bM4_PORT_PCRC11_NOD                       (*((volatile unsigned int*)(0x42A79588UL)))
#define bM4_PORT_PCRC11_DRV0                      (*((volatile unsigned int*)(0x42A79590UL)))
#define bM4_PORT_PCRC11_DRV1                      (*((volatile unsigned int*)(0x42A79594UL)))
#define bM4_PORT_PCRC11_PUU                       (*((volatile unsigned int*)(0x42A79598UL)))
#define bM4_PORT_PCRC11_PIN                       (*((volatile unsigned int*)(0x42A795A0UL)))
#define bM4_PORT_PCRC11_INVE                      (*((volatile unsigned int*)(0x42A795A4UL)))
#define bM4_PORT_PCRC11_INTE                      (*((volatile unsigned int*)(0x42A795B0UL)))
#define bM4_PORT_PCRC11_LTE                       (*((volatile unsigned int*)(0x42A795B8UL)))
#define bM4_PORT_PCRC11_DDIS                      (*((volatile unsigned int*)(0x42A795BCUL)))
#define bM4_PORT_PFSRC11_FSEL0                    (*((volatile unsigned int*)(0x42A795C0UL)))
#define bM4_PORT_PFSRC11_FSEL1                    (*((volatile unsigned int*)(0x42A795C4UL)))
#define bM4_PORT_PFSRC11_FSEL2                    (*((volatile unsigned int*)(0x42A795C8UL)))
#define bM4_PORT_PFSRC11_FSEL3                    (*((volatile unsigned int*)(0x42A795CCUL)))
#define bM4_PORT_PFSRC11_FSEL4                    (*((volatile unsigned int*)(0x42A795D0UL)))
#define bM4_PORT_PFSRC11_FSEL5                    (*((volatile unsigned int*)(0x42A795D4UL)))
#define bM4_PORT_PFSRC11_BFE                      (*((volatile unsigned int*)(0x42A795E0UL)))
#define bM4_PORT_PCRC12_POUT                      (*((volatile unsigned int*)(0x42A79600UL)))
#define bM4_PORT_PCRC12_POUTE                     (*((volatile unsigned int*)(0x42A79604UL)))
#define bM4_PORT_PCRC12_NOD                       (*((volatile unsigned int*)(0x42A79608UL)))
#define bM4_PORT_PCRC12_DRV0                      (*((volatile unsigned int*)(0x42A79610UL)))
#define bM4_PORT_PCRC12_DRV1                      (*((volatile unsigned int*)(0x42A79614UL)))
#define bM4_PORT_PCRC12_PUU                       (*((volatile unsigned int*)(0x42A79618UL)))
#define bM4_PORT_PCRC12_PIN                       (*((volatile unsigned int*)(0x42A79620UL)))
#define bM4_PORT_PCRC12_INVE                      (*((volatile unsigned int*)(0x42A79624UL)))
#define bM4_PORT_PCRC12_INTE                      (*((volatile unsigned int*)(0x42A79630UL)))
#define bM4_PORT_PCRC12_LTE                       (*((volatile unsigned int*)(0x42A79638UL)))
#define bM4_PORT_PCRC12_DDIS                      (*((volatile unsigned int*)(0x42A7963CUL)))
#define bM4_PORT_PFSRC12_FSEL0                    (*((volatile unsigned int*)(0x42A79640UL)))
#define bM4_PORT_PFSRC12_FSEL1                    (*((volatile unsigned int*)(0x42A79644UL)))
#define bM4_PORT_PFSRC12_FSEL2                    (*((volatile unsigned int*)(0x42A79648UL)))
#define bM4_PORT_PFSRC12_FSEL3                    (*((volatile unsigned int*)(0x42A7964CUL)))
#define bM4_PORT_PFSRC12_FSEL4                    (*((volatile unsigned int*)(0x42A79650UL)))
#define bM4_PORT_PFSRC12_FSEL5                    (*((volatile unsigned int*)(0x42A79654UL)))
#define bM4_PORT_PFSRC12_BFE                      (*((volatile unsigned int*)(0x42A79660UL)))
#define bM4_PORT_PCRC13_POUT                      (*((volatile unsigned int*)(0x42A79680UL)))
#define bM4_PORT_PCRC13_POUTE                     (*((volatile unsigned int*)(0x42A79684UL)))
#define bM4_PORT_PCRC13_NOD                       (*((volatile unsigned int*)(0x42A79688UL)))
#define bM4_PORT_PCRC13_DRV0                      (*((volatile unsigned int*)(0x42A79690UL)))
#define bM4_PORT_PCRC13_DRV1                      (*((volatile unsigned int*)(0x42A79694UL)))
#define bM4_PORT_PCRC13_PUU                       (*((volatile unsigned int*)(0x42A79698UL)))
#define bM4_PORT_PCRC13_PIN                       (*((volatile unsigned int*)(0x42A796A0UL)))
#define bM4_PORT_PCRC13_INVE                      (*((volatile unsigned int*)(0x42A796A4UL)))
#define bM4_PORT_PCRC13_INTE                      (*((volatile unsigned int*)(0x42A796B0UL)))
#define bM4_PORT_PCRC13_LTE                       (*((volatile unsigned int*)(0x42A796B8UL)))
#define bM4_PORT_PCRC13_DDIS                      (*((volatile unsigned int*)(0x42A796BCUL)))
#define bM4_PORT_PFSRC13_FSEL0                    (*((volatile unsigned int*)(0x42A796C0UL)))
#define bM4_PORT_PFSRC13_FSEL1                    (*((volatile unsigned int*)(0x42A796C4UL)))
#define bM4_PORT_PFSRC13_FSEL2                    (*((volatile unsigned int*)(0x42A796C8UL)))
#define bM4_PORT_PFSRC13_FSEL3                    (*((volatile unsigned int*)(0x42A796CCUL)))
#define bM4_PORT_PFSRC13_FSEL4                    (*((volatile unsigned int*)(0x42A796D0UL)))
#define bM4_PORT_PFSRC13_FSEL5                    (*((volatile unsigned int*)(0x42A796D4UL)))
#define bM4_PORT_PFSRC13_BFE                      (*((volatile unsigned int*)(0x42A796E0UL)))
#define bM4_PORT_PCRC14_POUT                      (*((volatile unsigned int*)(0x42A79700UL)))
#define bM4_PORT_PCRC14_POUTE                     (*((volatile unsigned int*)(0x42A79704UL)))
#define bM4_PORT_PCRC14_NOD                       (*((volatile unsigned int*)(0x42A79708UL)))
#define bM4_PORT_PCRC14_DRV0                      (*((volatile unsigned int*)(0x42A79710UL)))
#define bM4_PORT_PCRC14_DRV1                      (*((volatile unsigned int*)(0x42A79714UL)))
#define bM4_PORT_PCRC14_PUU                       (*((volatile unsigned int*)(0x42A79718UL)))
#define bM4_PORT_PCRC14_PIN                       (*((volatile unsigned int*)(0x42A79720UL)))
#define bM4_PORT_PCRC14_INVE                      (*((volatile unsigned int*)(0x42A79724UL)))
#define bM4_PORT_PCRC14_INTE                      (*((volatile unsigned int*)(0x42A79730UL)))
#define bM4_PORT_PCRC14_LTE                       (*((volatile unsigned int*)(0x42A79738UL)))
#define bM4_PORT_PCRC14_DDIS                      (*((volatile unsigned int*)(0x42A7973CUL)))
#define bM4_PORT_PFSRC14_FSEL0                    (*((volatile unsigned int*)(0x42A79740UL)))
#define bM4_PORT_PFSRC14_FSEL1                    (*((volatile unsigned int*)(0x42A79744UL)))
#define bM4_PORT_PFSRC14_FSEL2                    (*((volatile unsigned int*)(0x42A79748UL)))
#define bM4_PORT_PFSRC14_FSEL3                    (*((volatile unsigned int*)(0x42A7974CUL)))
#define bM4_PORT_PFSRC14_FSEL4                    (*((volatile unsigned int*)(0x42A79750UL)))
#define bM4_PORT_PFSRC14_FSEL5                    (*((volatile unsigned int*)(0x42A79754UL)))
#define bM4_PORT_PFSRC14_BFE                      (*((volatile unsigned int*)(0x42A79760UL)))
#define bM4_PORT_PCRC15_POUT                      (*((volatile unsigned int*)(0x42A79780UL)))
#define bM4_PORT_PCRC15_POUTE                     (*((volatile unsigned int*)(0x42A79784UL)))
#define bM4_PORT_PCRC15_NOD                       (*((volatile unsigned int*)(0x42A79788UL)))
#define bM4_PORT_PCRC15_DRV0                      (*((volatile unsigned int*)(0x42A79790UL)))
#define bM4_PORT_PCRC15_DRV1                      (*((volatile unsigned int*)(0x42A79794UL)))
#define bM4_PORT_PCRC15_PUU                       (*((volatile unsigned int*)(0x42A79798UL)))
#define bM4_PORT_PCRC15_PIN                       (*((volatile unsigned int*)(0x42A797A0UL)))
#define bM4_PORT_PCRC15_INVE                      (*((volatile unsigned int*)(0x42A797A4UL)))
#define bM4_PORT_PCRC15_INTE                      (*((volatile unsigned int*)(0x42A797B0UL)))
#define bM4_PORT_PCRC15_LTE                       (*((volatile unsigned int*)(0x42A797B8UL)))
#define bM4_PORT_PCRC15_DDIS                      (*((volatile unsigned int*)(0x42A797BCUL)))
#define bM4_PORT_PFSRC15_FSEL0                    (*((volatile unsigned int*)(0x42A797C0UL)))
#define bM4_PORT_PFSRC15_FSEL1                    (*((volatile unsigned int*)(0x42A797C4UL)))
#define bM4_PORT_PFSRC15_FSEL2                    (*((volatile unsigned int*)(0x42A797C8UL)))
#define bM4_PORT_PFSRC15_FSEL3                    (*((volatile unsigned int*)(0x42A797CCUL)))
#define bM4_PORT_PFSRC15_FSEL4                    (*((volatile unsigned int*)(0x42A797D0UL)))
#define bM4_PORT_PFSRC15_FSEL5                    (*((volatile unsigned int*)(0x42A797D4UL)))
#define bM4_PORT_PFSRC15_BFE                      (*((volatile unsigned int*)(0x42A797E0UL)))
#define bM4_PORT_PCRE15_POUT                      (*((volatile unsigned int*)(0x42A7A780UL)))
#define bM4_PORT_PCRE15_POUTE                     (*((volatile unsigned int*)(0x42A7A784UL)))
#define bM4_PORT_PCRE15_NOD                       (*((volatile unsigned int*)(0x42A7A788UL)))
#define bM4_PORT_PCRE15_DRV0                      (*((volatile unsigned int*)(0x42A7A790UL)))
#define bM4_PORT_PCRE15_DRV1                      (*((volatile unsigned int*)(0x42A7A794UL)))
#define bM4_PORT_PCRE15_PUU                       (*((volatile unsigned int*)(0x42A7A798UL)))
#define bM4_PORT_PCRE15_PIN                       (*((volatile unsigned int*)(0x42A7A7A0UL)))
#define bM4_PORT_PCRE15_INVE                      (*((volatile unsigned int*)(0x42A7A7A4UL)))
#define bM4_PORT_PCRE15_INTE                      (*((volatile unsigned int*)(0x42A7A7B0UL)))
#define bM4_PORT_PCRE15_LTE                       (*((volatile unsigned int*)(0x42A7A7B8UL)))
#define bM4_PORT_PCRE15_DDIS                      (*((volatile unsigned int*)(0x42A7A7BCUL)))
#define bM4_PORT_PFSRE15_FSEL0                    (*((volatile unsigned int*)(0x42A7A7C0UL)))
#define bM4_PORT_PFSRE15_FSEL1                    (*((volatile unsigned int*)(0x42A7A7C4UL)))
#define bM4_PORT_PFSRE15_FSEL2                    (*((volatile unsigned int*)(0x42A7A7C8UL)))
#define bM4_PORT_PFSRE15_FSEL3                    (*((volatile unsigned int*)(0x42A7A7CCUL)))
#define bM4_PORT_PFSRE15_FSEL4                    (*((volatile unsigned int*)(0x42A7A7D0UL)))
#define bM4_PORT_PFSRE15_FSEL5                    (*((volatile unsigned int*)(0x42A7A7D4UL)))
#define bM4_PORT_PFSRE15_BFE                      (*((volatile unsigned int*)(0x42A7A7E0UL)))
#define bM4_PORT_PCRH0_POUT                       (*((volatile unsigned int*)(0x42A7A800UL)))
#define bM4_PORT_PCRH0_POUTE                      (*((volatile unsigned int*)(0x42A7A804UL)))
#define bM4_PORT_PCRH0_NOD                        (*((volatile unsigned int*)(0x42A7A808UL)))
#define bM4_PORT_PCRH0_DRV0                       (*((volatile unsigned int*)(0x42A7A810UL)))
#define bM4_PORT_PCRH0_DRV1                       (*((volatile unsigned int*)(0x42A7A814UL)))
#define bM4_PORT_PCRH0_PUU                        (*((volatile unsigned int*)(0x42A7A818UL)))
#define bM4_PORT_PCRH0_PIN                        (*((volatile unsigned int*)(0x42A7A820UL)))
#define bM4_PORT_PCRH0_INVE                       (*((volatile unsigned int*)(0x42A7A824UL)))
#define bM4_PORT_PCRH0_INTE                       (*((volatile unsigned int*)(0x42A7A830UL)))
#define bM4_PORT_PCRH0_LTE                        (*((volatile unsigned int*)(0x42A7A838UL)))
#define bM4_PORT_PCRH0_DDIS                       (*((volatile unsigned int*)(0x42A7A83CUL)))
#define bM4_PORT_PFSRH0_FSEL0                     (*((volatile unsigned int*)(0x42A7A840UL)))
#define bM4_PORT_PFSRH0_FSEL1                     (*((volatile unsigned int*)(0x42A7A844UL)))
#define bM4_PORT_PFSRH0_FSEL2                     (*((volatile unsigned int*)(0x42A7A848UL)))
#define bM4_PORT_PFSRH0_FSEL3                     (*((volatile unsigned int*)(0x42A7A84CUL)))
#define bM4_PORT_PFSRH0_FSEL4                     (*((volatile unsigned int*)(0x42A7A850UL)))
#define bM4_PORT_PFSRH0_FSEL5                     (*((volatile unsigned int*)(0x42A7A854UL)))
#define bM4_PORT_PFSRH0_BFE                       (*((volatile unsigned int*)(0x42A7A860UL)))
#define bM4_PORT_PCRH1_POUT                       (*((volatile unsigned int*)(0x42A7A880UL)))
#define bM4_PORT_PCRH1_POUTE                      (*((volatile unsigned int*)(0x42A7A884UL)))
#define bM4_PORT_PCRH1_NOD                        (*((volatile unsigned int*)(0x42A7A888UL)))
#define bM4_PORT_PCRH1_DRV0                       (*((volatile unsigned int*)(0x42A7A890UL)))
#define bM4_PORT_PCRH1_DRV1                       (*((volatile unsigned int*)(0x42A7A894UL)))
#define bM4_PORT_PCRH1_PUU                        (*((volatile unsigned int*)(0x42A7A898UL)))
#define bM4_PORT_PCRH1_PIN                        (*((volatile unsigned int*)(0x42A7A8A0UL)))
#define bM4_PORT_PCRH1_INVE                       (*((volatile unsigned int*)(0x42A7A8A4UL)))
#define bM4_PORT_PCRH1_INTE                       (*((volatile unsigned int*)(0x42A7A8B0UL)))
#define bM4_PORT_PCRH1_LTE                        (*((volatile unsigned int*)(0x42A7A8B8UL)))
#define bM4_PORT_PCRH1_DDIS                       (*((volatile unsigned int*)(0x42A7A8BCUL)))
#define bM4_PORT_PFSRH1_FSEL0                     (*((volatile unsigned int*)(0x42A7A8C0UL)))
#define bM4_PORT_PFSRH1_FSEL1                     (*((volatile unsigned int*)(0x42A7A8C4UL)))
#define bM4_PORT_PFSRH1_FSEL2                     (*((volatile unsigned int*)(0x42A7A8C8UL)))
#define bM4_PORT_PFSRH1_FSEL3                     (*((volatile unsigned int*)(0x42A7A8CCUL)))
#define bM4_PORT_PFSRH1_FSEL4                     (*((volatile unsigned int*)(0x42A7A8D0UL)))
#define bM4_PORT_PFSRH1_FSEL5                     (*((volatile unsigned int*)(0x42A7A8D4UL)))
#define bM4_PORT_PFSRH1_BFE                       (*((volatile unsigned int*)(0x42A7A8E0UL)))
#define bM4_PORT_PCRH2_POUT                       (*((volatile unsigned int*)(0x42A7A900UL)))
#define bM4_PORT_PCRH2_POUTE                      (*((volatile unsigned int*)(0x42A7A904UL)))
#define bM4_PORT_PCRH2_NOD                        (*((volatile unsigned int*)(0x42A7A908UL)))
#define bM4_PORT_PCRH2_DRV0                       (*((volatile unsigned int*)(0x42A7A910UL)))
#define bM4_PORT_PCRH2_DRV1                       (*((volatile unsigned int*)(0x42A7A914UL)))
#define bM4_PORT_PCRH2_PUU                        (*((volatile unsigned int*)(0x42A7A918UL)))
#define bM4_PORT_PCRH2_PIN                        (*((volatile unsigned int*)(0x42A7A920UL)))
#define bM4_PORT_PCRH2_INVE                       (*((volatile unsigned int*)(0x42A7A924UL)))
#define bM4_PORT_PCRH2_INTE                       (*((volatile unsigned int*)(0x42A7A930UL)))
#define bM4_PORT_PCRH2_LTE                        (*((volatile unsigned int*)(0x42A7A938UL)))
#define bM4_PORT_PCRH2_DDIS                       (*((volatile unsigned int*)(0x42A7A93CUL)))
#define bM4_PORT_PFSRH2_FSEL0                     (*((volatile unsigned int*)(0x42A7A940UL)))
#define bM4_PORT_PFSRH2_FSEL1                     (*((volatile unsigned int*)(0x42A7A944UL)))
#define bM4_PORT_PFSRH2_FSEL2                     (*((volatile unsigned int*)(0x42A7A948UL)))
#define bM4_PORT_PFSRH2_FSEL3                     (*((volatile unsigned int*)(0x42A7A94CUL)))
#define bM4_PORT_PFSRH2_FSEL4                     (*((volatile unsigned int*)(0x42A7A950UL)))
#define bM4_PORT_PFSRH2_FSEL5                     (*((volatile unsigned int*)(0x42A7A954UL)))
#define bM4_PORT_PFSRH2_BFE                       (*((volatile unsigned int*)(0x42A7A960UL)))
#define bM4_RTC_CR0_RESET                         (*((volatile unsigned int*)(0x42980000UL)))
#define bM4_RTC_CR1_PRDS0                         (*((volatile unsigned int*)(0x42980080UL)))
#define bM4_RTC_CR1_PRDS1                         (*((volatile unsigned int*)(0x42980084UL)))
#define bM4_RTC_CR1_PRDS2                         (*((volatile unsigned int*)(0x42980088UL)))
#define bM4_RTC_CR1_AMPM                          (*((volatile unsigned int*)(0x4298008CUL)))
#define bM4_RTC_CR1_ALMFCLR                       (*((volatile unsigned int*)(0x42980090UL)))
#define bM4_RTC_CR1_ONEHZOE                       (*((volatile unsigned int*)(0x42980094UL)))
#define bM4_RTC_CR1_ONEHZSEL                      (*((volatile unsigned int*)(0x42980098UL)))
#define bM4_RTC_CR1_START                         (*((volatile unsigned int*)(0x4298009CUL)))
#define bM4_RTC_CR2_RWREQ                         (*((volatile unsigned int*)(0x42980100UL)))
#define bM4_RTC_CR2_RWEN                          (*((volatile unsigned int*)(0x42980104UL)))
#define bM4_RTC_CR2_ALMF                          (*((volatile unsigned int*)(0x4298010CUL)))
#define bM4_RTC_CR2_PRDIE                         (*((volatile unsigned int*)(0x42980114UL)))
#define bM4_RTC_CR2_ALMIE                         (*((volatile unsigned int*)(0x42980118UL)))
#define bM4_RTC_CR2_ALME                          (*((volatile unsigned int*)(0x4298011CUL)))
#define bM4_RTC_CR3_LRCEN                         (*((volatile unsigned int*)(0x42980190UL)))
#define bM4_RTC_CR3_RCKSEL                        (*((volatile unsigned int*)(0x4298019CUL)))
#define bM4_RTC_SEC_SECU0                         (*((volatile unsigned int*)(0x42980200UL)))
#define bM4_RTC_SEC_SECU1                         (*((volatile unsigned int*)(0x42980204UL)))
#define bM4_RTC_SEC_SECU2                         (*((volatile unsigned int*)(0x42980208UL)))
#define bM4_RTC_SEC_SECU3                         (*((volatile unsigned int*)(0x4298020CUL)))
#define bM4_RTC_SEC_SECD0                         (*((volatile unsigned int*)(0x42980210UL)))
#define bM4_RTC_SEC_SECD1                         (*((volatile unsigned int*)(0x42980214UL)))
#define bM4_RTC_SEC_SECD2                         (*((volatile unsigned int*)(0x42980218UL)))
#define bM4_RTC_MIN_MINU0                         (*((volatile unsigned int*)(0x42980280UL)))
#define bM4_RTC_MIN_MINU1                         (*((volatile unsigned int*)(0x42980284UL)))
#define bM4_RTC_MIN_MINU2                         (*((volatile unsigned int*)(0x42980288UL)))
#define bM4_RTC_MIN_MINU3                         (*((volatile unsigned int*)(0x4298028CUL)))
#define bM4_RTC_MIN_MIND0                         (*((volatile unsigned int*)(0x42980290UL)))
#define bM4_RTC_MIN_MIND1                         (*((volatile unsigned int*)(0x42980294UL)))
#define bM4_RTC_MIN_MIND2                         (*((volatile unsigned int*)(0x42980298UL)))
#define bM4_RTC_HOUR_HOURU0                       (*((volatile unsigned int*)(0x42980300UL)))
#define bM4_RTC_HOUR_HOURU1                       (*((volatile unsigned int*)(0x42980304UL)))
#define bM4_RTC_HOUR_HOURU2                       (*((volatile unsigned int*)(0x42980308UL)))
#define bM4_RTC_HOUR_HOURU3                       (*((volatile unsigned int*)(0x4298030CUL)))
#define bM4_RTC_HOUR_HOURD0                       (*((volatile unsigned int*)(0x42980310UL)))
#define bM4_RTC_HOUR_HOURD1                       (*((volatile unsigned int*)(0x42980314UL)))
#define bM4_RTC_WEEK_WEEK0                        (*((volatile unsigned int*)(0x42980380UL)))
#define bM4_RTC_WEEK_WEEK1                        (*((volatile unsigned int*)(0x42980384UL)))
#define bM4_RTC_WEEK_WEEK2                        (*((volatile unsigned int*)(0x42980388UL)))
#define bM4_RTC_DAY_DAYU0                         (*((volatile unsigned int*)(0x42980400UL)))
#define bM4_RTC_DAY_DAYU1                         (*((volatile unsigned int*)(0x42980404UL)))
#define bM4_RTC_DAY_DAYU2                         (*((volatile unsigned int*)(0x42980408UL)))
#define bM4_RTC_DAY_DAYU3                         (*((volatile unsigned int*)(0x4298040CUL)))
#define bM4_RTC_DAY_DAYD0                         (*((volatile unsigned int*)(0x42980410UL)))
#define bM4_RTC_DAY_DAYD1                         (*((volatile unsigned int*)(0x42980414UL)))
#define bM4_RTC_MON_MON0                          (*((volatile unsigned int*)(0x42980480UL)))
#define bM4_RTC_MON_MON1                          (*((volatile unsigned int*)(0x42980484UL)))
#define bM4_RTC_MON_MON2                          (*((volatile unsigned int*)(0x42980488UL)))
#define bM4_RTC_MON_MON3                          (*((volatile unsigned int*)(0x4298048CUL)))
#define bM4_RTC_MON_MON4                          (*((volatile unsigned int*)(0x42980490UL)))
#define bM4_RTC_YEAR_YEARU0                       (*((volatile unsigned int*)(0x42980500UL)))
#define bM4_RTC_YEAR_YEARU1                       (*((volatile unsigned int*)(0x42980504UL)))
#define bM4_RTC_YEAR_YEARU2                       (*((volatile unsigned int*)(0x42980508UL)))
#define bM4_RTC_YEAR_YEARU3                       (*((volatile unsigned int*)(0x4298050CUL)))
#define bM4_RTC_YEAR_YEARD0                       (*((volatile unsigned int*)(0x42980510UL)))
#define bM4_RTC_YEAR_YEARD1                       (*((volatile unsigned int*)(0x42980514UL)))
#define bM4_RTC_YEAR_YEARD2                       (*((volatile unsigned int*)(0x42980518UL)))
#define bM4_RTC_YEAR_YEARD3                       (*((volatile unsigned int*)(0x4298051CUL)))
#define bM4_RTC_ALMMIN_ALMMINU0                   (*((volatile unsigned int*)(0x42980580UL)))
#define bM4_RTC_ALMMIN_ALMMINU1                   (*((volatile unsigned int*)(0x42980584UL)))
