SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460keua_template/common/hc32f460keua.h
#define bM4_SPI4_SR_TDEF                          (*((volatile unsigned int*)(0x42408294UL)))
#define bM4_SPI4_SR_RDFF                          (*((volatile unsigned int*)(0x4240829CUL)))
#define bM4_SPI4_CFG2_CPHA                        (*((volatile unsigned int*)(0x42408300UL)))
#define bM4_SPI4_CFG2_CPOL                        (*((volatile unsigned int*)(0x42408304UL)))
#define bM4_SPI4_CFG2_MBR0                        (*((volatile unsigned int*)(0x42408308UL)))
#define bM4_SPI4_CFG2_MBR1                        (*((volatile unsigned int*)(0x4240830CUL)))
#define bM4_SPI4_CFG2_MBR2                        (*((volatile unsigned int*)(0x42408310UL)))
#define bM4_SPI4_CFG2_SSA0                        (*((volatile unsigned int*)(0x42408314UL)))
#define bM4_SPI4_CFG2_SSA1                        (*((volatile unsigned int*)(0x42408318UL)))
#define bM4_SPI4_CFG2_SSA2                        (*((volatile unsigned int*)(0x4240831CUL)))
#define bM4_SPI4_CFG2_DSIZE0                      (*((volatile unsigned int*)(0x42408320UL)))
#define bM4_SPI4_CFG2_DSIZE1                      (*((volatile unsigned int*)(0x42408324UL)))
#define bM4_SPI4_CFG2_DSIZE2                      (*((volatile unsigned int*)(0x42408328UL)))
#define bM4_SPI4_CFG2_DSIZE3                      (*((volatile unsigned int*)(0x4240832CUL)))
#define bM4_SPI4_CFG2_LSBF                        (*((volatile unsigned int*)(0x42408330UL)))
#define bM4_SPI4_CFG2_MIDIE                       (*((volatile unsigned int*)(0x42408334UL)))
#define bM4_SPI4_CFG2_MSSDLE                      (*((volatile unsigned int*)(0x42408338UL)))
#define bM4_SPI4_CFG2_MSSIE                       (*((volatile unsigned int*)(0x4240833CUL)))
#define bM4_SRAMC_WTCR_SRAM12_RWT0                (*((volatile unsigned int*)(0x42A10000UL)))
#define bM4_SRAMC_WTCR_SRAM12_RWT1                (*((volatile unsigned int*)(0x42A10004UL)))
#define bM4_SRAMC_WTCR_SRAM12_RWT2                (*((volatile unsigned int*)(0x42A10008UL)))
#define bM4_SRAMC_WTCR_SRAM12_WWT0                (*((volatile unsigned int*)(0x42A10010UL)))
#define bM4_SRAMC_WTCR_SRAM12_WWT1                (*((volatile unsigned int*)(0x42A10014UL)))
#define bM4_SRAMC_WTCR_SRAM12_WWT2                (*((volatile unsigned int*)(0x42A10018UL)))
#define bM4_SRAMC_WTCR_SRAM3_RWT0                 (*((volatile unsigned int*)(0x42A10020UL)))
#define bM4_SRAMC_WTCR_SRAM3_RWT1                 (*((volatile unsigned int*)(0x42A10024UL)))
#define bM4_SRAMC_WTCR_SRAM3_RWT2                 (*((volatile unsigned int*)(0x42A10028UL)))
#define bM4_SRAMC_WTCR_SRAM3_WWT0                 (*((volatile unsigned int*)(0x42A10030UL)))
#define bM4_SRAMC_WTCR_SRAM3_WWT1                 (*((volatile unsigned int*)(0x42A10034UL)))
#define bM4_SRAMC_WTCR_SRAM3_WWT2                 (*((volatile unsigned int*)(0x42A10038UL)))
#define bM4_SRAMC_WTCR_SRAMH_RWT0                 (*((volatile unsigned int*)(0x42A10040UL)))
#define bM4_SRAMC_WTCR_SRAMH_RWT1                 (*((volatile unsigned int*)(0x42A10044UL)))
#define bM4_SRAMC_WTCR_SRAMH_RWT2                 (*((volatile unsigned int*)(0x42A10048UL)))
#define bM4_SRAMC_WTCR_SRAMH_WWT0                 (*((volatile unsigned int*)(0x42A10050UL)))
#define bM4_SRAMC_WTCR_SRAMH_WWT1                 (*((volatile unsigned int*)(0x42A10054UL)))
#define bM4_SRAMC_WTCR_SRAMH_WWT2                 (*((volatile unsigned int*)(0x42A10058UL)))
#define bM4_SRAMC_WTCR_SRAMR_RWT0                 (*((volatile unsigned int*)(0x42A10060UL)))
#define bM4_SRAMC_WTCR_SRAMR_RWT1                 (*((volatile unsigned int*)(0x42A10064UL)))
#define bM4_SRAMC_WTCR_SRAMR_RWT2                 (*((volatile unsigned int*)(0x42A10068UL)))
#define bM4_SRAMC_WTCR_SRAMR_WWT0                 (*((volatile unsigned int*)(0x42A10070UL)))
#define bM4_SRAMC_WTCR_SRAMR_WWT1                 (*((volatile unsigned int*)(0x42A10074UL)))
#define bM4_SRAMC_WTCR_SRAMR_WWT2                 (*((volatile unsigned int*)(0x42A10078UL)))
#define bM4_SRAMC_WTPR_WTPRC                      (*((volatile unsigned int*)(0x42A10080UL)))
#define bM4_SRAMC_WTPR_WTPRKW0                    (*((volatile unsigned int*)(0x42A10084UL)))
#define bM4_SRAMC_WTPR_WTPRKW1                    (*((volatile unsigned int*)(0x42A10088UL)))
#define bM4_SRAMC_WTPR_WTPRKW2                    (*((volatile unsigned int*)(0x42A1008CUL)))
#define bM4_SRAMC_WTPR_WTPRKW3                    (*((volatile unsigned int*)(0x42A10090UL)))
#define bM4_SRAMC_WTPR_WTPRKW4                    (*((volatile unsigned int*)(0x42A10094UL)))
#define bM4_SRAMC_WTPR_WTPRKW5                    (*((volatile unsigned int*)(0x42A10098UL)))
#define bM4_SRAMC_WTPR_WTPRKW6                    (*((volatile unsigned int*)(0x42A1009CUL)))
#define bM4_SRAMC_CKCR_PYOAD                      (*((volatile unsigned int*)(0x42A10100UL)))
#define bM4_SRAMC_CKCR_ECCOAD                     (*((volatile unsigned int*)(0x42A10140UL)))
#define bM4_SRAMC_CKCR_ECCMOD0                    (*((volatile unsigned int*)(0x42A10160UL)))
#define bM4_SRAMC_CKCR_ECCMOD1                    (*((volatile unsigned int*)(0x42A10164UL)))
#define bM4_SRAMC_CKPR_CKPRC                      (*((volatile unsigned int*)(0x42A10180UL)))
#define bM4_SRAMC_CKPR_CKPRKW0                    (*((volatile unsigned int*)(0x42A10184UL)))
#define bM4_SRAMC_CKPR_CKPRKW1                    (*((volatile unsigned int*)(0x42A10188UL)))
#define bM4_SRAMC_CKPR_CKPRKW2                    (*((volatile unsigned int*)(0x42A1018CUL)))
#define bM4_SRAMC_CKPR_CKPRKW3                    (*((volatile unsigned int*)(0x42A10190UL)))
#define bM4_SRAMC_CKPR_CKPRKW4                    (*((volatile unsigned int*)(0x42A10194UL)))
#define bM4_SRAMC_CKPR_CKPRKW5                    (*((volatile unsigned int*)(0x42A10198UL)))
#define bM4_SRAMC_CKPR_CKPRKW6                    (*((volatile unsigned int*)(0x42A1019CUL)))
#define bM4_SRAMC_CKSR_SRAM3_1ERR                 (*((volatile unsigned int*)(0x42A10200UL)))
#define bM4_SRAMC_CKSR_SRAM3_2ERR                 (*((volatile unsigned int*)(0x42A10204UL)))
#define bM4_SRAMC_CKSR_SRAM12_PYERR               (*((volatile unsigned int*)(0x42A10208UL)))
#define bM4_SRAMC_CKSR_SRAMH_PYERR                (*((volatile unsigned int*)(0x42A1020CUL)))
#define bM4_SRAMC_CKSR_SRAMR_PYERR                (*((volatile unsigned int*)(0x42A10210UL)))
#define bM4_SWDT_SR_CNT0                          (*((volatile unsigned int*)(0x42928080UL)))
#define bM4_SWDT_SR_CNT1                          (*((volatile unsigned int*)(0x42928084UL)))
#define bM4_SWDT_SR_CNT2                          (*((volatile unsigned int*)(0x42928088UL)))
#define bM4_SWDT_SR_CNT3                          (*((volatile unsigned int*)(0x4292808CUL)))
#define bM4_SWDT_SR_CNT4                          (*((volatile unsigned int*)(0x42928090UL)))
#define bM4_SWDT_SR_CNT5                          (*((volatile unsigned int*)(0x42928094UL)))
#define bM4_SWDT_SR_CNT6                          (*((volatile unsigned int*)(0x42928098UL)))
#define bM4_SWDT_SR_CNT7                          (*((volatile unsigned int*)(0x4292809CUL)))
#define bM4_SWDT_SR_CNT8                          (*((volatile unsigned int*)(0x429280A0UL)))
#define bM4_SWDT_SR_CNT9                          (*((volatile unsigned int*)(0x429280A4UL)))
#define bM4_SWDT_SR_CNT10                         (*((volatile unsigned int*)(0x429280A8UL)))
#define bM4_SWDT_SR_CNT11                         (*((volatile unsigned int*)(0x429280ACUL)))
#define bM4_SWDT_SR_CNT12                         (*((volatile unsigned int*)(0x429280B0UL)))
#define bM4_SWDT_SR_CNT13                         (*((volatile unsigned int*)(0x429280B4UL)))
#define bM4_SWDT_SR_CNT14                         (*((volatile unsigned int*)(0x429280B8UL)))
#define bM4_SWDT_SR_CNT15                         (*((volatile unsigned int*)(0x429280BCUL)))
#define bM4_SWDT_SR_UDF                           (*((volatile unsigned int*)(0x429280C0UL)))
#define bM4_SWDT_SR_REF                           (*((volatile unsigned int*)(0x429280C4UL)))
#define bM4_SWDT_RR_RF0                           (*((volatile unsigned int*)(0x42928100UL)))
#define bM4_SWDT_RR_RF1                           (*((volatile unsigned int*)(0x42928104UL)))
#define bM4_SWDT_RR_RF2                           (*((volatile unsigned int*)(0x42928108UL)))
#define bM4_SWDT_RR_RF3                           (*((volatile unsigned int*)(0x4292810CUL)))
#define bM4_SWDT_RR_RF4                           (*((volatile unsigned int*)(0x42928110UL)))
#define bM4_SWDT_RR_RF5                           (*((volatile unsigned int*)(0x42928114UL)))
#define bM4_SWDT_RR_RF6                           (*((volatile unsigned int*)(0x42928118UL)))
#define bM4_SWDT_RR_RF7                           (*((volatile unsigned int*)(0x4292811CUL)))
#define bM4_SWDT_RR_RF8                           (*((volatile unsigned int*)(0x42928120UL)))
#define bM4_SWDT_RR_RF9                           (*((volatile unsigned int*)(0x42928124UL)))
#define bM4_SWDT_RR_RF10                          (*((volatile unsigned int*)(0x42928128UL)))
#define bM4_SWDT_RR_RF11                          (*((volatile unsigned int*)(0x4292812CUL)))
#define bM4_SWDT_RR_RF12                          (*((volatile unsigned int*)(0x42928130UL)))
#define bM4_SWDT_RR_RF13                          (*((volatile unsigned int*)(0x42928134UL)))
#define bM4_SWDT_RR_RF14                          (*((volatile unsigned int*)(0x42928138UL)))
#define bM4_SWDT_RR_RF15                          (*((volatile unsigned int*)(0x4292813CUL)))
#define bM4_SYSREG_PWR_STPMCR_FLNWT               (*((volatile unsigned int*)(0x42A80180UL)))
#define bM4_SYSREG_PWR_STPMCR_CKSMRC              (*((volatile unsigned int*)(0x42A80184UL)))
#define bM4_SYSREG_PWR_STPMCR_STOP                (*((volatile unsigned int*)(0x42A801BCUL)))
#define bM4_SYSREG_CMU_PERICKSEL_PERICKSEL0       (*((volatile unsigned int*)(0x42A80200UL)))
#define bM4_SYSREG_CMU_PERICKSEL_PERICKSEL1       (*((volatile unsigned int*)(0x42A80204UL)))
#define bM4_SYSREG_CMU_PERICKSEL_PERICKSEL2       (*((volatile unsigned int*)(0x42A80208UL)))
#define bM4_SYSREG_CMU_PERICKSEL_PERICKSEL3       (*((volatile unsigned int*)(0x42A8020CUL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S1CKSEL0        (*((volatile unsigned int*)(0x42A80240UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S1CKSEL1        (*((volatile unsigned int*)(0x42A80244UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S1CKSEL2        (*((volatile unsigned int*)(0x42A80248UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S1CKSEL3        (*((volatile unsigned int*)(0x42A8024CUL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S2CKSEL0        (*((volatile unsigned int*)(0x42A80250UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S2CKSEL1        (*((volatile unsigned int*)(0x42A80254UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S2CKSEL2        (*((volatile unsigned int*)(0x42A80258UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S2CKSEL3        (*((volatile unsigned int*)(0x42A8025CUL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S3CKSEL0        (*((volatile unsigned int*)(0x42A80260UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S3CKSEL1        (*((volatile unsigned int*)(0x42A80264UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S3CKSEL2        (*((volatile unsigned int*)(0x42A80268UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S3CKSEL3        (*((volatile unsigned int*)(0x42A8026CUL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S4CKSEL0        (*((volatile unsigned int*)(0x42A80270UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S4CKSEL1        (*((volatile unsigned int*)(0x42A80274UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S4CKSEL2        (*((volatile unsigned int*)(0x42A80278UL)))
#define bM4_SYSREG_CMU_I2SCKSEL_I2S4CKSEL3        (*((volatile unsigned int*)(0x42A8027CUL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC0             (*((volatile unsigned int*)(0x42A80280UL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC1             (*((volatile unsigned int*)(0x42A80284UL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC2             (*((volatile unsigned int*)(0x42A80288UL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC3             (*((volatile unsigned int*)(0x42A8028CUL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC4             (*((volatile unsigned int*)(0x42A80290UL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC5             (*((volatile unsigned int*)(0x42A80294UL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC6             (*((volatile unsigned int*)(0x42A80298UL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC7             (*((volatile unsigned int*)(0x42A8029CUL)))
#define bM4_SYSREG_PWR_RAMPC0_RAMPDC8             (*((volatile unsigned int*)(0x42A802A0UL)))
#define bM4_SYSREG_MPU_IPPR_AESRDP                (*((volatile unsigned int*)(0x42A80380UL)))
#define bM4_SYSREG_MPU_IPPR_AESWRP                (*((volatile unsigned int*)(0x42A80384UL)))
#define bM4_SYSREG_MPU_IPPR_HASHRDP               (*((volatile unsigned int*)(0x42A80388UL)))
#define bM4_SYSREG_MPU_IPPR_HASHWRP               (*((volatile unsigned int*)(0x42A8038CUL)))
#define bM4_SYSREG_MPU_IPPR_TRNGRDP               (*((volatile unsigned int*)(0x42A80390UL)))
#define bM4_SYSREG_MPU_IPPR_TRNGWRP               (*((volatile unsigned int*)(0x42A80394UL)))
#define bM4_SYSREG_MPU_IPPR_CRCRDP                (*((volatile unsigned int*)(0x42A80398UL)))
#define bM4_SYSREG_MPU_IPPR_CRCWRP                (*((volatile unsigned int*)(0x42A8039CUL)))
#define bM4_SYSREG_MPU_IPPR_FMCRDP                (*((volatile unsigned int*)(0x42A803A0UL)))
#define bM4_SYSREG_MPU_IPPR_FMCWRP                (*((volatile unsigned int*)(0x42A803A4UL)))
#define bM4_SYSREG_MPU_IPPR_WDTRDP                (*((volatile unsigned int*)(0x42A803B0UL)))
#define bM4_SYSREG_MPU_IPPR_WDTWRP                (*((volatile unsigned int*)(0x42A803B4UL)))
#define bM4_SYSREG_MPU_IPPR_SWDTRDP               (*((volatile unsigned int*)(0x42A803B8UL)))
#define bM4_SYSREG_MPU_IPPR_SWDTWRP               (*((volatile unsigned int*)(0x42A803BCUL)))
#define bM4_SYSREG_MPU_IPPR_BKSRAMRDP             (*((volatile unsigned int*)(0x42A803C0UL)))
#define bM4_SYSREG_MPU_IPPR_BKSRAMWRP             (*((volatile unsigned int*)(0x42A803C4UL)))
#define bM4_SYSREG_MPU_IPPR_RTCRDP                (*((volatile unsigned int*)(0x42A803C8UL)))
#define bM4_SYSREG_MPU_IPPR_RTCWRP                (*((volatile unsigned int*)(0x42A803CCUL)))
#define bM4_SYSREG_MPU_IPPR_DMPURDP               (*((volatile unsigned int*)(0x42A803D0UL)))
#define bM4_SYSREG_MPU_IPPR_DMPUWRP               (*((volatile unsigned int*)(0x42A803D4UL)))
#define bM4_SYSREG_MPU_IPPR_SRAMCRDP              (*((volatile unsigned int*)(0x42A803D8UL)))
#define bM4_SYSREG_MPU_IPPR_SRAMCWRP              (*((volatile unsigned int*)(0x42A803DCUL)))
#define bM4_SYSREG_MPU_IPPR_INTCRDP               (*((volatile unsigned int*)(0x42A803E0UL)))
#define bM4_SYSREG_MPU_IPPR_INTCWRP               (*((volatile unsigned int*)(0x42A803E4UL)))
#define bM4_SYSREG_MPU_IPPR_SYSCRDP               (*((volatile unsigned int*)(0x42A803E8UL)))
#define bM4_SYSREG_MPU_IPPR_SYSCWRP               (*((volatile unsigned int*)(0x42A803ECUL)))
#define bM4_SYSREG_MPU_IPPR_MSTPRDP               (*((volatile unsigned int*)(0x42A803F0UL)))
#define bM4_SYSREG_MPU_IPPR_MSTPWRP               (*((volatile unsigned int*)(0x42A803F4UL)))
#define bM4_SYSREG_MPU_IPPR_BUSERRE               (*((volatile unsigned int*)(0x42A803FCUL)))
#define bM4_SYSREG_CMU_SCFGR_PCLK0S0              (*((volatile unsigned int*)(0x42A80400UL)))
#define bM4_SYSREG_CMU_SCFGR_PCLK0S1              (*((volatile unsigned int*)(0x42A80404UL)))
#define bM4_SYSREG_CMU_SCFGR_PCLK0S2              (*((volatile unsigned int*)(0x42A80408UL)))
#define bM4_SYSREG_CMU_SCFGR_PCLK1S0              (*((volatile unsigned int*)(0x42A80410UL)))
#define bM4_SYSREG_CMU_SCFGR_PCLK1S1              (*((volatile unsigned int*)(0x42A80414UL)))
#define bM4_SYSREG_CMU_SCFGR_PCLK1S2              (*((volatile unsigned int*)(0x42A80418UL)))
#define bM4_SYSREG_CMU_SCFGR_PCLK2S0              (*((volatile unsigned int*)(0x42A80420UL)))
#define bM4_SYSREG_CMU_SCFGR_PCLK2S1              (*((volatile unsigned int*)(0x42A80424UL)))
#define bM4_SYSREG_CMU_SCFGR_PCLK2S2              (*((volatile unsigned int*)(0x42A80428UL)))
#define bM4_SYSREG_CMU_SCFGR_PCLK3S0              (*((volatile unsigned int*)(0x42A80430UL)))
#define bM4_SYSREG_CMU_SCFGR_PCLK3S1              (*((volatile unsigned int*)(0x42A80434UL)))
#define bM4_SYSREG_CMU_SCFGR_PCLK3S2              (*((volatile unsigned int*)(0x42A80438UL)))
#define bM4_SYSREG_CMU_SCFGR_PCLK4S0              (*((volatile unsigned int*)(0x42A80440UL)))
#define bM4_SYSREG_CMU_SCFGR_PCLK4S1              (*((volatile unsigned int*)(0x42A80444UL)))
#define bM4_SYSREG_CMU_SCFGR_PCLK4S2              (*((volatile unsigned int*)(0x42A80448UL)))
#define bM4_SYSREG_CMU_SCFGR_EXCKS0               (*((volatile unsigned int*)(0x42A80450UL)))
#define bM4_SYSREG_CMU_SCFGR_EXCKS1               (*((volatile unsigned int*)(0x42A80454UL)))
#define bM4_SYSREG_CMU_SCFGR_EXCKS2               (*((volatile unsigned int*)(0x42A80458UL)))
#define bM4_SYSREG_CMU_SCFGR_HCLKS0               (*((volatile unsigned int*)(0x42A80460UL)))
#define bM4_SYSREG_CMU_SCFGR_HCLKS1               (*((volatile unsigned int*)(0x42A80464UL)))
#define bM4_SYSREG_CMU_SCFGR_HCLKS2               (*((volatile unsigned int*)(0x42A80468UL)))
#define bM4_SYSREG_CMU_UFSCKCFGR_USBCKS0          (*((volatile unsigned int*)(0x42A80490UL)))
#define bM4_SYSREG_CMU_UFSCKCFGR_USBCKS1          (*((volatile unsigned int*)(0x42A80494UL)))
#define bM4_SYSREG_CMU_UFSCKCFGR_USBCKS2          (*((volatile unsigned int*)(0x42A80498UL)))
#define bM4_SYSREG_CMU_UFSCKCFGR_USBCKS3          (*((volatile unsigned int*)(0x42A8049CUL)))
#define bM4_SYSREG_CMU_CKSWR_CKSW0                (*((volatile unsigned int*)(0x42A804C0UL)))
#define bM4_SYSREG_CMU_CKSWR_CKSW1                (*((volatile unsigned int*)(0x42A804C4UL)))
#define bM4_SYSREG_CMU_CKSWR_CKSW2                (*((volatile unsigned int*)(0x42A804C8UL)))
#define bM4_SYSREG_CMU_PLLCR_MPLLOFF              (*((volatile unsigned int*)(0x42A80540UL)))
#define bM4_SYSREG_CMU_UPLLCR_UPLLOFF             (*((volatile unsigned int*)(0x42A805C0UL)))
#define bM4_SYSREG_CMU_XTALCR_XTALSTP             (*((volatile unsigned int*)(0x42A80640UL)))
#define bM4_SYSREG_CMU_HRCCR_HRCSTP               (*((volatile unsigned int*)(0x42A806C0UL)))
#define bM4_SYSREG_CMU_MRCCR_MRCSTP               (*((volatile unsigned int*)(0x42A80700UL)))
#define bM4_SYSREG_CMU_OSCSTBSR_HRCSTBF           (*((volatile unsigned int*)(0x42A80780UL)))
#define bM4_SYSREG_CMU_OSCSTBSR_XTALSTBF          (*((volatile unsigned int*)(0x42A8078CUL)))
#define bM4_SYSREG_CMU_OSCSTBSR_MPLLSTBF          (*((volatile unsigned int*)(0x42A80794UL)))
#define bM4_SYSREG_CMU_OSCSTBSR_UPLLSTBF          (*((volatile unsigned int*)(0x42A80798UL)))
#define bM4_SYSREG_CMU_MCO1CFGR_MCO1SEL0          (*((volatile unsigned int*)(0x42A807A0UL)))
#define bM4_SYSREG_CMU_MCO1CFGR_MCO1SEL1          (*((volatile unsigned int*)(0x42A807A4UL)))
#define bM4_SYSREG_CMU_MCO1CFGR_MCO1SEL2          (*((volatile unsigned int*)(0x42A807A8UL)))
#define bM4_SYSREG_CMU_MCO1CFGR_MCO1SEL3          (*((volatile unsigned int*)(0x42A807ACUL)))
#define bM4_SYSREG_CMU_MCO1CFGR_MCO1DIV0          (*((volatile unsigned int*)(0x42A807B0UL)))
#define bM4_SYSREG_CMU_MCO1CFGR_MCO1DIV1          (*((volatile unsigned int*)(0x42A807B4UL)))
#define bM4_SYSREG_CMU_MCO1CFGR_MCO1DIV2          (*((volatile unsigned int*)(0x42A807B8UL)))
#define bM4_SYSREG_CMU_MCO1CFGR_MCO1EN            (*((volatile unsigned int*)(0x42A807BCUL)))
#define bM4_SYSREG_CMU_MCO2CFGR_MCO2SEL0          (*((volatile unsigned int*)(0x42A807C0UL)))
#define bM4_SYSREG_CMU_MCO2CFGR_MCO2SEL1          (*((volatile unsigned int*)(0x42A807C4UL)))
#define bM4_SYSREG_CMU_MCO2CFGR_MCO2SEL2          (*((volatile unsigned int*)(0x42A807C8UL)))
#define bM4_SYSREG_CMU_MCO2CFGR_MCO2SEL3          (*((volatile unsigned int*)(0x42A807CCUL)))
#define bM4_SYSREG_CMU_MCO2CFGR_MCO2DIV0          (*((volatile unsigned int*)(0x42A807D0UL)))
#define bM4_SYSREG_CMU_MCO2CFGR_MCO2DIV1          (*((volatile unsigned int*)(0x42A807D4UL)))
#define bM4_SYSREG_CMU_MCO2CFGR_MCO2DIV2          (*((volatile unsigned int*)(0x42A807D8UL)))
#define bM4_SYSREG_CMU_MCO2CFGR_MCO2EN            (*((volatile unsigned int*)(0x42A807DCUL)))
#define bM4_SYSREG_CMU_TPIUCKCFGR_TPIUCKS0        (*((volatile unsigned int*)(0x42A807E0UL)))
#define bM4_SYSREG_CMU_TPIUCKCFGR_TPIUCKS1        (*((volatile unsigned int*)(0x42A807E4UL)))
#define bM4_SYSREG_CMU_TPIUCKCFGR_TPIUCKOE        (*((volatile unsigned int*)(0x42A807FCUL)))
#define bM4_SYSREG_CMU_XTALSTDCR_XTALSTDIE        (*((volatile unsigned int*)(0x42A80800UL)))
#define bM4_SYSREG_CMU_XTALSTDCR_XTALSTDRE        (*((volatile unsigned int*)(0x42A80804UL)))
#define bM4_SYSREG_CMU_XTALSTDCR_XTALSTDRIS       (*((volatile unsigned int*)(0x42A80808UL)))
#define bM4_SYSREG_CMU_XTALSTDCR_XTALSTDE         (*((volatile unsigned int*)(0x42A8081CUL)))
#define bM4_SYSREG_CMU_XTALSTDSR_XTALSTDF         (*((volatile unsigned int*)(0x42A80820UL)))
#define bM4_SYSREG_CMU_XTALSTBCR_XTALSTB0         (*((volatile unsigned int*)(0x42A81440UL)))
#define bM4_SYSREG_CMU_XTALSTBCR_XTALSTB1         (*((volatile unsigned int*)(0x42A81444UL)))
#define bM4_SYSREG_CMU_XTALSTBCR_XTALSTB2         (*((volatile unsigned int*)(0x42A81448UL)))
#define bM4_SYSREG_CMU_XTALSTBCR_XTALSTB3         (*((volatile unsigned int*)(0x42A8144CUL)))
#define bM4_SYSREG_RMU_RSTF0_PORF                 (*((volatile unsigned int*)(0x42A81800UL)))
#define bM4_SYSREG_RMU_RSTF0_PINRF                (*((volatile unsigned int*)(0x42A81804UL)))
#define bM4_SYSREG_RMU_RSTF0_BORF                 (*((volatile unsigned int*)(0x42A81808UL)))
#define bM4_SYSREG_RMU_RSTF0_PVD1RF               (*((volatile unsigned int*)(0x42A8180CUL)))
#define bM4_SYSREG_RMU_RSTF0_PVD2RF               (*((volatile unsigned int*)(0x42A81810UL)))
#define bM4_SYSREG_RMU_RSTF0_WDRF                 (*((volatile unsigned int*)(0x42A81814UL)))
#define bM4_SYSREG_RMU_RSTF0_SWDRF                (*((volatile unsigned int*)(0x42A81818UL)))
#define bM4_SYSREG_RMU_RSTF0_PDRF                 (*((volatile unsigned int*)(0x42A8181CUL)))
#define bM4_SYSREG_RMU_RSTF0_SWRF                 (*((volatile unsigned int*)(0x42A81820UL)))
#define bM4_SYSREG_RMU_RSTF0_MPUERF               (*((volatile unsigned int*)(0x42A81824UL)))
#define bM4_SYSREG_RMU_RSTF0_RAPERF               (*((volatile unsigned int*)(0x42A81828UL)))
#define bM4_SYSREG_RMU_RSTF0_RAECRF               (*((volatile unsigned int*)(0x42A8182CUL)))
#define bM4_SYSREG_RMU_RSTF0_CKFERF               (*((volatile unsigned int*)(0x42A81830UL)))
#define bM4_SYSREG_RMU_RSTF0_XTALERF              (*((volatile unsigned int*)(0x42A81834UL)))
#define bM4_SYSREG_RMU_RSTF0_MULTIRF              (*((volatile unsigned int*)(0x42A81838UL)))
#define bM4_SYSREG_RMU_RSTF0_CLRF                 (*((volatile unsigned int*)(0x42A8183CUL)))
#define bM4_SYSREG_PWR_PVDICR_PVD1NMIS            (*((volatile unsigned int*)(0x42A81C00UL)))
#define bM4_SYSREG_PWR_PVDICR_PVD2NMIS            (*((volatile unsigned int*)(0x42A81C10UL)))
#define bM4_SYSREG_PWR_PVDDSR_PVD1MON             (*((volatile unsigned int*)(0x42A81C20UL)))
#define bM4_SYSREG_PWR_PVDDSR_PVD1DETFLG          (*((volatile unsigned int*)(0x42A81C24UL)))
#define bM4_SYSREG_PWR_PVDDSR_PVD2MON             (*((volatile unsigned int*)(0x42A81C30UL)))
#define bM4_SYSREG_PWR_PVDDSR_PVD2DETFLG          (*((volatile unsigned int*)(0x42A81C34UL)))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLM0             (*((volatile unsigned int*)(0x42A82000UL)))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLM1             (*((volatile unsigned int*)(0x42A82004UL)))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLM2             (*((volatile unsigned int*)(0x42A82008UL)))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLM3             (*((volatile unsigned int*)(0x42A8200CUL)))
#define bM4_SYSREG_CMU_PLLCFGR_MPLLM4             (*((volatile unsigned int*)(0x42A82010UL)))
#define bM4_SYSREG_CMU_PLLCFGR_PLLSRC             (*((volatile unsigned int*)(0x42A8201CUL)))
