SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460keua_template/common/hc32f460keua.h
#define bM4_TMR02_CNTAR_CNTA11                    (*((volatile unsigned int*)(0x4248802CUL)))
#define bM4_TMR02_CNTAR_CNTA12                    (*((volatile unsigned int*)(0x42488030UL)))
#define bM4_TMR02_CNTAR_CNTA13                    (*((volatile unsigned int*)(0x42488034UL)))
#define bM4_TMR02_CNTAR_CNTA14                    (*((volatile unsigned int*)(0x42488038UL)))
#define bM4_TMR02_CNTAR_CNTA15                    (*((volatile unsigned int*)(0x4248803CUL)))
#define bM4_TMR02_CNTBR_CNTB0                     (*((volatile unsigned int*)(0x42488080UL)))
#define bM4_TMR02_CNTBR_CNTB1                     (*((volatile unsigned int*)(0x42488084UL)))
#define bM4_TMR02_CNTBR_CNTB2                     (*((volatile unsigned int*)(0x42488088UL)))
#define bM4_TMR02_CNTBR_CNTB3                     (*((volatile unsigned int*)(0x4248808CUL)))
#define bM4_TMR02_CNTBR_CNTB4                     (*((volatile unsigned int*)(0x42488090UL)))
#define bM4_TMR02_CNTBR_CNTB5                     (*((volatile unsigned int*)(0x42488094UL)))
#define bM4_TMR02_CNTBR_CNTB6                     (*((volatile unsigned int*)(0x42488098UL)))
#define bM4_TMR02_CNTBR_CNTB7                     (*((volatile unsigned int*)(0x4248809CUL)))
#define bM4_TMR02_CNTBR_CNTB8                     (*((volatile unsigned int*)(0x424880A0UL)))
#define bM4_TMR02_CNTBR_CNTB9                     (*((volatile unsigned int*)(0x424880A4UL)))
#define bM4_TMR02_CNTBR_CNTB10                    (*((volatile unsigned int*)(0x424880A8UL)))
#define bM4_TMR02_CNTBR_CNTB11                    (*((volatile unsigned int*)(0x424880ACUL)))
#define bM4_TMR02_CNTBR_CNTB12                    (*((volatile unsigned int*)(0x424880B0UL)))
#define bM4_TMR02_CNTBR_CNTB13                    (*((volatile unsigned int*)(0x424880B4UL)))
#define bM4_TMR02_CNTBR_CNTB14                    (*((volatile unsigned int*)(0x424880B8UL)))
#define bM4_TMR02_CNTBR_CNTB15                    (*((volatile unsigned int*)(0x424880BCUL)))
#define bM4_TMR02_CMPAR_CMPA0                     (*((volatile unsigned int*)(0x42488100UL)))
#define bM4_TMR02_CMPAR_CMPA1                     (*((volatile unsigned int*)(0x42488104UL)))
#define bM4_TMR02_CMPAR_CMPA2                     (*((volatile unsigned int*)(0x42488108UL)))
#define bM4_TMR02_CMPAR_CMPA3                     (*((volatile unsigned int*)(0x4248810CUL)))
#define bM4_TMR02_CMPAR_CMPA4                     (*((volatile unsigned int*)(0x42488110UL)))
#define bM4_TMR02_CMPAR_CMPA5                     (*((volatile unsigned int*)(0x42488114UL)))
#define bM4_TMR02_CMPAR_CMPA6                     (*((volatile unsigned int*)(0x42488118UL)))
#define bM4_TMR02_CMPAR_CMPA7                     (*((volatile unsigned int*)(0x4248811CUL)))
#define bM4_TMR02_CMPAR_CMPA8                     (*((volatile unsigned int*)(0x42488120UL)))
#define bM4_TMR02_CMPAR_CMPA9                     (*((volatile unsigned int*)(0x42488124UL)))
#define bM4_TMR02_CMPAR_CMPA10                    (*((volatile unsigned int*)(0x42488128UL)))
#define bM4_TMR02_CMPAR_CMPA11                    (*((volatile unsigned int*)(0x4248812CUL)))
#define bM4_TMR02_CMPAR_CMPA12                    (*((volatile unsigned int*)(0x42488130UL)))
#define bM4_TMR02_CMPAR_CMPA13                    (*((volatile unsigned int*)(0x42488134UL)))
#define bM4_TMR02_CMPAR_CMPA14                    (*((volatile unsigned int*)(0x42488138UL)))
#define bM4_TMR02_CMPAR_CMPA15                    (*((volatile unsigned int*)(0x4248813CUL)))
#define bM4_TMR02_CMPBR_CMPB0                     (*((volatile unsigned int*)(0x42488180UL)))
#define bM4_TMR02_CMPBR_CMPB1                     (*((volatile unsigned int*)(0x42488184UL)))
#define bM4_TMR02_CMPBR_CMPB2                     (*((volatile unsigned int*)(0x42488188UL)))
#define bM4_TMR02_CMPBR_CMPB3                     (*((volatile unsigned int*)(0x4248818CUL)))
#define bM4_TMR02_CMPBR_CMPB4                     (*((volatile unsigned int*)(0x42488190UL)))
#define bM4_TMR02_CMPBR_CMPB5                     (*((volatile unsigned int*)(0x42488194UL)))
#define bM4_TMR02_CMPBR_CMPB6                     (*((volatile unsigned int*)(0x42488198UL)))
#define bM4_TMR02_CMPBR_CMPB7                     (*((volatile unsigned int*)(0x4248819CUL)))
#define bM4_TMR02_CMPBR_CMPB8                     (*((volatile unsigned int*)(0x424881A0UL)))
#define bM4_TMR02_CMPBR_CMPB9                     (*((volatile unsigned int*)(0x424881A4UL)))
#define bM4_TMR02_CMPBR_CMPB10                    (*((volatile unsigned int*)(0x424881A8UL)))
#define bM4_TMR02_CMPBR_CMPB11                    (*((volatile unsigned int*)(0x424881ACUL)))
#define bM4_TMR02_CMPBR_CMPB12                    (*((volatile unsigned int*)(0x424881B0UL)))
#define bM4_TMR02_CMPBR_CMPB13                    (*((volatile unsigned int*)(0x424881B4UL)))
#define bM4_TMR02_CMPBR_CMPB14                    (*((volatile unsigned int*)(0x424881B8UL)))
#define bM4_TMR02_CMPBR_CMPB15                    (*((volatile unsigned int*)(0x424881BCUL)))
#define bM4_TMR02_BCONR_CSTA                      (*((volatile unsigned int*)(0x42488200UL)))
#define bM4_TMR02_BCONR_CAPMDA                    (*((volatile unsigned int*)(0x42488204UL)))
#define bM4_TMR02_BCONR_INTENA                    (*((volatile unsigned int*)(0x42488208UL)))
#define bM4_TMR02_BCONR_CKDIVA0                   (*((volatile unsigned int*)(0x42488210UL)))
#define bM4_TMR02_BCONR_CKDIVA1                   (*((volatile unsigned int*)(0x42488214UL)))
#define bM4_TMR02_BCONR_CKDIVA2                   (*((volatile unsigned int*)(0x42488218UL)))
#define bM4_TMR02_BCONR_CKDIVA3                   (*((volatile unsigned int*)(0x4248821CUL)))
#define bM4_TMR02_BCONR_SYNSA                     (*((volatile unsigned int*)(0x42488220UL)))
#define bM4_TMR02_BCONR_SYNCLKA                   (*((volatile unsigned int*)(0x42488224UL)))
#define bM4_TMR02_BCONR_ASYNCLKA                  (*((volatile unsigned int*)(0x42488228UL)))
#define bM4_TMR02_BCONR_HSTAA                     (*((volatile unsigned int*)(0x42488230UL)))
#define bM4_TMR02_BCONR_HSTPA                     (*((volatile unsigned int*)(0x42488234UL)))
#define bM4_TMR02_BCONR_HCLEA                     (*((volatile unsigned int*)(0x42488238UL)))
#define bM4_TMR02_BCONR_HICPA                     (*((volatile unsigned int*)(0x4248823CUL)))
#define bM4_TMR02_BCONR_CSTB                      (*((volatile unsigned int*)(0x42488240UL)))
#define bM4_TMR02_BCONR_CAPMDB                    (*((volatile unsigned int*)(0x42488244UL)))
#define bM4_TMR02_BCONR_INTENB                    (*((volatile unsigned int*)(0x42488248UL)))
#define bM4_TMR02_BCONR_CKDIVB0                   (*((volatile unsigned int*)(0x42488250UL)))
#define bM4_TMR02_BCONR_CKDIVB1                   (*((volatile unsigned int*)(0x42488254UL)))
#define bM4_TMR02_BCONR_CKDIVB2                   (*((volatile unsigned int*)(0x42488258UL)))
#define bM4_TMR02_BCONR_CKDIVB3                   (*((volatile unsigned int*)(0x4248825CUL)))
#define bM4_TMR02_BCONR_SYNSB                     (*((volatile unsigned int*)(0x42488260UL)))
#define bM4_TMR02_BCONR_SYNCLKB                   (*((volatile unsigned int*)(0x42488264UL)))
#define bM4_TMR02_BCONR_ASYNCLKB                  (*((volatile unsigned int*)(0x42488268UL)))
#define bM4_TMR02_BCONR_HSTAB                     (*((volatile unsigned int*)(0x42488270UL)))
#define bM4_TMR02_BCONR_HSTPB                     (*((volatile unsigned int*)(0x42488274UL)))
#define bM4_TMR02_BCONR_HCLEB                     (*((volatile unsigned int*)(0x42488278UL)))
#define bM4_TMR02_BCONR_HICPB                     (*((volatile unsigned int*)(0x4248827CUL)))
#define bM4_TMR02_STFLR_CMAF                      (*((volatile unsigned int*)(0x42488280UL)))
#define bM4_TMR02_STFLR_CMBF                      (*((volatile unsigned int*)(0x424882C0UL)))
#define bM4_TMR41_OCSRU_OCEH                      (*((volatile unsigned int*)(0x422E0300UL)))
#define bM4_TMR41_OCSRU_OCEL                      (*((volatile unsigned int*)(0x422E0304UL)))
#define bM4_TMR41_OCSRU_OCPH                      (*((volatile unsigned int*)(0x422E0308UL)))
#define bM4_TMR41_OCSRU_OCPL                      (*((volatile unsigned int*)(0x422E030CUL)))
#define bM4_TMR41_OCSRU_OCIEH                     (*((volatile unsigned int*)(0x422E0310UL)))
#define bM4_TMR41_OCSRU_OCIEL                     (*((volatile unsigned int*)(0x422E0314UL)))
#define bM4_TMR41_OCSRU_OCFH                      (*((volatile unsigned int*)(0x422E0318UL)))
#define bM4_TMR41_OCSRU_OCFL                      (*((volatile unsigned int*)(0x422E031CUL)))
#define bM4_TMR41_OCERU_CHBUFEN0                  (*((volatile unsigned int*)(0x422E0340UL)))
#define bM4_TMR41_OCERU_CHBUFEN1                  (*((volatile unsigned int*)(0x422E0344UL)))
#define bM4_TMR41_OCERU_CLBUFEN0                  (*((volatile unsigned int*)(0x422E0348UL)))
#define bM4_TMR41_OCERU_CLBUFEN1                  (*((volatile unsigned int*)(0x422E034CUL)))
#define bM4_TMR41_OCERU_MHBUFEN0                  (*((volatile unsigned int*)(0x422E0350UL)))
#define bM4_TMR41_OCERU_MHBUFEN1                  (*((volatile unsigned int*)(0x422E0354UL)))
#define bM4_TMR41_OCERU_MLBUFEN0                  (*((volatile unsigned int*)(0x422E0358UL)))
#define bM4_TMR41_OCERU_MLBUFEN1                  (*((volatile unsigned int*)(0x422E035CUL)))
#define bM4_TMR41_OCERU_LMCH                      (*((volatile unsigned int*)(0x422E0360UL)))
#define bM4_TMR41_OCERU_LMCL                      (*((volatile unsigned int*)(0x422E0364UL)))
#define bM4_TMR41_OCERU_LMMH                      (*((volatile unsigned int*)(0x422E0368UL)))
#define bM4_TMR41_OCERU_LMML                      (*((volatile unsigned int*)(0x422E036CUL)))
#define bM4_TMR41_OCERU_MCECH                     (*((volatile unsigned int*)(0x422E0370UL)))
#define bM4_TMR41_OCERU_MCECL                     (*((volatile unsigned int*)(0x422E0374UL)))
#define bM4_TMR41_OCSRV_OCEH                      (*((volatile unsigned int*)(0x422E0380UL)))
#define bM4_TMR41_OCSRV_OCEL                      (*((volatile unsigned int*)(0x422E0384UL)))
#define bM4_TMR41_OCSRV_OCPH                      (*((volatile unsigned int*)(0x422E0388UL)))
#define bM4_TMR41_OCSRV_OCPL                      (*((volatile unsigned int*)(0x422E038CUL)))
#define bM4_TMR41_OCSRV_OCIEH                     (*((volatile unsigned int*)(0x422E0390UL)))
#define bM4_TMR41_OCSRV_OCIEL                     (*((volatile unsigned int*)(0x422E0394UL)))
#define bM4_TMR41_OCSRV_OCFH                      (*((volatile unsigned int*)(0x422E0398UL)))
#define bM4_TMR41_OCSRV_OCFL                      (*((volatile unsigned int*)(0x422E039CUL)))
#define bM4_TMR41_OCERV_CHBUFEN0                  (*((volatile unsigned int*)(0x422E03C0UL)))
#define bM4_TMR41_OCERV_CHBUFEN1                  (*((volatile unsigned int*)(0x422E03C4UL)))
#define bM4_TMR41_OCERV_CLBUFEN0                  (*((volatile unsigned int*)(0x422E03C8UL)))
#define bM4_TMR41_OCERV_CLBUFEN1                  (*((volatile unsigned int*)(0x422E03CCUL)))
#define bM4_TMR41_OCERV_MHBUFEN0                  (*((volatile unsigned int*)(0x422E03D0UL)))
#define bM4_TMR41_OCERV_MHBUFEN1                  (*((volatile unsigned int*)(0x422E03D4UL)))
#define bM4_TMR41_OCERV_MLBUFEN0                  (*((volatile unsigned int*)(0x422E03D8UL)))
#define bM4_TMR41_OCERV_MLBUFEN1                  (*((volatile unsigned int*)(0x422E03DCUL)))
#define bM4_TMR41_OCERV_LMCH                      (*((volatile unsigned int*)(0x422E03E0UL)))
#define bM4_TMR41_OCERV_LMCL                      (*((volatile unsigned int*)(0x422E03E4UL)))
#define bM4_TMR41_OCERV_LMMH                      (*((volatile unsigned int*)(0x422E03E8UL)))
#define bM4_TMR41_OCERV_LMML                      (*((volatile unsigned int*)(0x422E03ECUL)))
#define bM4_TMR41_OCERV_MCECH                     (*((volatile unsigned int*)(0x422E03F0UL)))
#define bM4_TMR41_OCERV_MCECL                     (*((volatile unsigned int*)(0x422E03F4UL)))
#define bM4_TMR41_OCSRW_OCEH                      (*((volatile unsigned int*)(0x422E0400UL)))
#define bM4_TMR41_OCSRW_OCEL                      (*((volatile unsigned int*)(0x422E0404UL)))
#define bM4_TMR41_OCSRW_OCPH                      (*((volatile unsigned int*)(0x422E0408UL)))
#define bM4_TMR41_OCSRW_OCPL                      (*((volatile unsigned int*)(0x422E040CUL)))
#define bM4_TMR41_OCSRW_OCIEH                     (*((volatile unsigned int*)(0x422E0410UL)))
#define bM4_TMR41_OCSRW_OCIEL                     (*((volatile unsigned int*)(0x422E0414UL)))
#define bM4_TMR41_OCSRW_OCFH                      (*((volatile unsigned int*)(0x422E0418UL)))
#define bM4_TMR41_OCSRW_OCFL                      (*((volatile unsigned int*)(0x422E041CUL)))
#define bM4_TMR41_OCERW_CHBUFEN0                  (*((volatile unsigned int*)(0x422E0440UL)))
#define bM4_TMR41_OCERW_CHBUFEN1                  (*((volatile unsigned int*)(0x422E0444UL)))
#define bM4_TMR41_OCERW_CLBUFEN0                  (*((volatile unsigned int*)(0x422E0448UL)))
#define bM4_TMR41_OCERW_CLBUFEN1                  (*((volatile unsigned int*)(0x422E044CUL)))
#define bM4_TMR41_OCERW_MHBUFEN0                  (*((volatile unsigned int*)(0x422E0450UL)))
#define bM4_TMR41_OCERW_MHBUFEN1                  (*((volatile unsigned int*)(0x422E0454UL)))
#define bM4_TMR41_OCERW_MLBUFEN0                  (*((volatile unsigned int*)(0x422E0458UL)))
#define bM4_TMR41_OCERW_MLBUFEN1                  (*((volatile unsigned int*)(0x422E045CUL)))
#define bM4_TMR41_OCERW_LMCH                      (*((volatile unsigned int*)(0x422E0460UL)))
#define bM4_TMR41_OCERW_LMCL                      (*((volatile unsigned int*)(0x422E0464UL)))
#define bM4_TMR41_OCERW_LMMH                      (*((volatile unsigned int*)(0x422E0468UL)))
#define bM4_TMR41_OCERW_LMML                      (*((volatile unsigned int*)(0x422E046CUL)))
#define bM4_TMR41_OCERW_MCECH                     (*((volatile unsigned int*)(0x422E0470UL)))
#define bM4_TMR41_OCERW_MCECL                     (*((volatile unsigned int*)(0x422E0474UL)))
#define bM4_TMR41_OCMRHUH_OCFDCH                  (*((volatile unsigned int*)(0x422E0480UL)))
#define bM4_TMR41_OCMRHUH_OCFPKH                  (*((volatile unsigned int*)(0x422E0484UL)))
#define bM4_TMR41_OCMRHUH_OCFUCH                  (*((volatile unsigned int*)(0x422E0488UL)))
#define bM4_TMR41_OCMRHUH_OCFZRH                  (*((volatile unsigned int*)(0x422E048CUL)))
#define bM4_TMR41_OCMRHUH_OPDCH0                  (*((volatile unsigned int*)(0x422E0490UL)))
#define bM4_TMR41_OCMRHUH_OPDCH1                  (*((volatile unsigned int*)(0x422E0494UL)))
#define bM4_TMR41_OCMRHUH_OPPKH0                  (*((volatile unsigned int*)(0x422E0498UL)))
#define bM4_TMR41_OCMRHUH_OPPKH1                  (*((volatile unsigned int*)(0x422E049CUL)))
#define bM4_TMR41_OCMRHUH_OPUCH0                  (*((volatile unsigned int*)(0x422E04A0UL)))
#define bM4_TMR41_OCMRHUH_OPUCH1                  (*((volatile unsigned int*)(0x422E04A4UL)))
#define bM4_TMR41_OCMRHUH_OPZRH0                  (*((volatile unsigned int*)(0x422E04A8UL)))
#define bM4_TMR41_OCMRHUH_OPZRH1                  (*((volatile unsigned int*)(0x422E04ACUL)))
#define bM4_TMR41_OCMRHUH_OPNPKH0                 (*((volatile unsigned int*)(0x422E04B0UL)))
#define bM4_TMR41_OCMRHUH_OPNPKH1                 (*((volatile unsigned int*)(0x422E04B4UL)))
#define bM4_TMR41_OCMRHUH_OPNZRH0                 (*((volatile unsigned int*)(0x422E04B8UL)))
#define bM4_TMR41_OCMRHUH_OPNZRH1                 (*((volatile unsigned int*)(0x422E04BCUL)))
#define bM4_TMR41_OCMRLUL_OCFDCL                  (*((volatile unsigned int*)(0x422E0500UL)))
#define bM4_TMR41_OCMRLUL_OCFPKL                  (*((volatile unsigned int*)(0x422E0504UL)))
#define bM4_TMR41_OCMRLUL_OCFUCL                  (*((volatile unsigned int*)(0x422E0508UL)))
#define bM4_TMR41_OCMRLUL_OCFZRL                  (*((volatile unsigned int*)(0x422E050CUL)))
#define bM4_TMR41_OCMRLUL_OPDCL0                  (*((volatile unsigned int*)(0x422E0510UL)))
#define bM4_TMR41_OCMRLUL_OPDCL1                  (*((volatile unsigned int*)(0x422E0514UL)))
#define bM4_TMR41_OCMRLUL_OPPKL0                  (*((volatile unsigned int*)(0x422E0518UL)))
#define bM4_TMR41_OCMRLUL_OPPKL1                  (*((volatile unsigned int*)(0x422E051CUL)))
#define bM4_TMR41_OCMRLUL_OPUCL0                  (*((volatile unsigned int*)(0x422E0520UL)))
#define bM4_TMR41_OCMRLUL_OPUCL1                  (*((volatile unsigned int*)(0x422E0524UL)))
#define bM4_TMR41_OCMRLUL_OPZRL0                  (*((volatile unsigned int*)(0x422E0528UL)))
#define bM4_TMR41_OCMRLUL_OPZRL1                  (*((volatile unsigned int*)(0x422E052CUL)))
#define bM4_TMR41_OCMRLUL_OPNPKL0                 (*((volatile unsigned int*)(0x422E0530UL)))
#define bM4_TMR41_OCMRLUL_OPNPKL1                 (*((volatile unsigned int*)(0x422E0534UL)))
#define bM4_TMR41_OCMRLUL_OPNZRL0                 (*((volatile unsigned int*)(0x422E0538UL)))
#define bM4_TMR41_OCMRLUL_OPNZRL1                 (*((volatile unsigned int*)(0x422E053CUL)))
#define bM4_TMR41_OCMRLUL_EOPNDCL0                (*((volatile unsigned int*)(0x422E0540UL)))
#define bM4_TMR41_OCMRLUL_EOPNDCL1                (*((volatile unsigned int*)(0x422E0544UL)))
#define bM4_TMR41_OCMRLUL_EOPNUCL0                (*((volatile unsigned int*)(0x422E0548UL)))
#define bM4_TMR41_OCMRLUL_EOPNUCL1                (*((volatile unsigned int*)(0x422E054CUL)))
#define bM4_TMR41_OCMRLUL_EOPDCL0                 (*((volatile unsigned int*)(0x422E0550UL)))
#define bM4_TMR41_OCMRLUL_EOPDCL1                 (*((volatile unsigned int*)(0x422E0554UL)))
#define bM4_TMR41_OCMRLUL_EOPPKL0                 (*((volatile unsigned int*)(0x422E0558UL)))
#define bM4_TMR41_OCMRLUL_EOPPKL1                 (*((volatile unsigned int*)(0x422E055CUL)))
#define bM4_TMR41_OCMRLUL_EOPUCL0                 (*((volatile unsigned int*)(0x422E0560UL)))
#define bM4_TMR41_OCMRLUL_EOPUCL1                 (*((volatile unsigned int*)(0x422E0564UL)))
#define bM4_TMR41_OCMRLUL_EOPZRL0                 (*((volatile unsigned int*)(0x422E0568UL)))
#define bM4_TMR41_OCMRLUL_EOPZRL1                 (*((volatile unsigned int*)(0x422E056CUL)))
#define bM4_TMR41_OCMRLUL_EOPNPKL0                (*((volatile unsigned int*)(0x422E0570UL)))
#define bM4_TMR41_OCMRLUL_EOPNPKL1                (*((volatile unsigned int*)(0x422E0574UL)))
#define bM4_TMR41_OCMRLUL_EOPNZRL0                (*((volatile unsigned int*)(0x422E0578UL)))
#define bM4_TMR41_OCMRLUL_EOPNZRL1                (*((volatile unsigned int*)(0x422E057CUL)))
#define bM4_TMR41_OCMRHVH_OCFDCH                  (*((volatile unsigned int*)(0x422E0580UL)))
#define bM4_TMR41_OCMRHVH_OCFPKH                  (*((volatile unsigned int*)(0x422E0584UL)))
#define bM4_TMR41_OCMRHVH_OCFUCH                  (*((volatile unsigned int*)(0x422E0588UL)))
#define bM4_TMR41_OCMRHVH_OCFZRH                  (*((volatile unsigned int*)(0x422E058CUL)))
#define bM4_TMR41_OCMRHVH_OPDCH0                  (*((volatile unsigned int*)(0x422E0590UL)))
#define bM4_TMR41_OCMRHVH_OPDCH1                  (*((volatile unsigned int*)(0x422E0594UL)))
#define bM4_TMR41_OCMRHVH_OPPKH0                  (*((volatile unsigned int*)(0x422E0598UL)))
#define bM4_TMR41_OCMRHVH_OPPKH1                  (*((volatile unsigned int*)(0x422E059CUL)))
#define bM4_TMR41_OCMRHVH_OPUCH0                  (*((volatile unsigned int*)(0x422E05A0UL)))
#define bM4_TMR41_OCMRHVH_OPUCH1                  (*((volatile unsigned int*)(0x422E05A4UL)))
#define bM4_TMR41_OCMRHVH_OPZRH0                  (*((volatile unsigned int*)(0x422E05A8UL)))
#define bM4_TMR41_OCMRHVH_OPZRH1                  (*((volatile unsigned int*)(0x422E05ACUL)))
#define bM4_TMR41_OCMRHVH_OPNPKH0                 (*((volatile unsigned int*)(0x422E05B0UL)))
#define bM4_TMR41_OCMRHVH_OPNPKH1                 (*((volatile unsigned int*)(0x422E05B4UL)))
#define bM4_TMR41_OCMRHVH_OPNZRH0                 (*((volatile unsigned int*)(0x422E05B8UL)))
#define bM4_TMR41_OCMRHVH_OPNZRH1                 (*((volatile unsigned int*)(0x422E05BCUL)))
#define bM4_TMR41_OCMRLVL_OCFDCL                  (*((volatile unsigned int*)(0x422E0600UL)))
#define bM4_TMR41_OCMRLVL_OCFPKL                  (*((volatile unsigned int*)(0x422E0604UL)))
#define bM4_TMR41_OCMRLVL_OCFUCL                  (*((volatile unsigned int*)(0x422E0608UL)))
#define bM4_TMR41_OCMRLVL_OCFZRL                  (*((volatile unsigned int*)(0x422E060CUL)))
#define bM4_TMR41_OCMRLVL_OPDCL0                  (*((volatile unsigned int*)(0x422E0610UL)))
#define bM4_TMR41_OCMRLVL_OPDCL1                  (*((volatile unsigned int*)(0x422E0614UL)))
#define bM4_TMR41_OCMRLVL_OPPKL0                  (*((volatile unsigned int*)(0x422E0618UL)))
#define bM4_TMR41_OCMRLVL_OPPKL1                  (*((volatile unsigned int*)(0x422E061CUL)))
#define bM4_TMR41_OCMRLVL_OPUCL0                  (*((volatile unsigned int*)(0x422E0620UL)))
#define bM4_TMR41_OCMRLVL_OPUCL1                  (*((volatile unsigned int*)(0x422E0624UL)))
#define bM4_TMR41_OCMRLVL_OPZRL0                  (*((volatile unsigned int*)(0x422E0628UL)))
#define bM4_TMR41_OCMRLVL_OPZRL1                  (*((volatile unsigned int*)(0x422E062CUL)))
#define bM4_TMR41_OCMRLVL_OPNPKL0                 (*((volatile unsigned int*)(0x422E0630UL)))
#define bM4_TMR41_OCMRLVL_OPNPKL1                 (*((volatile unsigned int*)(0x422E0634UL)))
#define bM4_TMR41_OCMRLVL_OPNZRL0                 (*((volatile unsigned int*)(0x422E0638UL)))
#define bM4_TMR41_OCMRLVL_OPNZRL1                 (*((volatile unsigned int*)(0x422E063CUL)))
#define bM4_TMR41_OCMRLVL_EOPNDCL0                (*((volatile unsigned int*)(0x422E0640UL)))
#define bM4_TMR41_OCMRLVL_EOPNDCL1                (*((volatile unsigned int*)(0x422E0644UL)))
#define bM4_TMR41_OCMRLVL_EOPNUCL0                (*((volatile unsigned int*)(0x422E0648UL)))
#define bM4_TMR41_OCMRLVL_EOPNUCL1                (*((volatile unsigned int*)(0x422E064CUL)))
#define bM4_TMR41_OCMRLVL_EOPDCL0                 (*((volatile unsigned int*)(0x422E0650UL)))
#define bM4_TMR41_OCMRLVL_EOPDCL1                 (*((volatile unsigned int*)(0x422E0654UL)))
#define bM4_TMR41_OCMRLVL_EOPPKL0                 (*((volatile unsigned int*)(0x422E0658UL)))
#define bM4_TMR41_OCMRLVL_EOPPKL1                 (*((volatile unsigned int*)(0x422E065CUL)))
#define bM4_TMR41_OCMRLVL_EOPUCL0                 (*((volatile unsigned int*)(0x422E0660UL)))
#define bM4_TMR41_OCMRLVL_EOPUCL1                 (*((volatile unsigned int*)(0x422E0664UL)))
#define bM4_TMR41_OCMRLVL_EOPZRL0                 (*((volatile unsigned int*)(0x422E0668UL)))
#define bM4_TMR41_OCMRLVL_EOPZRL1                 (*((volatile unsigned int*)(0x422E066CUL)))
#define bM4_TMR41_OCMRLVL_EOPNPKL0                (*((volatile unsigned int*)(0x422E0670UL)))
#define bM4_TMR41_OCMRLVL_EOPNPKL1                (*((volatile unsigned int*)(0x422E0674UL)))
#define bM4_TMR41_OCMRLVL_EOPNZRL0                (*((volatile unsigned int*)(0x422E0678UL)))
#define bM4_TMR41_OCMRLVL_EOPNZRL1                (*((volatile unsigned int*)(0x422E067CUL)))
#define bM4_TMR41_OCMRHWH_OCFDCH                  (*((volatile unsigned int*)(0x422E0680UL)))
#define bM4_TMR41_OCMRHWH_OCFPKH                  (*((volatile unsigned int*)(0x422E0684UL)))
#define bM4_TMR41_OCMRHWH_OCFUCH                  (*((volatile unsigned int*)(0x422E0688UL)))
#define bM4_TMR41_OCMRHWH_OCFZRH                  (*((volatile unsigned int*)(0x422E068CUL)))
#define bM4_TMR41_OCMRHWH_OPDCH0                  (*((volatile unsigned int*)(0x422E0690UL)))
#define bM4_TMR41_OCMRHWH_OPDCH1                  (*((volatile unsigned int*)(0x422E0694UL)))
#define bM4_TMR41_OCMRHWH_OPPKH0                  (*((volatile unsigned int*)(0x422E0698UL)))
#define bM4_TMR41_OCMRHWH_OPPKH1                  (*((volatile unsigned int*)(0x422E069CUL)))
#define bM4_TMR41_OCMRHWH_OPUCH0                  (*((volatile unsigned int*)(0x422E06A0UL)))
#define bM4_TMR41_OCMRHWH_OPUCH1                  (*((volatile unsigned int*)(0x422E06A4UL)))
