SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460keua_template/common/hc32f460keua.h
#define bM4_TMRA2_CMPAR7_CMP4                     (*((volatile unsigned int*)(0x422A8B10UL)))
#define bM4_TMRA2_CMPAR7_CMP5                     (*((volatile unsigned int*)(0x422A8B14UL)))
#define bM4_TMRA2_CMPAR7_CMP6                     (*((volatile unsigned int*)(0x422A8B18UL)))
#define bM4_TMRA2_CMPAR7_CMP7                     (*((volatile unsigned int*)(0x422A8B1CUL)))
#define bM4_TMRA2_CMPAR7_CMP8                     (*((volatile unsigned int*)(0x422A8B20UL)))
#define bM4_TMRA2_CMPAR7_CMP9                     (*((volatile unsigned int*)(0x422A8B24UL)))
#define bM4_TMRA2_CMPAR7_CMP10                    (*((volatile unsigned int*)(0x422A8B28UL)))
#define bM4_TMRA2_CMPAR7_CMP11                    (*((volatile unsigned int*)(0x422A8B2CUL)))
#define bM4_TMRA2_CMPAR7_CMP12                    (*((volatile unsigned int*)(0x422A8B30UL)))
#define bM4_TMRA2_CMPAR7_CMP13                    (*((volatile unsigned int*)(0x422A8B34UL)))
#define bM4_TMRA2_CMPAR7_CMP14                    (*((volatile unsigned int*)(0x422A8B38UL)))
#define bM4_TMRA2_CMPAR7_CMP15                    (*((volatile unsigned int*)(0x422A8B3CUL)))
#define bM4_TMRA2_CMPAR8_CMP0                     (*((volatile unsigned int*)(0x422A8B80UL)))
#define bM4_TMRA2_CMPAR8_CMP1                     (*((volatile unsigned int*)(0x422A8B84UL)))
#define bM4_TMRA2_CMPAR8_CMP2                     (*((volatile unsigned int*)(0x422A8B88UL)))
#define bM4_TMRA2_CMPAR8_CMP3                     (*((volatile unsigned int*)(0x422A8B8CUL)))
#define bM4_TMRA2_CMPAR8_CMP4                     (*((volatile unsigned int*)(0x422A8B90UL)))
#define bM4_TMRA2_CMPAR8_CMP5                     (*((volatile unsigned int*)(0x422A8B94UL)))
#define bM4_TMRA2_CMPAR8_CMP6                     (*((volatile unsigned int*)(0x422A8B98UL)))
#define bM4_TMRA2_CMPAR8_CMP7                     (*((volatile unsigned int*)(0x422A8B9CUL)))
#define bM4_TMRA2_CMPAR8_CMP8                     (*((volatile unsigned int*)(0x422A8BA0UL)))
#define bM4_TMRA2_CMPAR8_CMP9                     (*((volatile unsigned int*)(0x422A8BA4UL)))
#define bM4_TMRA2_CMPAR8_CMP10                    (*((volatile unsigned int*)(0x422A8BA8UL)))
#define bM4_TMRA2_CMPAR8_CMP11                    (*((volatile unsigned int*)(0x422A8BACUL)))
#define bM4_TMRA2_CMPAR8_CMP12                    (*((volatile unsigned int*)(0x422A8BB0UL)))
#define bM4_TMRA2_CMPAR8_CMP13                    (*((volatile unsigned int*)(0x422A8BB4UL)))
#define bM4_TMRA2_CMPAR8_CMP14                    (*((volatile unsigned int*)(0x422A8BB8UL)))
#define bM4_TMRA2_CMPAR8_CMP15                    (*((volatile unsigned int*)(0x422A8BBCUL)))
#define bM4_TMRA2_BCSTR_START                     (*((volatile unsigned int*)(0x422A9000UL)))
#define bM4_TMRA2_BCSTR_DIR                       (*((volatile unsigned int*)(0x422A9004UL)))
#define bM4_TMRA2_BCSTR_MODE                      (*((volatile unsigned int*)(0x422A9008UL)))
#define bM4_TMRA2_BCSTR_SYNST                     (*((volatile unsigned int*)(0x422A900CUL)))
#define bM4_TMRA2_BCSTR_CKDIV0                    (*((volatile unsigned int*)(0x422A9010UL)))
#define bM4_TMRA2_BCSTR_CKDIV1                    (*((volatile unsigned int*)(0x422A9014UL)))
#define bM4_TMRA2_BCSTR_CKDIV2                    (*((volatile unsigned int*)(0x422A9018UL)))
#define bM4_TMRA2_BCSTR_CKDIV3                    (*((volatile unsigned int*)(0x422A901CUL)))
#define bM4_TMRA2_BCSTR_ITENOVF                   (*((volatile unsigned int*)(0x422A9030UL)))
#define bM4_TMRA2_BCSTR_ITENUDF                   (*((volatile unsigned int*)(0x422A9034UL)))
#define bM4_TMRA2_BCSTR_OVFF                      (*((volatile unsigned int*)(0x422A9038UL)))
#define bM4_TMRA2_BCSTR_UDFF                      (*((volatile unsigned int*)(0x422A903CUL)))
#define bM4_TMRA2_HCONR_HSTA0                     (*((volatile unsigned int*)(0x422A9080UL)))
#define bM4_TMRA2_HCONR_HSTA1                     (*((volatile unsigned int*)(0x422A9084UL)))
#define bM4_TMRA2_HCONR_HSTA2                     (*((volatile unsigned int*)(0x422A9088UL)))
#define bM4_TMRA2_HCONR_HSTP0                     (*((volatile unsigned int*)(0x422A9090UL)))
#define bM4_TMRA2_HCONR_HSTP1                     (*((volatile unsigned int*)(0x422A9094UL)))
#define bM4_TMRA2_HCONR_HSTP2                     (*((volatile unsigned int*)(0x422A9098UL)))
#define bM4_TMRA2_HCONR_HCLE0                     (*((volatile unsigned int*)(0x422A90A0UL)))
#define bM4_TMRA2_HCONR_HCLE1                     (*((volatile unsigned int*)(0x422A90A4UL)))
#define bM4_TMRA2_HCONR_HCLE2                     (*((volatile unsigned int*)(0x422A90A8UL)))
#define bM4_TMRA2_HCONR_HCLE3                     (*((volatile unsigned int*)(0x422A90B0UL)))
#define bM4_TMRA2_HCONR_HCLE4                     (*((volatile unsigned int*)(0x422A90B4UL)))
#define bM4_TMRA2_HCONR_HCLE5                     (*((volatile unsigned int*)(0x422A90B8UL)))
#define bM4_TMRA2_HCONR_HCLE6                     (*((volatile unsigned int*)(0x422A90BCUL)))
#define bM4_TMRA2_HCUPR_HCUP0                     (*((volatile unsigned int*)(0x422A9100UL)))
#define bM4_TMRA2_HCUPR_HCUP1                     (*((volatile unsigned int*)(0x422A9104UL)))
#define bM4_TMRA2_HCUPR_HCUP2                     (*((volatile unsigned int*)(0x422A9108UL)))
#define bM4_TMRA2_HCUPR_HCUP3                     (*((volatile unsigned int*)(0x422A910CUL)))
#define bM4_TMRA2_HCUPR_HCUP4                     (*((volatile unsigned int*)(0x422A9110UL)))
#define bM4_TMRA2_HCUPR_HCUP5                     (*((volatile unsigned int*)(0x422A9114UL)))
#define bM4_TMRA2_HCUPR_HCUP6                     (*((volatile unsigned int*)(0x422A9118UL)))
#define bM4_TMRA2_HCUPR_HCUP7                     (*((volatile unsigned int*)(0x422A911CUL)))
#define bM4_TMRA2_HCUPR_HCUP8                     (*((volatile unsigned int*)(0x422A9120UL)))
#define bM4_TMRA2_HCUPR_HCUP9                     (*((volatile unsigned int*)(0x422A9124UL)))
#define bM4_TMRA2_HCUPR_HCUP10                    (*((volatile unsigned int*)(0x422A9128UL)))
#define bM4_TMRA2_HCUPR_HCUP11                    (*((volatile unsigned int*)(0x422A912CUL)))
#define bM4_TMRA2_HCUPR_HCUP12                    (*((volatile unsigned int*)(0x422A9130UL)))
#define bM4_TMRA2_HCDOR_HCDO0                     (*((volatile unsigned int*)(0x422A9180UL)))
#define bM4_TMRA2_HCDOR_HCDO1                     (*((volatile unsigned int*)(0x422A9184UL)))
#define bM4_TMRA2_HCDOR_HCDO2                     (*((volatile unsigned int*)(0x422A9188UL)))
#define bM4_TMRA2_HCDOR_HCDO3                     (*((volatile unsigned int*)(0x422A918CUL)))
#define bM4_TMRA2_HCDOR_HCDO4                     (*((volatile unsigned int*)(0x422A9190UL)))
#define bM4_TMRA2_HCDOR_HCDO5                     (*((volatile unsigned int*)(0x422A9194UL)))
#define bM4_TMRA2_HCDOR_HCDO6                     (*((volatile unsigned int*)(0x422A9198UL)))
#define bM4_TMRA2_HCDOR_HCDO7                     (*((volatile unsigned int*)(0x422A919CUL)))
#define bM4_TMRA2_HCDOR_HCDO8                     (*((volatile unsigned int*)(0x422A91A0UL)))
#define bM4_TMRA2_HCDOR_HCDO9                     (*((volatile unsigned int*)(0x422A91A4UL)))
#define bM4_TMRA2_HCDOR_HCDO10                    (*((volatile unsigned int*)(0x422A91A8UL)))
#define bM4_TMRA2_HCDOR_HCDO11                    (*((volatile unsigned int*)(0x422A91ACUL)))
#define bM4_TMRA2_HCDOR_HCDO12                    (*((volatile unsigned int*)(0x422A91B0UL)))
#define bM4_TMRA2_ICONR_ITEN1                     (*((volatile unsigned int*)(0x422A9200UL)))
#define bM4_TMRA2_ICONR_ITEN2                     (*((volatile unsigned int*)(0x422A9204UL)))
#define bM4_TMRA2_ICONR_ITEN3                     (*((volatile unsigned int*)(0x422A9208UL)))
#define bM4_TMRA2_ICONR_ITEN4                     (*((volatile unsigned int*)(0x422A920CUL)))
#define bM4_TMRA2_ICONR_ITEN5                     (*((volatile unsigned int*)(0x422A9210UL)))
#define bM4_TMRA2_ICONR_ITEN6                     (*((volatile unsigned int*)(0x422A9214UL)))
#define bM4_TMRA2_ICONR_ITEN7                     (*((volatile unsigned int*)(0x422A9218UL)))
#define bM4_TMRA2_ICONR_ITEN8                     (*((volatile unsigned int*)(0x422A921CUL)))
#define bM4_TMRA2_ECONR_ETEN1                     (*((volatile unsigned int*)(0x422A9280UL)))
#define bM4_TMRA2_ECONR_ETEN2                     (*((volatile unsigned int*)(0x422A9284UL)))
#define bM4_TMRA2_ECONR_ETEN3                     (*((volatile unsigned int*)(0x422A9288UL)))
#define bM4_TMRA2_ECONR_ETEN4                     (*((volatile unsigned int*)(0x422A928CUL)))
#define bM4_TMRA2_ECONR_ETEN5                     (*((volatile unsigned int*)(0x422A9290UL)))
#define bM4_TMRA2_ECONR_ETEN6                     (*((volatile unsigned int*)(0x422A9294UL)))
#define bM4_TMRA2_ECONR_ETEN7                     (*((volatile unsigned int*)(0x422A9298UL)))
#define bM4_TMRA2_ECONR_ETEN8                     (*((volatile unsigned int*)(0x422A929CUL)))
#define bM4_TMRA2_FCONR_NOFIENTG                  (*((volatile unsigned int*)(0x422A9300UL)))
#define bM4_TMRA2_FCONR_NOFICKTG0                 (*((volatile unsigned int*)(0x422A9304UL)))
#define bM4_TMRA2_FCONR_NOFICKTG1                 (*((volatile unsigned int*)(0x422A9308UL)))
#define bM4_TMRA2_FCONR_NOFIENCA                  (*((volatile unsigned int*)(0x422A9320UL)))
#define bM4_TMRA2_FCONR_NOFICKCA0                 (*((volatile unsigned int*)(0x422A9324UL)))
#define bM4_TMRA2_FCONR_NOFICKCA1                 (*((volatile unsigned int*)(0x422A9328UL)))
#define bM4_TMRA2_FCONR_NOFIENCB                  (*((volatile unsigned int*)(0x422A9330UL)))
#define bM4_TMRA2_FCONR_NOFICKCB0                 (*((volatile unsigned int*)(0x422A9334UL)))
#define bM4_TMRA2_FCONR_NOFICKCB1                 (*((volatile unsigned int*)(0x422A9338UL)))
#define bM4_TMRA2_STFLR_CMPF1                     (*((volatile unsigned int*)(0x422A9380UL)))
#define bM4_TMRA2_STFLR_CMPF2                     (*((volatile unsigned int*)(0x422A9384UL)))
#define bM4_TMRA2_STFLR_CMPF3                     (*((volatile unsigned int*)(0x422A9388UL)))
#define bM4_TMRA2_STFLR_CMPF4                     (*((volatile unsigned int*)(0x422A938CUL)))
#define bM4_TMRA2_STFLR_CMPF5                     (*((volatile unsigned int*)(0x422A9390UL)))
#define bM4_TMRA2_STFLR_CMPF6                     (*((volatile unsigned int*)(0x422A9394UL)))
#define bM4_TMRA2_STFLR_CMPF7                     (*((volatile unsigned int*)(0x422A9398UL)))
#define bM4_TMRA2_STFLR_CMPF8                     (*((volatile unsigned int*)(0x422A939CUL)))
#define bM4_TMRA2_BCONR1_BEN                      (*((volatile unsigned int*)(0x422A9800UL)))
#define bM4_TMRA2_BCONR1_BSE0                     (*((volatile unsigned int*)(0x422A9804UL)))
#define bM4_TMRA2_BCONR1_BSE1                     (*((volatile unsigned int*)(0x422A9808UL)))
#define bM4_TMRA2_BCONR2_BEN                      (*((volatile unsigned int*)(0x422A9900UL)))
#define bM4_TMRA2_BCONR2_BSE0                     (*((volatile unsigned int*)(0x422A9904UL)))
#define bM4_TMRA2_BCONR2_BSE1                     (*((volatile unsigned int*)(0x422A9908UL)))
#define bM4_TMRA2_BCONR3_BEN                      (*((volatile unsigned int*)(0x422A9A00UL)))
#define bM4_TMRA2_BCONR3_BSE0                     (*((volatile unsigned int*)(0x422A9A04UL)))
#define bM4_TMRA2_BCONR3_BSE1                     (*((volatile unsigned int*)(0x422A9A08UL)))
#define bM4_TMRA2_BCONR4_BEN                      (*((volatile unsigned int*)(0x422A9B00UL)))
#define bM4_TMRA2_BCONR4_BSE0                     (*((volatile unsigned int*)(0x422A9B04UL)))
#define bM4_TMRA2_BCONR4_BSE1                     (*((volatile unsigned int*)(0x422A9B08UL)))
#define bM4_TMRA2_CCONR1_CAPMD                    (*((volatile unsigned int*)(0x422AA000UL)))
#define bM4_TMRA2_CCONR1_HICP0                    (*((volatile unsigned int*)(0x422AA010UL)))
#define bM4_TMRA2_CCONR1_HICP1                    (*((volatile unsigned int*)(0x422AA014UL)))
#define bM4_TMRA2_CCONR1_HICP2                    (*((volatile unsigned int*)(0x422AA018UL)))
#define bM4_TMRA2_CCONR1_HICP3                    (*((volatile unsigned int*)(0x422AA020UL)))
#define bM4_TMRA2_CCONR1_HICP4                    (*((volatile unsigned int*)(0x422AA024UL)))
#define bM4_TMRA2_CCONR1_NOFIENCP                 (*((volatile unsigned int*)(0x422AA030UL)))
#define bM4_TMRA2_CCONR1_NOFICKCP0                (*((volatile unsigned int*)(0x422AA034UL)))
#define bM4_TMRA2_CCONR1_NOFICKCP1                (*((volatile unsigned int*)(0x422AA038UL)))
#define bM4_TMRA2_CCONR2_CAPMD                    (*((volatile unsigned int*)(0x422AA080UL)))
#define bM4_TMRA2_CCONR2_HICP0                    (*((volatile unsigned int*)(0x422AA090UL)))
#define bM4_TMRA2_CCONR2_HICP1                    (*((volatile unsigned int*)(0x422AA094UL)))
#define bM4_TMRA2_CCONR2_HICP2                    (*((volatile unsigned int*)(0x422AA098UL)))
#define bM4_TMRA2_CCONR2_HICP3                    (*((volatile unsigned int*)(0x422AA0A0UL)))
#define bM4_TMRA2_CCONR2_HICP4                    (*((volatile unsigned int*)(0x422AA0A4UL)))
#define bM4_TMRA2_CCONR2_NOFIENCP                 (*((volatile unsigned int*)(0x422AA0B0UL)))
#define bM4_TMRA2_CCONR2_NOFICKCP0                (*((volatile unsigned int*)(0x422AA0B4UL)))
#define bM4_TMRA2_CCONR2_NOFICKCP1                (*((volatile unsigned int*)(0x422AA0B8UL)))
#define bM4_TMRA2_CCONR3_CAPMD                    (*((volatile unsigned int*)(0x422AA100UL)))
#define bM4_TMRA2_CCONR3_HICP0                    (*((volatile unsigned int*)(0x422AA110UL)))
#define bM4_TMRA2_CCONR3_HICP1                    (*((volatile unsigned int*)(0x422AA114UL)))
#define bM4_TMRA2_CCONR3_HICP2                    (*((volatile unsigned int*)(0x422AA118UL)))
#define bM4_TMRA2_CCONR3_HICP3                    (*((volatile unsigned int*)(0x422AA120UL)))
#define bM4_TMRA2_CCONR3_HICP4                    (*((volatile unsigned int*)(0x422AA124UL)))
#define bM4_TMRA2_CCONR3_NOFIENCP                 (*((volatile unsigned int*)(0x422AA130UL)))
#define bM4_TMRA2_CCONR3_NOFICKCP0                (*((volatile unsigned int*)(0x422AA134UL)))
#define bM4_TMRA2_CCONR3_NOFICKCP1                (*((volatile unsigned int*)(0x422AA138UL)))
#define bM4_TMRA2_CCONR4_CAPMD                    (*((volatile unsigned int*)(0x422AA180UL)))
#define bM4_TMRA2_CCONR4_HICP0                    (*((volatile unsigned int*)(0x422AA190UL)))
#define bM4_TMRA2_CCONR4_HICP1                    (*((volatile unsigned int*)(0x422AA194UL)))
#define bM4_TMRA2_CCONR4_HICP2                    (*((volatile unsigned int*)(0x422AA198UL)))
#define bM4_TMRA2_CCONR4_HICP3                    (*((volatile unsigned int*)(0x422AA1A0UL)))
#define bM4_TMRA2_CCONR4_HICP4                    (*((volatile unsigned int*)(0x422AA1A4UL)))
#define bM4_TMRA2_CCONR4_NOFIENCP                 (*((volatile unsigned int*)(0x422AA1B0UL)))
#define bM4_TMRA2_CCONR4_NOFICKCP0                (*((volatile unsigned int*)(0x422AA1B4UL)))
#define bM4_TMRA2_CCONR4_NOFICKCP1                (*((volatile unsigned int*)(0x422AA1B8UL)))
#define bM4_TMRA2_CCONR5_CAPMD                    (*((volatile unsigned int*)(0x422AA200UL)))
#define bM4_TMRA2_CCONR5_HICP0                    (*((volatile unsigned int*)(0x422AA210UL)))
#define bM4_TMRA2_CCONR5_HICP1                    (*((volatile unsigned int*)(0x422AA214UL)))
#define bM4_TMRA2_CCONR5_HICP2                    (*((volatile unsigned int*)(0x422AA218UL)))
#define bM4_TMRA2_CCONR5_HICP3                    (*((volatile unsigned int*)(0x422AA220UL)))
#define bM4_TMRA2_CCONR5_HICP4                    (*((volatile unsigned int*)(0x422AA224UL)))
#define bM4_TMRA2_CCONR5_NOFIENCP                 (*((volatile unsigned int*)(0x422AA230UL)))
#define bM4_TMRA2_CCONR5_NOFICKCP0                (*((volatile unsigned int*)(0x422AA234UL)))
#define bM4_TMRA2_CCONR5_NOFICKCP1                (*((volatile unsigned int*)(0x422AA238UL)))
#define bM4_TMRA2_CCONR6_CAPMD                    (*((volatile unsigned int*)(0x422AA280UL)))
#define bM4_TMRA2_CCONR6_HICP0                    (*((volatile unsigned int*)(0x422AA290UL)))
#define bM4_TMRA2_CCONR6_HICP1                    (*((volatile unsigned int*)(0x422AA294UL)))
#define bM4_TMRA2_CCONR6_HICP2                    (*((volatile unsigned int*)(0x422AA298UL)))
#define bM4_TMRA2_CCONR6_HICP3                    (*((volatile unsigned int*)(0x422AA2A0UL)))
#define bM4_TMRA2_CCONR6_HICP4                    (*((volatile unsigned int*)(0x422AA2A4UL)))
#define bM4_TMRA2_CCONR6_NOFIENCP                 (*((volatile unsigned int*)(0x422AA2B0UL)))
#define bM4_TMRA2_CCONR6_NOFICKCP0                (*((volatile unsigned int*)(0x422AA2B4UL)))
#define bM4_TMRA2_CCONR6_NOFICKCP1                (*((volatile unsigned int*)(0x422AA2B8UL)))
#define bM4_TMRA2_CCONR7_CAPMD                    (*((volatile unsigned int*)(0x422AA300UL)))
#define bM4_TMRA2_CCONR7_HICP0                    (*((volatile unsigned int*)(0x422AA310UL)))
#define bM4_TMRA2_CCONR7_HICP1                    (*((volatile unsigned int*)(0x422AA314UL)))
#define bM4_TMRA2_CCONR7_HICP2                    (*((volatile unsigned int*)(0x422AA318UL)))
#define bM4_TMRA2_CCONR7_HICP3                    (*((volatile unsigned int*)(0x422AA320UL)))
#define bM4_TMRA2_CCONR7_HICP4                    (*((volatile unsigned int*)(0x422AA324UL)))
#define bM4_TMRA2_CCONR7_NOFIENCP                 (*((volatile unsigned int*)(0x422AA330UL)))
#define bM4_TMRA2_CCONR7_NOFICKCP0                (*((volatile unsigned int*)(0x422AA334UL)))
#define bM4_TMRA2_CCONR7_NOFICKCP1                (*((volatile unsigned int*)(0x422AA338UL)))
#define bM4_TMRA2_CCONR8_CAPMD                    (*((volatile unsigned int*)(0x422AA380UL)))
#define bM4_TMRA2_CCONR8_HICP0                    (*((volatile unsigned int*)(0x422AA390UL)))
#define bM4_TMRA2_CCONR8_HICP1                    (*((volatile unsigned int*)(0x422AA394UL)))
#define bM4_TMRA2_CCONR8_HICP2                    (*((volatile unsigned int*)(0x422AA398UL)))
#define bM4_TMRA2_CCONR8_HICP3                    (*((volatile unsigned int*)(0x422AA3A0UL)))
#define bM4_TMRA2_CCONR8_HICP4                    (*((volatile unsigned int*)(0x422AA3A4UL)))
#define bM4_TMRA2_CCONR8_NOFIENCP                 (*((volatile unsigned int*)(0x422AA3B0UL)))
#define bM4_TMRA2_CCONR8_NOFICKCP0                (*((volatile unsigned int*)(0x422AA3B4UL)))
#define bM4_TMRA2_CCONR8_NOFICKCP1                (*((volatile unsigned int*)(0x422AA3B8UL)))
#define bM4_TMRA2_PCONR1_STAC0                    (*((volatile unsigned int*)(0x422AA800UL)))
#define bM4_TMRA2_PCONR1_STAC1                    (*((volatile unsigned int*)(0x422AA804UL)))
#define bM4_TMRA2_PCONR1_STPC0                    (*((volatile unsigned int*)(0x422AA808UL)))
#define bM4_TMRA2_PCONR1_STPC1                    (*((volatile unsigned int*)(0x422AA80CUL)))
#define bM4_TMRA2_PCONR1_CMPC0                    (*((volatile unsigned int*)(0x422AA810UL)))
#define bM4_TMRA2_PCONR1_CMPC1                    (*((volatile unsigned int*)(0x422AA814UL)))
#define bM4_TMRA2_PCONR1_PERC0                    (*((volatile unsigned int*)(0x422AA818UL)))
#define bM4_TMRA2_PCONR1_PERC1                    (*((volatile unsigned int*)(0x422AA81CUL)))
#define bM4_TMRA2_PCONR1_FORC0                    (*((volatile unsigned int*)(0x422AA820UL)))
#define bM4_TMRA2_PCONR1_FORC1                    (*((volatile unsigned int*)(0x422AA824UL)))
#define bM4_TMRA2_PCONR1_OUTEN                    (*((volatile unsigned int*)(0x422AA830UL)))
#define bM4_TMRA2_PCONR2_STAC0                    (*((volatile unsigned int*)(0x422AA880UL)))
#define bM4_TMRA2_PCONR2_STAC1                    (*((volatile unsigned int*)(0x422AA884UL)))
#define bM4_TMRA2_PCONR2_STPC0                    (*((volatile unsigned int*)(0x422AA888UL)))
#define bM4_TMRA2_PCONR2_STPC1                    (*((volatile unsigned int*)(0x422AA88CUL)))
#define bM4_TMRA2_PCONR2_CMPC0                    (*((volatile unsigned int*)(0x422AA890UL)))
#define bM4_TMRA2_PCONR2_CMPC1                    (*((volatile unsigned int*)(0x422AA894UL)))
#define bM4_TMRA2_PCONR2_PERC0                    (*((volatile unsigned int*)(0x422AA898UL)))
#define bM4_TMRA2_PCONR2_PERC1                    (*((volatile unsigned int*)(0x422AA89CUL)))
#define bM4_TMRA2_PCONR2_FORC0                    (*((volatile unsigned int*)(0x422AA8A0UL)))
#define bM4_TMRA2_PCONR2_FORC1                    (*((volatile unsigned int*)(0x422AA8A4UL)))
#define bM4_TMRA2_PCONR2_OUTEN                    (*((volatile unsigned int*)(0x422AA8B0UL)))
#define bM4_TMRA2_PCONR3_STAC0                    (*((volatile unsigned int*)(0x422AA900UL)))
#define bM4_TMRA2_PCONR3_STAC1                    (*((volatile unsigned int*)(0x422AA904UL)))
#define bM4_TMRA2_PCONR3_STPC0                    (*((volatile unsigned int*)(0x422AA908UL)))
#define bM4_TMRA2_PCONR3_STPC1                    (*((volatile unsigned int*)(0x422AA90CUL)))
#define bM4_TMRA2_PCONR3_CMPC0                    (*((volatile unsigned int*)(0x422AA910UL)))
#define bM4_TMRA2_PCONR3_CMPC1                    (*((volatile unsigned int*)(0x422AA914UL)))
#define bM4_TMRA2_PCONR3_PERC0                    (*((volatile unsigned int*)(0x422AA918UL)))
#define bM4_TMRA2_PCONR3_PERC1                    (*((volatile unsigned int*)(0x422AA91CUL)))
#define bM4_TMRA2_PCONR3_FORC0                    (*((volatile unsigned int*)(0x422AA920UL)))
#define bM4_TMRA2_PCONR3_FORC1                    (*((volatile unsigned int*)(0x422AA924UL)))
#define bM4_TMRA2_PCONR3_OUTEN                    (*((volatile unsigned int*)(0x422AA930UL)))
#define bM4_TMRA2_PCONR4_STAC0                    (*((volatile unsigned int*)(0x422AA980UL)))
#define bM4_TMRA2_PCONR4_STAC1                    (*((volatile unsigned int*)(0x422AA984UL)))
#define bM4_TMRA2_PCONR4_STPC0                    (*((volatile unsigned int*)(0x422AA988UL)))
#define bM4_TMRA2_PCONR4_STPC1                    (*((volatile unsigned int*)(0x422AA98CUL)))
#define bM4_TMRA2_PCONR4_CMPC0                    (*((volatile unsigned int*)(0x422AA990UL)))
#define bM4_TMRA2_PCONR4_CMPC1                    (*((volatile unsigned int*)(0x422AA994UL)))
#define bM4_TMRA2_PCONR4_PERC0                    (*((volatile unsigned int*)(0x422AA998UL)))
#define bM4_TMRA2_PCONR4_PERC1                    (*((volatile unsigned int*)(0x422AA99CUL)))
#define bM4_TMRA2_PCONR4_FORC0                    (*((volatile unsigned int*)(0x422AA9A0UL)))
#define bM4_TMRA2_PCONR4_FORC1                    (*((volatile unsigned int*)(0x422AA9A4UL)))
#define bM4_TMRA2_PCONR4_OUTEN                    (*((volatile unsigned int*)(0x422AA9B0UL)))
#define bM4_TMRA2_PCONR5_STAC0                    (*((volatile unsigned int*)(0x422AAA00UL)))
#define bM4_TMRA2_PCONR5_STAC1                    (*((volatile unsigned int*)(0x422AAA04UL)))
#define bM4_TMRA2_PCONR5_STPC0                    (*((volatile unsigned int*)(0x422AAA08UL)))
#define bM4_TMRA2_PCONR5_STPC1                    (*((volatile unsigned int*)(0x422AAA0CUL)))
#define bM4_TMRA2_PCONR5_CMPC0                    (*((volatile unsigned int*)(0x422AAA10UL)))
#define bM4_TMRA2_PCONR5_CMPC1                    (*((volatile unsigned int*)(0x422AAA14UL)))
#define bM4_TMRA2_PCONR5_PERC0                    (*((volatile unsigned int*)(0x422AAA18UL)))
#define bM4_TMRA2_PCONR5_PERC1                    (*((volatile unsigned int*)(0x422AAA1CUL)))
#define bM4_TMRA2_PCONR5_FORC0                    (*((volatile unsigned int*)(0x422AAA20UL)))
#define bM4_TMRA2_PCONR5_FORC1                    (*((volatile unsigned int*)(0x422AAA24UL)))
#define bM4_TMRA2_PCONR5_OUTEN                    (*((volatile unsigned int*)(0x422AAA30UL)))
#define bM4_TMRA2_PCONR6_STAC0                    (*((volatile unsigned int*)(0x422AAA80UL)))
#define bM4_TMRA2_PCONR6_STAC1                    (*((volatile unsigned int*)(0x422AAA84UL)))
#define bM4_TMRA2_PCONR6_STPC0                    (*((volatile unsigned int*)(0x422AAA88UL)))
#define bM4_TMRA2_PCONR6_STPC1                    (*((volatile unsigned int*)(0x422AAA8CUL)))
